node {
  name: "conv1/XavierFill"
  op: "XavierFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
          dim {
            size: 1
          }
          dim {
            size: 5
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
}
node {
  name: "conv1/ConstantFill"
  op: "ConstantFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 20
          }
        }
      }
    }
  }
}
node {
  name: "conv1/XavierFill_1"
  op: "XavierFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
          dim {
            size: 20
          }
          dim {
            size: 5
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
}
node {
  name: "conv1/ConstantFill_1"
  op: "ConstantFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 100
          }
        }
      }
    }
  }
}
node {
  name: "classifier/XavierFill"
  op: "XavierFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 500
          }
          dim {
            size: 1600
          }
        }
      }
    }
  }
}
node {
  name: "classifier/ConstantFill"
  op: "ConstantFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 500
          }
        }
      }
    }
  }
}
node {
  name: "classifier/XavierFill_1"
  op: "XavierFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 10
          }
          dim {
            size: 500
          }
        }
      }
    }
  }
}
node {
  name: "classifier/ConstantFill_1"
  op: "ConstantFill"
  device: "/cpu:*"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 10
          }
        }
      }
    }
  }
}
node {
  name: "conv1/Conv"
  op: "Conv"
  input: "conv1/data"
  input: "conv1/conv1_w"
  input: "conv1/conv1_b"
  device: "/cpu:*"
  attr {
    key: "exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 5
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "conv1/MaxPool"
  op: "MaxPool"
  input: "conv1/conv1"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 2
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "stride"
    value {
      i: 2
    }
  }
}
node {
  name: "conv1/Conv_1"
  op: "Conv"
  input: "conv1/pool1"
  input: "conv1/conv2_w"
  input: "conv1/conv2_b"
  device: "/cpu:*"
  attr {
    key: "exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 5
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "conv1/MaxPool_1"
  op: "MaxPool"
  input: "conv1/conv2"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 2
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "stride"
    value {
      i: 2
    }
  }
}
node {
  name: "classifier/FC"
  op: "FC"
  input: "conv1/pool2"
  input: "classifier/fc3_w"
  input: "classifier/fc3_b"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "use_cudnn"
    value {
      i: 1
    }
  }
}
node {
  name: "classifier/Relu"
  op: "Relu"
  input: "classifier/fc3"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "classifier/FC_1"
  op: "FC"
  input: "classifier/fc3_1"
  input: "classifier/pred_w"
  input: "classifier/pred_b"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "use_cudnn"
    value {
      i: 1
    }
  }
}
node {
  name: "classifier/Softmax"
  op: "Softmax"
  input: "classifier/pred"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "classifier/LabelCrossEntropy"
  op: "LabelCrossEntropy"
  input: "classifier/softmax"
  input: "classifier/label"
  device: "/cpu:*"
}
node {
  name: "classifier/AveragedLoss"
  op: "AveragedLoss"
  input: "classifier/xent"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/ConstantFill"
  op: "ConstantFill"
  input: "classifier/loss"
  device: "/cpu:*"
  attr {
    key: "value"
    value {
      f: 1.0
    }
  }
}
node {
  name: "GRADIENTS/classifier/AveragedLossGradient"
  op: "AveragedLossGradient"
  input: "classifier/xent"
  input: "GRADIENTS/classifier/loss_autogen_grad"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/LabelCrossEntropyGradient"
  op: "LabelCrossEntropyGradient"
  input: "classifier/softmax"
  input: "classifier/label"
  input: "GRADIENTS/classifier/xent_grad"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/SoftmaxGradient"
  op: "SoftmaxGradient"
  input: "classifier/softmax"
  input: "GRADIENTS/classifier/softmax_grad"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "GRADIENTS/classifier/FCGradient"
  op: "FCGradient"
  input: "classifier/fc3_1"
  input: "classifier/pred_w"
  input: "GRADIENTS/classifier/pred_grad"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "use_cudnn"
    value {
      i: 1
    }
  }
}
node {
  name: "GRADIENTS/classifier/ReluGradient"
  op: "ReluGradient"
  input: "classifier/fc3_1"
  input: "GRADIENTS/classifier/fc3_grad"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "GRADIENTS/c/FCGradient"
  op: "FCGradient"
  input: "conv1/pool2"
  input: "classifier/fc3_w"
  input: "GRADIENTS/classifier/fc3_grad_1"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "use_cudnn"
    value {
      i: 1
    }
  }
}
node {
  name: "GRADIENTS/conv1/MaxPoolGradient"
  op: "MaxPoolGradient"
  input: "conv1/conv2"
  input: "conv1/pool2"
  input: "GRADIENTS/conv1/pool2_grad"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 2
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "stride"
    value {
      i: 2
    }
  }
}
node {
  name: "GRADIENTS/conv1/ConvGradient"
  op: "ConvGradient"
  input: "conv1/pool1"
  input: "conv1/conv2_w"
  input: "GRADIENTS/conv1/conv2_grad"
  device: "/cpu:*"
  attr {
    key: "exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 5
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "GRADIENTS/conv1/MaxPoolGradient_1"
  op: "MaxPoolGradient"
  input: "conv1/conv1"
  input: "conv1/pool1"
  input: "GRADIENTS/conv1/pool1_grad"
  device: "/cpu:*"
  attr {
    key: "cudnn_exhaustive_search"
    value {
      i: 0
    }
  }
  attr {
    key: "kernel"
    value {
      i: 2
    }
  }
  attr {
    key: "order"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "stride"
    value {
      i: 2
    }
  }
}
node {
  name: "conv1/conv1_w"
  op: "Blob"
  input: "conv1/XavierFill:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv1_b"
  op: "Blob"
  input: "conv1/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2_w"
  op: "Blob"
  input: "conv1/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2_b"
  op: "Blob"
  input: "conv1/ConstantFill_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_w"
  op: "Blob"
  input: "classifier/XavierFill:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_b"
  op: "Blob"
  input: "classifier/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred_w"
  op: "Blob"
  input: "classifier/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred_b"
  op: "Blob"
  input: "classifier/ConstantFill_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/data"
  op: "Placeholder"
}
node {
  name: "conv1/conv1_w"
  op: "Blob"
  input: "conv1/XavierFill:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv1_b"
  op: "Blob"
  input: "conv1/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv1"
  op: "Blob"
  input: "conv1/Conv:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv1"
  op: "Blob"
  input: "conv1/Conv:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool1"
  op: "Blob"
  input: "conv1/MaxPool:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool1"
  op: "Blob"
  input: "conv1/MaxPool:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2_w"
  op: "Blob"
  input: "conv1/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2_b"
  op: "Blob"
  input: "conv1/ConstantFill_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2"
  op: "Blob"
  input: "conv1/Conv_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2"
  op: "Blob"
  input: "conv1/Conv_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool2"
  op: "Blob"
  input: "conv1/MaxPool_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool2"
  op: "Blob"
  input: "conv1/MaxPool_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_w"
  op: "Blob"
  input: "classifier/XavierFill:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_b"
  op: "Blob"
  input: "classifier/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3"
  op: "Blob"
  input: "classifier/FC:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3"
  op: "Blob"
  input: "classifier/FC:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_1"
  op: "Blob"
  input: "classifier/Relu:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_1"
  op: "Blob"
  input: "classifier/Relu:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred_w"
  op: "Blob"
  input: "classifier/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred_b"
  op: "Blob"
  input: "classifier/ConstantFill_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred"
  op: "Blob"
  input: "classifier/FC_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred"
  op: "Blob"
  input: "classifier/FC_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/softmax"
  op: "Blob"
  input: "classifier/Softmax:0"
  device: "/cpu:*"
}
node {
  name: "classifier/softmax"
  op: "Blob"
  input: "classifier/Softmax:0"
  device: "/cpu:*"
}
node {
  name: "classifier/label"
  op: "Placeholder"
}
node {
  name: "classifier/xent"
  op: "Blob"
  input: "classifier/LabelCrossEntropy:0"
  device: "/cpu:*"
}
node {
  name: "classifier/xent"
  op: "Blob"
  input: "classifier/LabelCrossEntropy:0"
  device: "/cpu:*"
}
node {
  name: "classifier/loss"
  op: "Blob"
  input: "classifier/AveragedLoss:0"
  device: "/cpu:*"
}
node {
  name: "classifier/loss"
  op: "Blob"
  input: "classifier/AveragedLoss:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/loss_autogen_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "classifier/xent"
  op: "Blob"
  input: "classifier/LabelCrossEntropy:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/loss_autogen_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/ConstantFill:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/xent_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/AveragedLossGradient:0"
  device: "/cpu:*"
}
node {
  name: "classifier/softmax"
  op: "Blob"
  input: "classifier/Softmax:0"
  device: "/cpu:*"
}
node {
  name: "classifier/label"
  op: "Placeholder"
}
node {
  name: "GRADIENTS/classifier/xent_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/AveragedLossGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/softmax_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/LabelCrossEntropyGradient:0"
  device: "/cpu:*"
}
node {
  name: "classifier/softmax"
  op: "Blob"
  input: "classifier/Softmax:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/softmax_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/LabelCrossEntropyGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/pred_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/SoftmaxGradient:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_1"
  op: "Blob"
  input: "classifier/Relu:0"
  device: "/cpu:*"
}
node {
  name: "classifier/pred_w"
  op: "Blob"
  input: "classifier/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/pred_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/SoftmaxGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/pred_w_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/FCGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/pred_b_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/FCGradient:1"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/FCGradient:2"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_1"
  op: "Blob"
  input: "classifier/Relu:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_grad"
  op: "Blob"
  input: "GRADIENTS/classifier/FCGradient:2"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_grad_1"
  op: "Blob"
  input: "GRADIENTS/classifier/ReluGradient:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool2"
  op: "Blob"
  input: "conv1/MaxPool_1:0"
  device: "/cpu:*"
}
node {
  name: "classifier/fc3_w"
  op: "Blob"
  input: "classifier/XavierFill:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_grad_1"
  op: "Blob"
  input: "GRADIENTS/classifier/ReluGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_w_grad"
  op: "Blob"
  input: "GRADIENTS/c/FCGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/classifier/fc3_b_grad"
  op: "Blob"
  input: "GRADIENTS/c/FCGradient:1"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/pool2_grad"
  op: "Blob"
  input: "GRADIENTS/c/FCGradient:2"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2"
  op: "Blob"
  input: "conv1/Conv_1:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool2"
  op: "Blob"
  input: "conv1/MaxPool_1:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/pool2_grad"
  op: "Blob"
  input: "GRADIENTS/c/FCGradient:2"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/conv2_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/MaxPoolGradient:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool1"
  op: "Blob"
  input: "conv1/MaxPool:0"
  device: "/cpu:*"
}
node {
  name: "conv1/conv2_w"
  op: "Blob"
  input: "conv1/XavierFill_1:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/conv2_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/MaxPoolGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/conv2_w_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/ConvGradient:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/conv2_b_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/ConvGradient:1"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/pool1_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/ConvGradient:2"
  device: "/cpu:*"
}
node {
  name: "conv1/conv1"
  op: "Blob"
  input: "conv1/Conv:0"
  device: "/cpu:*"
}
node {
  name: "conv1/pool1"
  op: "Blob"
  input: "conv1/MaxPool:0"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/pool1_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/ConvGradient:2"
  device: "/cpu:*"
}
node {
  name: "GRADIENTS/conv1/conv1_grad"
  op: "Blob"
  input: "GRADIENTS/conv1/MaxPoolGradient_1:0"
  device: "/cpu:*"
}
