ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "268"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "268"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "269"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "269"
    output: "270"
    op_type: "Relu"
  }
  node {
    input: "270"
    output: "271"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "271"
    input: "6"
    output: "272"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "272"
    input: "7"
    input: "8"
    input: "9"
    input: "10"
    output: "273"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "273"
    output: "274"
    op_type: "Relu"
  }
  node {
    input: "274"
    input: "11"
    output: "275"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "275"
    input: "12"
    input: "13"
    input: "14"
    input: "15"
    output: "276"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "276"
    output: "277"
    op_type: "Relu"
  }
  node {
    input: "277"
    input: "16"
    output: "278"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "278"
    input: "17"
    input: "18"
    input: "19"
    input: "20"
    output: "279"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "271"
    input: "21"
    output: "280"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "280"
    input: "22"
    input: "23"
    input: "24"
    input: "25"
    output: "281"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "279"
    input: "281"
    output: "282"
    op_type: "Add"
  }
  node {
    input: "282"
    output: "283"
    op_type: "Relu"
  }
  node {
    input: "283"
    input: "26"
    output: "284"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "284"
    input: "27"
    input: "28"
    input: "29"
    input: "30"
    output: "285"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "285"
    output: "286"
    op_type: "Relu"
  }
  node {
    input: "286"
    input: "31"
    output: "287"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "287"
    input: "32"
    input: "33"
    input: "34"
    input: "35"
    output: "288"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "288"
    output: "289"
    op_type: "Relu"
  }
  node {
    input: "289"
    input: "36"
    output: "290"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "290"
    input: "37"
    input: "38"
    input: "39"
    input: "40"
    output: "291"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "291"
    input: "283"
    output: "292"
    op_type: "Add"
  }
  node {
    input: "292"
    output: "293"
    op_type: "Relu"
  }
  node {
    input: "293"
    input: "41"
    output: "294"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "294"
    input: "42"
    input: "43"
    input: "44"
    input: "45"
    output: "295"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "295"
    output: "296"
    op_type: "Relu"
  }
  node {
    input: "296"
    input: "46"
    output: "297"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "297"
    input: "47"
    input: "48"
    input: "49"
    input: "50"
    output: "298"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "298"
    output: "299"
    op_type: "Relu"
  }
  node {
    input: "299"
    input: "51"
    output: "300"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "300"
    input: "52"
    input: "53"
    input: "54"
    input: "55"
    output: "301"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "301"
    input: "293"
    output: "302"
    op_type: "Add"
  }
  node {
    input: "302"
    output: "303"
    op_type: "Relu"
  }
  node {
    input: "303"
    input: "56"
    output: "304"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "304"
    input: "57"
    input: "58"
    input: "59"
    input: "60"
    output: "305"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "305"
    output: "306"
    op_type: "Relu"
  }
  node {
    input: "306"
    input: "61"
    output: "307"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "307"
    input: "62"
    input: "63"
    input: "64"
    input: "65"
    output: "308"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "308"
    output: "309"
    op_type: "Relu"
  }
  node {
    input: "309"
    input: "66"
    output: "310"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "310"
    input: "67"
    input: "68"
    input: "69"
    input: "70"
    output: "311"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "303"
    input: "71"
    output: "312"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "312"
    input: "72"
    input: "73"
    input: "74"
    input: "75"
    output: "313"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "311"
    input: "313"
    output: "314"
    op_type: "Add"
  }
  node {
    input: "314"
    output: "315"
    op_type: "Relu"
  }
  node {
    input: "315"
    input: "76"
    output: "316"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "316"
    input: "77"
    input: "78"
    input: "79"
    input: "80"
    output: "317"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "317"
    output: "318"
    op_type: "Relu"
  }
  node {
    input: "318"
    input: "81"
    output: "319"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "319"
    input: "82"
    input: "83"
    input: "84"
    input: "85"
    output: "320"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "320"
    output: "321"
    op_type: "Relu"
  }
  node {
    input: "321"
    input: "86"
    output: "322"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "322"
    input: "87"
    input: "88"
    input: "89"
    input: "90"
    output: "323"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "323"
    input: "315"
    output: "324"
    op_type: "Add"
  }
  node {
    input: "324"
    output: "325"
    op_type: "Relu"
  }
  node {
    input: "325"
    input: "91"
    output: "326"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "326"
    input: "92"
    input: "93"
    input: "94"
    input: "95"
    output: "327"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "327"
    output: "328"
    op_type: "Relu"
  }
  node {
    input: "328"
    input: "96"
    output: "329"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "329"
    input: "97"
    input: "98"
    input: "99"
    input: "100"
    output: "330"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "330"
    output: "331"
    op_type: "Relu"
  }
  node {
    input: "331"
    input: "101"
    output: "332"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "332"
    input: "102"
    input: "103"
    input: "104"
    input: "105"
    output: "333"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "333"
    input: "325"
    output: "334"
    op_type: "Add"
  }
  node {
    input: "334"
    output: "335"
    op_type: "Relu"
  }
  node {
    input: "335"
    input: "106"
    output: "336"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "336"
    input: "107"
    input: "108"
    input: "109"
    input: "110"
    output: "337"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "337"
    output: "338"
    op_type: "Relu"
  }
  node {
    input: "338"
    input: "111"
    output: "339"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "339"
    input: "112"
    input: "113"
    input: "114"
    input: "115"
    output: "340"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "340"
    output: "341"
    op_type: "Relu"
  }
  node {
    input: "341"
    input: "116"
    output: "342"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "342"
    input: "117"
    input: "118"
    input: "119"
    input: "120"
    output: "343"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "343"
    input: "335"
    output: "344"
    op_type: "Add"
  }
  node {
    input: "344"
    output: "345"
    op_type: "Relu"
  }
  node {
    input: "345"
    input: "121"
    output: "346"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "346"
    input: "122"
    input: "123"
    input: "124"
    input: "125"
    output: "347"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "347"
    output: "348"
    op_type: "Relu"
  }
  node {
    input: "348"
    input: "126"
    output: "349"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "349"
    input: "127"
    input: "128"
    input: "129"
    input: "130"
    output: "350"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "350"
    output: "351"
    op_type: "Relu"
  }
  node {
    input: "351"
    input: "131"
    output: "352"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "352"
    input: "132"
    input: "133"
    input: "134"
    input: "135"
    output: "353"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "345"
    input: "136"
    output: "354"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "354"
    input: "137"
    input: "138"
    input: "139"
    input: "140"
    output: "355"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "353"
    input: "355"
    output: "356"
    op_type: "Add"
  }
  node {
    input: "356"
    output: "357"
    op_type: "Relu"
  }
  node {
    input: "357"
    input: "141"
    output: "358"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "358"
    input: "142"
    input: "143"
    input: "144"
    input: "145"
    output: "359"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "359"
    output: "360"
    op_type: "Relu"
  }
  node {
    input: "360"
    input: "146"
    output: "361"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "361"
    input: "147"
    input: "148"
    input: "149"
    input: "150"
    output: "362"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "362"
    output: "363"
    op_type: "Relu"
  }
  node {
    input: "363"
    input: "151"
    output: "364"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "364"
    input: "152"
    input: "153"
    input: "154"
    input: "155"
    output: "365"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "365"
    input: "357"
    output: "366"
    op_type: "Add"
  }
  node {
    input: "366"
    output: "367"
    op_type: "Relu"
  }
  node {
    input: "367"
    input: "156"
    output: "368"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "368"
    input: "157"
    input: "158"
    input: "159"
    input: "160"
    output: "369"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "369"
    output: "370"
    op_type: "Relu"
  }
  node {
    input: "370"
    input: "161"
    output: "371"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "371"
    input: "162"
    input: "163"
    input: "164"
    input: "165"
    output: "372"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "372"
    output: "373"
    op_type: "Relu"
  }
  node {
    input: "373"
    input: "166"
    output: "374"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "374"
    input: "167"
    input: "168"
    input: "169"
    input: "170"
    output: "375"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "375"
    input: "367"
    output: "376"
    op_type: "Add"
  }
  node {
    input: "376"
    output: "377"
    op_type: "Relu"
  }
  node {
    input: "377"
    input: "171"
    output: "378"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "378"
    input: "172"
    input: "173"
    input: "174"
    input: "175"
    output: "379"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "379"
    output: "380"
    op_type: "Relu"
  }
  node {
    input: "380"
    input: "176"
    output: "381"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "381"
    input: "177"
    input: "178"
    input: "179"
    input: "180"
    output: "382"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "382"
    output: "383"
    op_type: "Relu"
  }
  node {
    input: "383"
    input: "181"
    output: "384"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "384"
    input: "182"
    input: "183"
    input: "184"
    input: "185"
    output: "385"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "385"
    input: "377"
    output: "386"
    op_type: "Add"
  }
  node {
    input: "386"
    output: "387"
    op_type: "Relu"
  }
  node {
    input: "387"
    input: "186"
    output: "388"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "388"
    input: "187"
    input: "188"
    input: "189"
    input: "190"
    output: "389"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "389"
    output: "390"
    op_type: "Relu"
  }
  node {
    input: "390"
    input: "191"
    output: "391"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "391"
    input: "192"
    input: "193"
    input: "194"
    input: "195"
    output: "392"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "392"
    output: "393"
    op_type: "Relu"
  }
  node {
    input: "393"
    input: "196"
    output: "394"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "394"
    input: "197"
    input: "198"
    input: "199"
    input: "200"
    output: "395"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "395"
    input: "387"
    output: "396"
    op_type: "Add"
  }
  node {
    input: "396"
    output: "397"
    op_type: "Relu"
  }
  node {
    input: "397"
    input: "201"
    output: "398"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "398"
    input: "202"
    input: "203"
    input: "204"
    input: "205"
    output: "399"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "399"
    output: "400"
    op_type: "Relu"
  }
  node {
    input: "400"
    input: "206"
    output: "401"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "401"
    input: "207"
    input: "208"
    input: "209"
    input: "210"
    output: "402"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "402"
    output: "403"
    op_type: "Relu"
  }
  node {
    input: "403"
    input: "211"
    output: "404"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "404"
    input: "212"
    input: "213"
    input: "214"
    input: "215"
    output: "405"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "405"
    input: "397"
    output: "406"
    op_type: "Add"
  }
  node {
    input: "406"
    output: "407"
    op_type: "Relu"
  }
  node {
    input: "407"
    input: "216"
    output: "408"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "408"
    input: "217"
    input: "218"
    input: "219"
    input: "220"
    output: "409"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "409"
    output: "410"
    op_type: "Relu"
  }
  node {
    input: "410"
    input: "221"
    output: "411"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "411"
    input: "222"
    input: "223"
    input: "224"
    input: "225"
    output: "412"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "412"
    output: "413"
    op_type: "Relu"
  }
  node {
    input: "413"
    input: "226"
    output: "414"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "414"
    input: "227"
    input: "228"
    input: "229"
    input: "230"
    output: "415"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "407"
    input: "231"
    output: "416"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "416"
    input: "232"
    input: "233"
    input: "234"
    input: "235"
    output: "417"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "415"
    input: "417"
    output: "418"
    op_type: "Add"
  }
  node {
    input: "418"
    output: "419"
    op_type: "Relu"
  }
  node {
    input: "419"
    input: "236"
    output: "420"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "420"
    input: "237"
    input: "238"
    input: "239"
    input: "240"
    output: "421"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "421"
    output: "422"
    op_type: "Relu"
  }
  node {
    input: "422"
    input: "241"
    output: "423"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
