ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    output: "103"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "103"
    input: "3"
    input: "4"
    input: "5"
    input: "6"
    output: "104"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "104"
    output: "105"
    op_type: "Relu"
  }
  node {
    input: "105"
    input: "7"
    input: "8"
    output: "106"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "106"
    input: "9"
    input: "10"
    input: "11"
    input: "12"
    output: "107"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "107"
    output: "108"
    op_type: "Relu"
  }
  node {
    input: "108"
    output: "109"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "109"
    input: "13"
    input: "14"
    output: "110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "110"
    input: "15"
    input: "16"
    input: "17"
    input: "18"
    output: "111"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "111"
    output: "112"
    op_type: "Relu"
  }
  node {
    input: "112"
    input: "19"
    input: "20"
    output: "113"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "113"
    input: "21"
    input: "22"
    input: "23"
    input: "24"
    output: "114"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "114"
    output: "115"
    op_type: "Relu"
  }
  node {
    input: "115"
    output: "116"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "116"
    input: "25"
    input: "26"
    output: "117"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "117"
    input: "27"
    input: "28"
    input: "29"
    input: "30"
    output: "118"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "118"
    output: "119"
    op_type: "Relu"
  }
  node {
    input: "119"
    input: "31"
    input: "32"
    output: "120"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "120"
    input: "33"
    input: "34"
    input: "35"
    input: "36"
    output: "121"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "121"
    output: "122"
    op_type: "Relu"
  }
  node {
    input: "122"
    input: "37"
    input: "38"
    output: "123"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "123"
    input: "39"
    input: "40"
    input: "41"
    input: "42"
    output: "124"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "124"
    output: "125"
    op_type: "Relu"
  }
  node {
    input: "125"
    input: "43"
    input: "44"
    output: "126"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "126"
    input: "45"
    input: "46"
    input: "47"
    input: "48"
    output: "127"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "127"
    output: "128"
    op_type: "Relu"
  }
  node {
    input: "128"
    output: "129"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "129"
    input: "49"
    input: "50"
    output: "130"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "130"
    input: "51"
    input: "52"
    input: "53"
    input: "54"
    output: "131"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "131"
    output: "132"
    op_type: "Relu"
  }
  node {
    input: "132"
    input: "55"
    input: "56"
    output: "133"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "133"
    input: "57"
    input: "58"
    input: "59"
    input: "60"
    output: "134"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "134"
    output: "135"
    op_type: "Relu"
  }
  node {
    input: "135"
    input: "61"
    input: "62"
    output: "136"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "136"
    input: "63"
    input: "64"
    input: "65"
    input: "66"
    output: "137"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "137"
    output: "138"
    op_type: "Relu"
  }
  node {
    input: "138"
    input: "67"
    input: "68"
    output: "139"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "139"
    input: "69"
    input: "70"
    input: "71"
    input: "72"
    output: "140"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "140"
    output: "141"
    op_type: "Relu"
  }
  node {
    input: "141"
    output: "142"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "142"
    input: "73"
    input: "74"
    output: "143"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "143"
    input: "75"
    input: "76"
    input: "77"
    input: "78"
    output: "144"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "144"
    output: "145"
    op_type: "Relu"
  }
  node {
    input: "145"
    input: "79"
    input: "80"
    output: "146"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "146"
    input: "81"
    input: "82"
    input: "83"
    input: "84"
    output: "147"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "147"
    output: "148"
    op_type: "Relu"
  }
  node {
    input: "148"
    input: "85"
    input: "86"
    output: "149"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "149"
    input: "87"
    input: "88"
    input: "89"
    input: "90"
    output: "150"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "150"
    output: "151"
    op_type: "Relu"
  }
  node {
    input: "151"
    input: "91"
    input: "92"
    output: "152"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "152"
    input: "93"
    input: "94"
    input: "95"
    input: "96"
    output: "153"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "153"
    output: "154"
    op_type: "Relu"
  }
  node {
    input: "154"
    output: "155"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "155"
    output: "156"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "156"
    input: "97"
    input: "98"
    output: "157"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "157"
    output: "158"
    op_type: "Relu"
  }
  node {
    input: "158"
    output: "159"
    output: "160"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "159"
    input: "99"
    input: "100"
    output: "161"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "161"
    output: "162"
    op_type: "Relu"
  }
  node {
    input: "162"
    output: "163"
    output: "164"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "163"
    input: "101"
    input: "102"
    output: "165"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "21"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "22"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "23"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "24"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "25"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "26"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "27"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "28"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "29"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "30"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "31"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "32"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "33"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "34"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "35"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "36"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "37"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "38"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "39"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "40"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "41"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "42"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "43"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "44"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "45"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "46"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "47"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "48"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "49"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "50"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "51"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "52"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "53"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "54"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "55"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "56"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "57"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "58"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "59"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "60"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "61"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "62"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "63"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "64"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "65"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "66"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "67"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "68"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "69"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "70"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "71"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "72"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "73"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "74"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "75"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "76"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "77"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "78"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "79"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "80"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "81"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "82"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "83"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "84"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "85"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "86"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "87"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "88"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "89"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "90"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "91"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "92"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "93"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "94"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "95"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "96"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "97"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 25088
          }
        }
      }
    }
  }
  input {
    name: "98"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "99"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "100"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "101"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
          dim {
            dim_value: 4096
          }
        }
      }
    }
  }
  input {
    name: "102"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  output {
    name: "165"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
}
opset_import {
  version: 6
}
