node {
  input: "1"
  input: "2"
  output: "3"
  op_type: "Add"
}
node {
  input: "1"
  input: "3"
  output: "4"
  op_type: "Mul"
}
node {
  input: "4"
  output: "5"
  op_type: "Tanh"
}
node {
  input: "5"
  output: "6"
  op_type: "Sigmoid"
}
node {
  input: "6"
  output: "7"
  op_type: "Scale"
  attribute {
    name: "scale"
    f: -1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
output: "7"
