node {
  name: "input/x_8"
  op: "IO Node"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: ""
    }
  }
}
node {
  name: "output/output.1"
  op: "IO Node"
  input: "myLinear/Linear[l]/18"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: ""
    }
  }
}
node {
  name: "myLinear/Linear[l]/bias/bias_16"
  op: "prim::GetAttr"
  input: "myLinear/Linear[l]/weight/l_13"
  attr {
    key: "attr"
    value {
      s: "{ name :  bias }"
    }
  }
}
node {
  name: "myLinear/Linear[l]/weight/weight_17"
  op: "prim::GetAttr"
  input: "myLinear/Linear[l]/weight/l_13"
  attr {
    key: "attr"
    value {
      s: "{ name :  weight }"
    }
  }
}
node {
  name: "myLinear/Linear[l]/18"
  op: "aten::linear"
  input: "input/x_8"
  input: "myLinear/Linear[l]/weight/weight_17"
  input: "myLinear/Linear[l]/bias/bias_16"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: "{}"
    }
  }
}
versions {
  producer: 22
}