node {
  input: "5"
  input: "1"
  input: "2"
  input: "3"
  input: "4"
  output: "7"
  output: "3"
  output: "4"
  output: "batch_norm_dead_output_10"
  output: "batch_norm_dead_output_11"
  op_type: "SpatialBN"
  attribute {
    name: "is_test"
    i: 0
  }
  attribute {
    name: "epsilon"
    f: 9.99999974737875e-06
  }
  attribute {
    name: "order"
    s: "NCHW"
  }
  attribute {
    name: "momentum"
    f: 0.899999976158142
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
output: "7"
