node {
  input: "1"
  output: "2"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
node {
  input: "2"
  output: "3"
  op_type: "Transpose"
  attribute {
    name: "perm"
    ints: 1
    ints: 0
  }
}
name: "torch-jit-export"
input: "1"
output: "3"
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
