ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    input: "2"
    output: "4"
    op_type: "Conv"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
    }
    attribute {
      name: "group"
      i: 1
    }
  }
  name: "torch-jit-export"
  input: "1"
  input: "2"
  output: "4"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: FLOAT
    name: "2"
    raw_data: "\222\017\364\2732S-\274\334#u;C\212x\275\344v\323<Q\367\014=\256\375\210\275~-V;F\030`=_\203:\275\\\006Q=\336\220\226\275\215\274\274;\362V \275A]\222\275_x\346\274\332\353Y\275 \2240=\303@\216;\321i\246=L&\230\274\273)w\274\221\273\236\2754\332\241\273\214\331S<\005\3704=O/j\275\014\230\010\275\267,n;\310\371\351<\0305\375:\332Gt<j\0017=hC\355\274+\373w\273,>^=)u\370<\351\016q=\324>==S}\335\274\334Y\232\272\220\356\035\271\267\'\250=\t\314L\275\324`\026\275\261i\217<{\313\321\273\311\033\244\274\274|\240\275\206\377\226:q\375\217\275B\250\202;\301\227n\275$1k=\210\025\026=\364\370e\273\255\264\330\274</\222=I\335\373;\016\236\343\274\236\302\265\274\001o\237\275v\037\t\275|s\323\274\225\354#\2756\200\250\275\2052\275\273\267\344`\275K\233\335<@\3713=\223\002\016\275]\354\216\272\\\352\314\274k\354-=\004\205|=\214\303r\275\303\321\301\274[\326\202\275\313:4=\231,\212\275\026\232\025\275JyN\275\310\323V<\"N\334\274p\271\323\274\244\263\212\275\\\266\r=\356\304X\275;\205\'=\206\322K=K\367\215\275\345\261D=\303\307\035=_\235\250\275\275\025\006=Z\022\037<\026\314\"\273\'\377\202\275DYG\275K\206\265\273s;\200=e\313\366\272\352\3343\275\213Q3\274-J!\274\313\327d;\212\224\251\275\026\203\205=\326\200\233\274\177\307\r\275J\346\205;\035\2543=jE\373<\300\323\251=\272\"\353\274\022\331;\275)\032\234=\315\227\320\274?k/\275Z\227\250\275GYK\275\2411F\275+\341x<\365\243\022\274\376\177\350\274\031\332\274\274\373;Z\275B\255h<\257\023;<\353\3677\275\327\327\273<\206\224\370\273\002\300\236<\'B\230=\014.3=8\253\232\275\261\n1=\256h\346\2747\031t=\354E!\275\262uH=\221\367\204;3C\213\275Y\253\020=\031|\237=N\265\202\275\313\211\245=\233\212\254\274}@:=\"\006A\275\254A\277<\020\002\266\273\001J\034=\217\220\274\274\035ud=\022\221K\275\277\031\037\275\274a\204=*\014<\275kYB<\242Z\\\275E\375\222=\207\031&\275n\353{=\311`q<\316\215\217<`rm\274-\022U<\030|/\275\330\365\223;k\242M=\334\344&\275\037\252b=\t-s\275\267\326\257<\241@\205=9\022\226<\315\026\203=\270\t;\275\2740\257\273\310\030\203=\250N\226\275##a=\355pn=\271\257G\275\3200}\275\276\334\231=\'E{=\276QS<\335j\242\274\222\340x\275\007\3304\274\345]E\275J\204\020;\233\265\000<\272\343\377<\021\322\030=.nJ=\027Z&=\253\373\222<\270B?\275\271?\220=\366\177Y<M\310_=\337\215\205\275\225\271\340<!O\200=<Q\223\275\211b\230=\362\213\252\275|_%\275\216\177\023=\250H\023;\313\205\226\275\215\246\232=\303\343Z=\247ls=\224@\014\275\311\327C=\3341d\274\236\212E=\t\200\217=\241X\257<\311Z\235\275\255\247m=\001^\202\275j\224\322\274tQ\250=\355\243r=C)\002\275\020\210\200\275\007\276\"=\365\"\206\275\037\016S\275\313\231\354<\260>o;*\364\356<\200\215\271<B\273\243=O\227A\275\316\014\356<\316Z\244\275\356,\236=(\323\220\2752\211\321<\177\033\212\275t\356\320\274\033\261\004\275\005\342M=\342\'\245<\301\200\313\2747K\241=\374\\\271<-\016\212<\\]\200=z\256a=K\203\230\275P.\333<\204\035(\275\365N\t=\0058\252\274W\313\017=Im\r\275(\'\307\274*\220!=\255\376==\255^d=\233\277\250\275G\356\226=\361\221\346:\334\266><\021\023o=(\265*=\267s\364\274\3345\247\274\251\033\206<\367:l\275z\347R; \333\317<Z%0\275\252\326P=\231S\020\275\256b>\275K\340K=`#u\273Z\201\r=\246-\224\274\331]\306\274\"j\024<\3251\006<B\334\231\274aM\203;\025\374\250<?\272\310<\013~\353\273\272qi\275f\302\206=\222\371\251\275\216\231\257\273\344+\031=\227\255a=\232^\216=\021\243\360<)w\023\275+<2=`\024y\275\363\241\341<(\376$\274\031\212\203=o\303\334\273\036\202\r\273\245\206\310;\014?\241=?\347\026\275\320\014r\275Uc\227\275\351\336\020\275$\361D\275\033\037%=Y\021\227\275\n\261t\274\332=\223=\000\007[\275\005#\022=\327 .\275Q\000;\275\310\343\213\275y\372\336<\262\007\211\275\315\327\014=\3304\225\27507y=hZ\n\275r\202\231\275\tB.=\037\225\016=\3113\234\274\331\221\002\275\321:m\275\267U*\274\200\322\246=-v\002\273\333\205;\2754\300L\275G\306\2539\271\2653=\"0}<M\214\016=\002\357\224\2759SI\275\002\242\221<\234\201Y<\302\266\016\275&m\251:+\342v<\013e\222=\360w\237=l$\025\275s\022\250=n\305\361\274\331\316t=\307\252\344\274\355\333\237=<\225\236=\000\2474=nm\211=\325\346\337\274\324\235\240\275\0278\270<\214\203z<\231T1<a\266u=\213\343\337;\266QS<\253F)\275\004)/:\353Xl\275\243v\202=h\000\237\275\227\235\222=\177\306\276\273\305\'F=\332\351\014\2742C\245\275\356\244]=Ri\\;\332(|\274\217\364\247< \375C=\213C7\274X]\327;\307\274y\275\204N\023\275Mgo\273\247\r\241=h\217\207\274\365R\241\275:4q;\357\327v=\235\r&\274\020g\200<H\373[=\347\224G=\226\355{<\240\340\201=\027\234\032=a\000r<\270o.\275b\004\243\275\336\023\234\275\201x\257;n\n\212\275\361\336\234;7!9\272\200I\224\275\370\243\037\275\377\202\266\274\301O\241\275\343.|\2752\232\362\274\n\020\255\274\330\017`\275A \363<\376]\231=\363\177\227\275MyT\275\352\234-\275Bl\262\274\202\020\003=l!\240=D7\023\275\316\221\374;\372\013\222\275\305L\225\274\275\267\235\275rG`\273,\346\206=\210\316\017=\370y~\275h\220\241<\235).\275\275\314\202=Q\340j\275\355\032\017;\337\323\236={?%=\307\037X\272\237\3501;\255\273p\275:\006\213=\262-\304\274\201D9=\212\224\024\275f\026\320\273\345\017\317<aS\232=\323\343O=\315\335\242=\264;\215\275\372\270s<`#\206\275\252\262\236\275\214VU\275\261\236\355<@\237\265\274\354\350\305\273\371v\223\2753\205\274\274\334Y\215=)\200k\2756+\177\274\210\013?\275\230\013\314<\232\017\200=\251\261\025=\276g\221\275\357\222\362\274\341ZE\275\266\205&=\020\016J=-\253e=L\250\231;\023\364\300\274\365U\355<\361\267?=\366~\010=\355S\345\274\334\256\365<\331\033\237=:\353\215<\200q\217<\212\216\255\274\250U\347<\374\200\021=Qf\t\275\202uW=\r\\\233\275\363\226\245=b\322\211=#\3459<\202\006\223\275\234es\275|l6\275d\271\243=\214\0048=Bt~=a\326\377\274e\3222\275\316\246\n\274\225v\213=s\023j\275\334q&<\t\036\213\274\203B\034\274/\235\235\275jq\332\273)8\234\275\252iC=\264f\261<s\3142\274_\020\315<kC\214\275\277\206\216=pi~\275L7\200\275j\232$<\357>==\272q|\275\r\241\333<\326[0=!Os\275j\353\227\275\025o1<\201\232:;\261V\327\274\022\232\207\275\264\267\275<\215\035@=\3074a<\254\377*<\263L\332\274\024\007\013=8\037\004<)s\250=\362t\244\275n\330)\275\016!\207=\242\021*=\326\235U<\217L\257<\325\365\213=`\253c\274\350\213\316<\t\3238=X\224\352\274tp\021<\253\330\237=E\227\007\275\177\227\360<\206\206}<-\263\227=\240r\363<\323g@=\003\211N<t\225L\275uQ\233\275\\\"\031=\262;\t=\205\336\305\273\363>\322;4q\214\275`Pr=se\201<Z\215Q\275h7O<,\352\010;\207\206*;7\231\353\274\202\030\205=\266\354n=\032\010\205=\t\367\206<P\266\r\275?;*\275\t\330\351\274\'%H\275\320\004\240\275P\353\231\275 \251\243\275ZS\";~zW<B\353\243=\326T\223=\267\013W=J\362\231\275[\034\212\275\214)4=\356\212\t=\302\376\225=\275\250\211\275\357\207%\275\263qH\275\016\224\205<K\214\360;P\357\346\274\360v\245:\250^Y\275\252n\023==\371\275\2744\n\035\275d\257\207\275r=\034\275y\257\202\2741\323T=\344v\244\275v\244`<\376\324\324:6\250\315\272\221\212\006\275\217\330k<\032;\214;`\302\276;{L\020\274\375\354\336<\344G<\275\222\354\226=\240CE\275$\220\245\275\"\200\240=\261\306\253<\201\203\345\274p\rs\274t\242\230=\345dB\274\\\030Y<\022\004\217<-\000\210\275BK8=\227\361\220\275\354\313\230\275\226\005\350\272\367\201\007\275\365\006\231=\002\324&=\222\247L\275i\214\235\275\266v\314\274E\376\222\275\354K\233\275Z\204\252\274\010\301\024<\266\365\226\274\021\307\207\275\321=\211\275\303x7\275\330\254\240\275z8\336\273\323\247\250=\275x\246<\262\325\331<\033P\362<\322o\316;\2043*=\335@5=\236N\225<\255\221g\274\001\227\271<\341;\242\275\301\317\212\275\352\223O=\223U\177\275\342\355O=V\326q\275\262\326\200\275f\201<=\375z\234\275\353\317\303<[\373\237:\244\271i\274\016Go\275i\206v=M8\204<,\215\322\274R\230\224=\324]\343\274?@\335<\277\205E<\017E%\275O\346+\275pKp=\334a?\275\247\014\264;\001\251\014={\260\013\274\261\300\331<\177\267\205\275\336T\023=:p@\275\301\367\026=\305\334K\275\020-D\275\332\205\226\275\326\016\207\275\013^\240\274\361\t\023=LR\353\274\304\341\030<\272/y\272y\330\314<\2201<<\023\2045<\306\371X=\372\0108\275\026\373\235=\3607\214=\020;\022=\036\222}=\311\314\203\274,m\313;\313\226g\275\242\023\363\274\360\030\361<\352(\"\275n\225\227=\234\276u\274\203\332\351<\236\253F<\367T==\315BQ=\373\000\323<D\237?=\034\306\244\274\267\007m\275\rT7=tH\203;\337\301K<L\234\354<)\266\357;)\262\244\275\037p\227<[3\032\275/\362\241\275\271\221\017\275\t\335\207\275\224\205\\=%\326\003\275\342\215\322:\273=\234\275\221\375T=C\0006=\254\3145\274%\201H=\320\356%=\n\033\216=4Ek\275\242\243q=\350\276\035\275s\321\237\275\000\036\251\275\375>H\275\267\030\177=SQ\300<\372\202 =\312\036\"=\360\373Z\275\224>\224=\370\257k\275\224%\242\275\360(\235\275F\203I\275\304\n\233=zE0\275HZ\030\275\232\237\351<w\327\222=\005\231\244\275\244,5<n\352\204=\266{S\275A\260?\274\335-#\275\207 \231\275\002\253\246=h\321\036=g\217\205\275\344\264L=wC\221\275\032\370\230\274\240 #\273\177]1\275\340`}\274\024\350\202\274\301\301\201\275\253/\304<(L\224\275\033\347f\273\025\243\030\275\002_\325:\257{\353<\310\245H=\r\330\241\275\021\"\304<s3\242\275\263\270#\275;)R=[\322w=\371o\222=\302X2=zP\234=\355\376t=\337\216$=\323\343\221=\222w9\275\354:-=}H\211\275\006\304\234=\222\235\237=D~\220=\0052\203=H[\212\274\026\357-=\207?\265<\022\352\021\275\000\356\037\2747\004G\274\016]\242\275\272\376\357<*\366\351\274\001\356]=#$.=\363!n\274\001_\270\274R8\235=p7e<+L\031=?\263Y=\356\322$\275^\367\222\275\215\267\004\274V\215p\274\324Jk\275\353]\024=,LT\275\3042)=E\273\241\275\345X\240=\301\225\226=D\236\355<\211\026\006=\214i+\274 \262\230=\315\235\213\275\307\330\t\275\364\333\205\275\tt\207=\323\311^\275n\251\213=I\037\221\275_\343]=\2415\013\275\317Y\236=J!\226\275= \017\275A#h<\262\322\275\273\313\236\021\275\215\353B\275V\032`\275\302&\250=y\227\376<d\017\213\275\254\"\212\275\341\031-\275O5\240\275\206\237\016=\311\244\375<\3701\240\275b~.\275lD\022\274\210[\223;\355\037\212\274\375\212\246\275\2706l=TJ\242\275p\367\366\274\245H/\274c\206g=\037TX<\311\0067\275h\253\246<\331\027T\275\325\201\353\273:\003(\275\361\253\205=\034\027\t=Q\001\034=&:\331\274#_\264\274[\"\250=+\\\363<\343\307y\275\265W\035=|{\035\275\346e\r=o\270\307<\2721\000;\230\n\227;\"\361b<\334\220\363\274\"\376\230=+\177M\275\271\222\215<\243\026\001=\267\2167\275\207\367\226\274sBa\275#\311\237=s\341\223\274 \260r=\014\245\314\274\376s\002<H\2510=P\206\260<\254*\204\275\2512\230=A\032W<\306\007d<#\356\\=\327\233\211<\222\250\253\274\246\307\205\275\346\001\000=\320\021*<\010N\247\274\236\006L=g=G=\250d\034=T\375j\275e\340\261<d\2715=\261\327U=\271Y#\274\004\326\033\275/\263s\275\211y\244\273\003\353\230\275\301\023\223=k\314\267<\371b;=C\337C\275q\243\"\275\316\000\345</\306\233=4S\236\275b;\224\275\256}\365<!_\301;:Y\022\275\305*\307\274Y&\250\274A\216x=-W?=/\313[\275\266\322\217\274a\2168\274\233-\t;\261\n\215=\376%\004\275h\232\242\275Z\304\347<\373\366\217=R\226\251=\000?0\2734\236\222<\317\343\200\275\365E\351\274\002\237\223=\001\001\201=\361b\213\275p\347\221\275\361\202\010\275\307\021\"=i\036\370<\253?\220<\357\205\230;\033\0142=\013\371\205=LYa=\210x\235\274\2441\213=W\270\206=3\000p\274(\323P\275\351\237\225=\236\\\027\274\226\230|=;\362\224\275%\315\t<;\'\221\273\314z\226\275t\322\363\274\323\007\207\275DuW<\253\317\314<U\340_=\232\3656=\312\265\004\275*\002\236=K\237@\275\272,|=9\241\207\275\245\306\340\273\221\341\022=U\231f=\211\320\217=Y\027\247\275\273\353\241\275\023\371u\275\007nj\275\201\347>\275Y\354\256<\202\302\274\272\037\361L=\336PA=`2M=Z\331\251=-\007\254<DM\036\275\2009\241=O\232:<\252\202\231\2750<B=^\337r=_\027a=+\264\200\275Ltq\275=\000\221=(m\017\275\2249\350\273\025\232\r=\027\240\202\274\376\305\224=8\243\214<\234\210&=o\200\377\274$k\364\274\325B\205=n\366\006\275\350\014>\275\247\312 =\377\343\340<Y\350\327<\237\355e<\350[.\275\260\001\376;\255j\266<\375\321\225\275Gp\202<\331\244\034\274\'n\025<?\361\032=\275\242\310<\337G\311<\317\235-<\n\241\236\272\326\232\217\275\225B\343\274\270\351a\2758_\231\275W\226\207=\336c0\275@\311\263\274\214\333\235\275+ED\275\036\325.=%\374\247< \010\265<\227\010\232=(9\242\274\2153o<\210-y<\332G\316;^\200\324;\300^\025\275\253\023\000=}\234+=\014\255\023=\274d^=\004$\212\275\237\366\202\275\227<\356\274#t\351\274\005\333d=m\323\240\275\035\322\013\274Gz\210\275TV\'\274\345\361\366<\364m\376\274\336&\233\275\223\025\025=\202\210\245=\215\325\202=\342\246\251\275\326\026\271<\023\335\377\274\250t\035=\342\342\224\275G\201=\273\366\223/\275\0069\212\275@b\023=\223\244\225<6\213%=dG(=0i\204\275\303\206\266<\033\200\223\275\242\033\327\274\255\261\272<\377\366&\275\277\2107\275\330\316k=^v*=G\255{\275\033\324\310\274\313\222l\273+\304\037\275SL\\=\224\307\036\275\312\306\217\275\236\003)=\264*n=\205\271.\275\005V\240\275\221(\235\275\352\266\225=\347\325\370\273j\355J=\255\326\203=:\231\230\275\025\027\021=\325\233}=j\320\010\274`F\261<\346\2607=\256\231f\275gC\242\273\340\333\206;\373J\300<\014\247\004=\216\235w\275u\315\260;\352\321f\275\376\274\030\273E\0274\2752Q$=F}l\275^\243\r\2724\2017<V\276o\274\365Ij=2}f\275u\213\261\274\372\320\n=v,\202\275\342\237?\274\025Z*\274\230Z==[F$<\305J\237\275\034\217\003\275\377\360\r\275\266\217S<Y\242\034=p+\035<\347\226\245=\373p\371;\016o\345\274p\370\315\274z\376U\275HB\241=I\207\\\275\204*\002=\035V\251\274\211\330\016=G\243\017\274\205\230\212\275\367-\021\275\235h\326<y\314\232\275O:\203\275\261\236\201=\352\352\247\275\231\032\202\275W\220\200<\364\320\231\275K\314\204=\340H\217\275\205o\221=\310\000Y\275\252\031\017=\355\303z\275\0230\005=\3521\321\274]\247\013\272\271,\215=\2667\215\275I\376/=L<\225\275\200\234\003\274_\030\026\275rFv\2754G\205\275\353\244#\275d\356\300;\305I\323\274\227\271\253\274\353\357O\275\007Sd=\3449d=\207\316<\275\374a\360<\375\005q=\322\027\201\275\333\343\231=\206/\177;\376I\027\274S\355#\274\210\244\206;@w\360;\2762\034<\000yM=l\316^\274\372LX=\325\3477\2756B\222\273\225?\247=HX\201\275\222\001\032\275U\210a\275\024\005y\274\216\210\277\273^\033I\2750\240\226=!\302@\275\007\322\212\2755U\346<T\273\235=<\333`\275\377K\017=\200\322\036\274\344\232\375\274-\314\212=\\\032\204=\022\246\236\275\216\255\002<\0147\245\273O\203 \274\266wV<^f\006\275\374\340)\275i\342%\275\301tp<\316\226&=\000\002\227\275E\312\235\275\304#\222=<fT=\377\365F=\250\276R=m\006f=\022J\006\275T\216\225=\224\330\251\273\025\342$\275.\021}=z3M;\316\024X\275u<\277<\004zN=E\021d\275{\201\342\270\331EB=[\026n<\332\335\003\275\200\335\212\274;\004\022=31\247=\230\227\264\274\217\246,=\205\224\233\2737\262\352<\036\007\031=\014\230\311<\335\302\353\274#\373(\275\n\331{\275\3258\245\274\242\014\224\275\302\0225=/\326\235=Q\242\224<V\236\214\274$\262d=_\365@=B\001\247=P?\316<\266v\235\275\362`\315<>\\7=!\220\307\274\200\325\207\275\343\200Q<\307\225\020<\272G3=\353\230R\275_\362\232==e\252\275\352\352\231\275!%\351\274|\273\263\273\225\035\216=\200v\022=\272\032\323<M\277\216\275\206\270\236\275jA}=\323X\227<\345}\255;j\024A=\3650\230=>\ty\275\273\002\224\275h1\206\275\'J\205=\375\247\221\275\323\340\035\2750\353\301\273\225\264\220;\376\263[=\303^3=\302Y\312\274\305\275t\274J@\257\273.o<<\3120\342\273\362\014\033\275\223&\205\275\301\\x\274\356\305G=e%A=J\267Z\274\017\366\250=\203\241A;\244\322\230=r\307\374<\304\006\211\274\201\266\316;\325\376\313<\315\203\353\2742\315Q=\001p6=\316\250\377<\342\233\023<\017\256\246=\372hx\275\304R\371<\t\245U\275*U\216\275\304\334\242\275Z\224\307<\346\0216=\375/\220\275M\344u\274\335\023\227\274\273\233#\275=\213\322\274p6v\275\025J\200=\362\005\004=\364\007\017\274\336\211_=\"h\354<?\276\317<\320\342\225\275\336\257<=W\226\245=\332\272t<\036\234\211<\360f\304:\312\027\020\275\257\246\224=Z\375B\275\204\262\246=\321\021\214\275\317\201\223<\313n\223=\371\224y=\022\333+=J\326\247=\371t\214\275oo\214\275\233\006\305\274\322\262\277:\272\377t=\233\370R=\\\303.=Zku\275\020n\035\275\375\264\007\274\366\221\216;\021+\235<uI\321\272\205\'o\275\215\254\363\274\242\221\317<\220\233D\275y#\324<\370\250T=x\373\242=\376G\232\275\005F\241=\001!\236=\242\230\r\275\000\352<=\003$\227\275j\334N=\255\300>\275\314Dn=ot\211=\003$\376\272\037y\016\274\025\234^\274:\373b\275?.E=\026\201U;T\234\220;\223\177\347<IN&=u\211?\275b\000\243\275\342]&;\225z\'=\372C\376\274\207\311e=\022\307\220=V\226\223;\257X]=\240\000\010\275\007\0041\275\"\213\013;$\037\211\275HA\306;\252\271\352<\307B\340:\034\355\317\274\007B:=\350\244\320<\273_J=\311Z*=6\262\242;w\221\204=\256\333S=\n\"\205=w\025\250\275\334Ga=\323K\310<\003*\233=3\267\203=G\312\365<\336\333G\275\320X\002\275by\014=\311\220\231\275\354\307\231=\016lU\275#H\356<T0\233<\252\236\027=\352\307\206=\277\2773\275\373f\236==\360{\275\374\311\200=\010\352\217=$H2\275BO*=g \326\274\205\213\363<\nFH\275\177\222\'\275\030ez=Y\"U=u\357\023<\224\023\227\2752k\251\275\276\204\373;%0x\275\025r\236<\250\255&;:\365t\273\3661\233=\027\367\221=5\260\025\275\267\224K<\017\001\244\275GF\230\275\215\2313\275\373\263\027\275Y~/\275\230L\217\275\266\216\247\275\365$\026\275vu\270<\331\335\212=\362\3144<fY\263\274\031\323/\274\020I\327\273\314&\177=\036S\r\275\303\000T=9F\222;$\317\362;\202\301b=p\352\351\274\323\3131\273\317\245\264<^-\371<~}\247\275T\004*=\221\332\314<\217\223*=\tew=\3314\251\275\242\213\215=W<2\275\215\237\245\2753\302+\275=-\340\274t\221\023=\325\317\365<\"\242\001=H\307\013=%\010\033\272Y\260M\275\200\030E=\3736\004=EcF=F\362\207<\312P\243=\344\265\271<O1\211\275\017\353\013\275\004\304\357\272\306e\241=\377\223C\275\263K\213=f\214S\275\007%<=\217/0=\234\254\230<\261-\206=/\327W\275\265q.\275{\321\337<7\212\260\274o\373\204\275H\317B\275qf\275<T\212\230=6s\n=H\337\272;\254#\243\275\320s\232\274\241Wk\275\345\310\230\271\321\351\006=\252\353\035\275\027`\301<\363\0039\275M\304\343\274\304\260\247\275\343\013A\275\"\365{\275\277\017\204<_K1=>\024X\274\254TF\275\036\340\316\274\321\352\332\273\334\355k\275\3406N<\017\322E=\357\254m=\022^\323\274\256\020?=\257u~=\004\264\234\275\317\031I=\200CF\273\016\"\314<\032-B;i\005\211<\2504\235\275\311Q\313\274\340\n\007=\224 ;\274\322\336=\275d\3119\275\223\232\251=\314\226==\341G\267\274K\\Q<\371\250\234\275\000\3432<\361K\371<\3264t\274\224\266d\275\327\211\221\275B\246y=\007\023A<|\">=Z>`\275V\237\374\274\035\212\240<\372\036\362\2747\337`=\250ia<i\375\241\275,Hm\275Z3\205=3\257\362;\201K,=\237\242\234\273\203\372\240\274\212\242\000=4c\254<\036Tu=]\253\037\275\255\237\346<\n\314~=\307\235\202<8l\237=\207\241]=\255\212\000<\206D\"\275\232\223?=V\305\214=\275\0372=_\302\223\275O\322\224\275T\232\201=\271{\014=80\030\2750\030i\274\014\3173;\345\220.\275\344\341|=\034SU;\377{M\275\310\265\242<\377\004\271<A\212Y;\214\324\027=}\364\212=\322/\345\274\320\nQ=\323\267\235\274*\374*\275K9k\275\372~\203\275\276xn=:t\216=K\364\236=Z\247 =\370N2=\'\3262\275\250\030\261<e\237\016=\353N\304\267\034\364\203=\354\375Z\275\352\341\274<^E\003\274\236+\211<\372\251`=\212\362\027<\234\023G=>\222\200\275\031#\213=dm\300<\361\352Y\275N[.=\270\2547=\357?\276\274ztI\275\336\014\225\275\352_\371\273U\n\265\274K\026S<\327\350\206=D\325\243=\370e\'\275\325\013\241\275gCh\275\243\202\344<\0065?\2747\201\212=8\337\376\274\204o3\275/\"\362\272e\352\317<\276\261P\275\226z\031=\364J\263\274<\270@\275e\032\234=\023\366\334<5Z3=B\260\203<\253\316J=#<\305<\221{\334<T\002\231\275\313\252C\275`\002\203=\204\242\211=\032\350\217=\206\270\021\274ekS=z\367\256;\314n\302;\370\354\274<\226m\244\275C\273g=b\254z\274h\2659=\213g\232=6\'*=0&j\275\342\227\306;\252\264\004=\327\300?=*\353(\275\301\371\021<\261\216M=\363\013\024<r\235\333<u\n\212=M\314\262\274h\203\212\275:x\216=\004\246,\275\253m\230\275\250\235\021\275UI_\274\230\325,=s\311s<]lA\275]\374Z\275v6\002\275A\304\r=Z\360\375:gR\246\271\300\3750\275\252+\357;>\026\335\273\r\245%\275\371%[\275=\020&\275\254\276}\275\203;\235\275\337\020\245=;\340V\275*Oj=:\237I<\245\006\350\273=H\340\274\370VY\275~{W\275\021\t\337<A\243\006=S>4\275\020\370y=\027\271\240\275\007\265h\275<?\242:RL\213\273{\203\242\274\247\336\035\275\337\364\236\275\027\262\342\273\275\256\231=5\306\373:\212\242\235;^\231\372;,\302p\275\024\377A=\326\256\023\275\327F\020:\223wa=\3707/\274\346qZ\275?V\217=\202\351\021\274Z\r\214=\375\000\355\274\017\317\311<\262FA\275uDw<3\263\214\275\"S\250\275\377\014f=\263\246j=6\344\254\274\345\216\217=\370\006:\275\371\037\022\275\324\260\243\275\214m\000=\025\rL\275\nG\223\275a`\232\275\310\344 <\236O\210\2752\005\251\2753\214\301\274\226U\206\274\030!\227\274#\220\374<\366l\252\275\365K\362\274\023\313\016\275\001\316L\275\334\301\031\275\321\3643\275\357\"\251\274\211E\373\274GF\302\274\232\002\200\275\312)m=\354\261\217\274J\266\242<E\024P<\332\216z\275\262\037\205\275\200B\325:\242\014\027=\221\210\227<eA =\021o(\275D\364:;\2276-=\353d\225=\227\035\003\275\036\002@=\221\331m=x\216\307\274\021\271\232=\2530(=s\365\364\274\307\241\220=j\352\030=d\343\236\275\376R\264;Q\020\305\274V\256\020\275\321\005\247==\342,=\326Zl\275"
  }
}
