ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "2"
    input: "0"
    output: "25"
    op_type: "Gather"
  }
  node {
    input: "25"
    output: "26"
    output: "27"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "5"
    input: "6"
    output: "29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "30"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "26"
    input: "3"
    input: "4"
    input: "29"
    input: ""
    input: "30"
    output: "31"
    output: "32"
    op_type: "RNN"
    attribute {
      name: "activations"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "9"
    input: "10"
    output: "33"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "34"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "31"
    input: "7"
    input: "8"
    input: "33"
    input: ""
    input: "34"
    output: "35"
    output: "36"
    op_type: "RNN"
    attribute {
      name: "activations"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "13"
    input: "14"
    output: "37"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "38"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 3
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "35"
    input: "11"
    input: "12"
    input: "37"
    input: ""
    input: "38"
    output: "39"
    output: "40"
    op_type: "RNN"
    attribute {
      name: "activations"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "17"
    input: "18"
    output: "41"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "42"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 4
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "39"
    input: "15"
    input: "16"
    input: "41"
    input: ""
    input: "42"
    output: "43"
    output: "44"
    op_type: "RNN"
    attribute {
      name: "activations"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "21"
    input: "22"
    output: "45"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "46"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "43"
    input: "19"
    input: "20"
    input: "45"
    input: ""
    input: "46"
    output: "47"
    output: "48"
    op_type: "RNN"
    attribute {
      name: "activations"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "47"
    output: "49"
    output: "50"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    output: "51"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: INT64
        raw_data: "2\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "49"
    input: "51"
    output: "52"
    op_type: "Reshape"
  }
  node {
    input: "52"
    input: "23"
    input: "24"
    output: "53"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    output: "54"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: INT64
        raw_data: "\n\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "53"
    input: "54"
    output: "55"
    op_type: "Reshape"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "21"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "22"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "23"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "24"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "55"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 6
}
