node {
  input: "17"
  input: "1"
  input: "2"
  output: "19"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 11
    ints: 11
  }
  attribute {
    name: "strides"
    ints: 4
    ints: 4
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "19"
  output: "21"
  op_type: "Relu"
}
node {
  input: "21"
  output: "23"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "23"
  input: "3"
  input: "4"
  output: "26"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 5
    ints: 5
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 2
    ints: 2
    ints: 2
    ints: 2
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "26"
  output: "28"
  op_type: "Relu"
}
node {
  input: "28"
  output: "30"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "30"
  input: "5"
  input: "6"
  output: "33"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "33"
  output: "35"
  op_type: "Relu"
}
node {
  input: "35"
  input: "7"
  input: "8"
  output: "37"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "37"
  output: "39"
  op_type: "Relu"
}
node {
  input: "39"
  input: "9"
  input: "10"
  output: "41"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "41"
  output: "43"
  op_type: "Relu"
}
node {
  input: "43"
  output: "45"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 3
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "45"
  output: "48"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: 9216
  }
}
node {
  input: "48"
  output: "50"
  output: "tmp1"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "11"
  output: "52"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "50"
  input: "52"
  input: "12"
  output: "54"
  op_type: "FC"
}
node {
  input: "54"
  output: "56"
  op_type: "Relu"
}
node {
  input: "56"
  output: "58"
  output: "tmp2"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "13"
  output: "60"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "58"
  input: "60"
  input: "14"
  output: "62"
  op_type: "FC"
}
node {
  input: "62"
  output: "64"
  op_type: "Relu"
}
node {
  input: "15"
  output: "66"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "64"
  input: "66"
  input: "16"
  output: "68"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
output: "68"
