node {
  input: "1"
  input: "2"
  output: "4"
  op_type: "Add"
}
node {
  input: "1"
  input: "4"
  output: "6"
  op_type: "Mul"
}
node {
  input: "6"
  output: "8"
  op_type: "TanH"
}
node {
  input: "8"
  output: "10"
  op_type: "Sigmoid"
}
node {
  input: "10"
  output: "12"
  op_type: "Scale"
  attribute {
    name: "scale"
    f: -1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
output: "12"
