node {
  name: "input/x"
  op: "IO Node"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: ""
    }
  }
}
node {
  name: "output/output.1"
  op: "IO Node"
  input: "myLinear/Linear[l]/18"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: ""
    }
  }
}
node {
  name: "myLinear/Linear[l]/bias/bias"
  op: "prim::GetAttr"
  input: "myLinear/Linear[l]/weight/l"
  attr {
    key: "attr"
    value {
      s: "{ name :  bias }"
    }
  }
}
node {
  name: "myLinear/Linear[l]/weight/weight"
  op: "prim::GetAttr"
  input: "myLinear/Linear[l]/weight/l"
  attr {
    key: "attr"
    value {
      s: "{ name :  weight }"
    }
  }
}
node {
  name: "myLinear/Linear[l]/18"
  op: "aten::linear"
  input: "input/x"
  input: "myLinear/Linear[l]/weight/weight"
  input: "myLinear/Linear[l]/bias/bias"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 5
          }
        }
      }
    }
  }
  attr {
    key: "attr"
    value {
      s: "{}"
    }
  }
}
versions {
  producer: 22
}