ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "3"
    input: "0"
    output: "26"
    op_type: "Gather"
  }
  node {
    input: "26"
    output: "27"
    output: "28"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "4"
    output: "30"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "4"
    output: "31"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "4"
    output: "32"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "30"
    input: "31"
    input: "32"
    output: "33"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "5"
    output: "34"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "5"
    output: "35"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "5"
    output: "36"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "34"
    input: "35"
    input: "36"
    output: "37"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "6"
    output: "38"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "6"
    output: "39"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "6"
    output: "40"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "38"
    input: "39"
    input: "40"
    output: "41"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "7"
    output: "42"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "7"
    output: "43"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "7"
    output: "44"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "42"
    input: "43"
    input: "44"
    output: "45"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "41"
    input: "45"
    output: "46"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "47"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "2"
    output: "48"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "27"
    input: "33"
    input: "37"
    input: "46"
    input: ""
    input: "47"
    input: "48"
    output: "49"
    output: "50"
    output: "51"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "8"
    output: "52"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "8"
    output: "53"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "8"
    output: "54"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "52"
    input: "53"
    input: "54"
    output: "55"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "9"
    output: "56"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "9"
    output: "57"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "9"
    output: "58"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "56"
    input: "57"
    input: "58"
    output: "59"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "10"
    output: "60"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "10"
    output: "61"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "10"
    output: "62"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "60"
    input: "61"
    input: "62"
    output: "63"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "11"
    output: "64"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "11"
    output: "65"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "11"
    output: "66"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "64"
    input: "65"
    input: "66"
    output: "67"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "63"
    input: "67"
    output: "68"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "69"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "2"
    output: "70"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "49"
    input: "55"
    input: "59"
    input: "68"
    input: ""
    input: "69"
    input: "70"
    output: "71"
    output: "72"
    output: "73"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "12"
    output: "74"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "12"
    output: "75"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "12"
    output: "76"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "74"
    input: "75"
    input: "76"
    output: "77"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "13"
    output: "78"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "13"
    output: "79"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "13"
    output: "80"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "78"
    input: "79"
    input: "80"
    output: "81"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "14"
    output: "82"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "14"
    output: "83"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "14"
    output: "84"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "82"
    input: "83"
    input: "84"
    output: "85"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "15"
    output: "86"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "15"
    output: "87"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "15"
    output: "88"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "86"
    input: "87"
    input: "88"
    output: "89"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "85"
    input: "89"
    output: "90"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "91"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 3
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "2"
    output: "92"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 3
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "71"
    input: "77"
    input: "81"
    input: "90"
    input: ""
    input: "91"
    input: "92"
    output: "93"
    output: "94"
    output: "95"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "16"
    output: "96"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "16"
    output: "97"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "16"
    output: "98"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "96"
    input: "97"
    input: "98"
    output: "99"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "17"
    output: "100"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "17"
    output: "101"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "17"
    output: "102"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "100"
    input: "101"
    input: "102"
    output: "103"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "18"
    output: "104"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "18"
    output: "105"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "18"
    output: "106"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "104"
    input: "105"
    input: "106"
    output: "107"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "19"
    output: "108"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "19"
    output: "109"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "19"
    output: "110"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "108"
    input: "109"
    input: "110"
    output: "111"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "107"
    input: "111"
    output: "112"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "113"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 4
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "2"
    output: "114"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 4
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 3
      type: INTS
    }
  }
  node {
    input: "93"
    input: "99"
    input: "103"
    input: "112"
    input: ""
    input: "113"
    input: "114"
    output: "115"
    output: "116"
    output: "117"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "20"
    output: "118"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "20"
    output: "119"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "20"
    output: "120"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "118"
    input: "119"
    input: "120"
    output: "121"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "21"
    output: "122"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "21"
    output: "123"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "21"
    output: "124"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "122"
    input: "123"
    input: "124"
    output: "125"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "22"
    output: "126"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "22"
    output: "127"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "22"
    output: "128"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "126"
    input: "127"
    input: "128"
    output: "129"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "23"
    output: "130"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "23"
    output: "131"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 15
      type: INTS
    }
  }
  node {
    input: "23"
    output: "132"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 15
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 5
      type: INTS
    }
  }
  node {
    input: "130"
    input: "131"
    input: "132"
    output: "133"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "129"
    input: "133"
    output: "134"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    output: "135"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "2"
    output: "136"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 5
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 4
      type: INTS
    }
  }
  node {
    input: "115"
    input: "121"
    input: "125"
    input: "134"
    input: ""
    input: "135"
    input: "136"
    output: "137"
    output: "138"
    output: "139"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  node {
    input: "137"
    output: "140"
    output: "141"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    output: "142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: INT64
        raw_data: "2\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "140"
    input: "142"
    output: "143"
    op_type: "Reshape"
  }
  node {
    input: "143"
    input: "24"
    input: "25"
    output: "144"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    output: "145"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: INT64
        raw_data: "\n\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "144"
    input: "145"
    output: "146"
    op_type: "Reshape"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "21"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "22"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "23"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
        }
      }
    }
  }
  input {
    name: "24"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "25"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "146"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 6
}
