node {
  input: "1"
  input: "2"
  output: "3"
  op_type: "Mul"
}
node {
  input: "3"
  input: "1"
  output: "4"
  op_type: "Add"
}
name: "torch-jit-export"
input: "1"
input: "2"
output: "4"
initializer {
  dims: 2
  dims: 2
  data_type: INT64
  name: "1"
  raw_data: "\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000"
}
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
