ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "7"
    output: "8"
    output: "9"
    output: "batch_norm_dead_output_10"
    output: "batch_norm_dead_output_11"
    op_type: "SpatialBN"
    attribute {
      name: "is_test"
      i: 0
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
    }
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    data_type: DOUBLE
    name: "2"
    raw_data: "\000\000\000\356w\t\315?\000\000@\214\272\033\346?"
  }
  initializer {
    dims: 2
    data_type: DOUBLE
    name: "3"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: DOUBLE
    name: "4"
    raw_data: "\232\231\231\231\231\231\271?\232\231\231\231\231\231\271?"
  }
  initializer {
    dims: 2
    data_type: DOUBLE
    name: "5"
    raw_data: "\315\314\314\314\314\314\354?\315\314\314\314\314\314\354?"
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "7"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
