ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    output: "53"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "53"
    output: "54"
    op_type: "Relu"
  }
  node {
    input: "54"
    output: "55"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "55"
    input: "3"
    input: "4"
    output: "56"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "56"
    output: "57"
    op_type: "Relu"
  }
  node {
    input: "57"
    input: "5"
    input: "6"
    output: "58"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "58"
    output: "59"
    op_type: "Relu"
  }
  node {
    input: "57"
    input: "7"
    input: "8"
    output: "60"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "60"
    output: "61"
    op_type: "Relu"
  }
  node {
    input: "59"
    input: "61"
    output: "62"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "62"
    input: "9"
    input: "10"
    output: "63"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "63"
    output: "64"
    op_type: "Relu"
  }
  node {
    input: "64"
    input: "11"
    input: "12"
    output: "65"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "65"
    output: "66"
    op_type: "Relu"
  }
  node {
    input: "64"
    input: "13"
    input: "14"
    output: "67"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "67"
    output: "68"
    op_type: "Relu"
  }
  node {
    input: "66"
    input: "68"
    output: "69"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "69"
    output: "70"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "70"
    input: "15"
    input: "16"
    output: "71"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "71"
    output: "72"
    op_type: "Relu"
  }
  node {
    input: "72"
    input: "17"
    input: "18"
    output: "73"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "73"
    output: "74"
    op_type: "Relu"
  }
  node {
    input: "72"
    input: "19"
    input: "20"
    output: "75"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "75"
    output: "76"
    op_type: "Relu"
  }
  node {
    input: "74"
    input: "76"
    output: "77"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "77"
    input: "21"
    input: "22"
    output: "78"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "78"
    output: "79"
    op_type: "Relu"
  }
  node {
    input: "79"
    input: "23"
    input: "24"
    output: "80"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "80"
    output: "81"
    op_type: "Relu"
  }
  node {
    input: "79"
    input: "25"
    input: "26"
    output: "82"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "82"
    output: "83"
    op_type: "Relu"
  }
  node {
    input: "81"
    input: "83"
    output: "84"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "84"
    output: "85"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "85"
    input: "27"
    input: "28"
    output: "86"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "86"
    output: "87"
    op_type: "Relu"
  }
  node {
    input: "87"
    input: "29"
    input: "30"
    output: "88"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "88"
    output: "89"
    op_type: "Relu"
  }
  node {
    input: "87"
    input: "31"
    input: "32"
    output: "90"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "90"
    output: "91"
    op_type: "Relu"
  }
  node {
    input: "89"
    input: "91"
    output: "92"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "92"
    input: "33"
    input: "34"
    output: "93"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "93"
    output: "94"
    op_type: "Relu"
  }
  node {
    input: "94"
    input: "35"
    input: "36"
    output: "95"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "95"
    output: "96"
    op_type: "Relu"
  }
  node {
    input: "94"
    input: "37"
    input: "38"
    output: "97"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "97"
    output: "98"
    op_type: "Relu"
  }
  node {
    input: "96"
    input: "98"
    output: "99"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "99"
    input: "39"
    input: "40"
    output: "100"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "100"
    output: "101"
    op_type: "Relu"
  }
  node {
    input: "101"
    input: "41"
    input: "42"
    output: "102"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "102"
    output: "103"
    op_type: "Relu"
  }
  node {
    input: "101"
    input: "43"
    input: "44"
    output: "104"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "104"
    output: "105"
    op_type: "Relu"
  }
  node {
    input: "103"
    input: "105"
    output: "106"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "106"
    input: "45"
    input: "46"
    output: "107"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "107"
    output: "108"
    op_type: "Relu"
  }
  node {
    input: "108"
    input: "47"
    input: "48"
    output: "109"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "109"
    output: "110"
    op_type: "Relu"
  }
  node {
    input: "108"
    input: "49"
    input: "50"
    output: "111"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "111"
    output: "112"
    op_type: "Relu"
  }
  node {
    input: "110"
    input: "112"
    output: "113"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "113"
    output: "114"
    output: "115"
    op_type: "Dropout"
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "ratio"
      f: 0.5
      type: FLOAT
    }
  }
  node {
    input: "114"
    input: "51"
    input: "52"
    output: "116"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "116"
    output: "117"
    op_type: "Relu"
  }
  node {
    input: "117"
    output: "118"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 13
      ints: 13
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 13
      ints: 13
      type: INTS
    }
  }
  node {
    input: "118"
    output: "119"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "21"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "22"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  input {
    name: "23"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "24"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "25"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "26"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "27"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "28"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 48
          }
        }
      }
    }
  }
  input {
    name: "29"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "30"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
        }
      }
    }
  }
  input {
    name: "31"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "32"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
        }
      }
    }
  }
  input {
    name: "33"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 384
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "34"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 48
          }
        }
      }
    }
  }
  input {
    name: "35"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "36"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
        }
      }
    }
  }
  input {
    name: "37"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "38"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 192
          }
        }
      }
    }
  }
  input {
    name: "39"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 384
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "40"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "41"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "42"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "43"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "44"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "45"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "46"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "47"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "48"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "49"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "50"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "51"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "52"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  output {
    name: "119"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
}
opset_import {
  version: 6
}
