node {
  input: "1"
  output: "2"
  op_type: "MaxPool"
  attribute {
    name: "kernels"
    ints: 3
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
  }
  attribute {
    name: "dilations"
    ints: 1
  }
  attribute {
    name: "strides"
    ints: 2
  }
}
name: "torch-jit-export"
input: "1"
output: "2"
