node {
  input: "33"
  input: "1"
  input: "2"
  output: "35"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "35"
  output: "37"
  op_type: "Relu"
}
node {
  input: "37"
  input: "3"
  input: "4"
  output: "39"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "39"
  output: "41"
  op_type: "Relu"
}
node {
  input: "41"
  output: "43"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "43"
  input: "5"
  input: "6"
  output: "46"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "46"
  output: "48"
  op_type: "Relu"
}
node {
  input: "48"
  input: "7"
  input: "8"
  output: "50"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "50"
  output: "52"
  op_type: "Relu"
}
node {
  input: "52"
  output: "54"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "54"
  input: "9"
  input: "10"
  output: "57"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "57"
  output: "59"
  op_type: "Relu"
}
node {
  input: "59"
  input: "11"
  input: "12"
  output: "61"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "61"
  output: "63"
  op_type: "Relu"
}
node {
  input: "63"
  input: "13"
  input: "14"
  output: "65"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "65"
  output: "67"
  op_type: "Relu"
}
node {
  input: "67"
  output: "69"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "69"
  input: "15"
  input: "16"
  output: "72"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "72"
  output: "74"
  op_type: "Relu"
}
node {
  input: "74"
  input: "17"
  input: "18"
  output: "76"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "76"
  output: "78"
  op_type: "Relu"
}
node {
  input: "78"
  input: "19"
  input: "20"
  output: "80"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "80"
  output: "82"
  op_type: "Relu"
}
node {
  input: "82"
  output: "84"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "84"
  input: "21"
  input: "22"
  output: "87"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "87"
  output: "89"
  op_type: "Relu"
}
node {
  input: "89"
  input: "23"
  input: "24"
  output: "91"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "91"
  output: "93"
  op_type: "Relu"
}
node {
  input: "93"
  input: "25"
  input: "26"
  output: "95"
  op_type: "Conv"
  attribute {
    name: "kernels"
    ints: 3
    ints: 3
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
  }
  attribute {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
  }
  attribute {
    name: "group"
    i: 1
  }
}
node {
  input: "95"
  output: "97"
  op_type: "Relu"
}
node {
  input: "97"
  output: "99"
  op_type: "MaxPool"
  attribute {
    name: "kernel"
    i: 2
  }
  attribute {
    name: "stride"
    i: 2
  }
  attribute {
    name: "pad"
    i: 0
  }
  attribute {
    name: "dilation"
    i: 1
  }
}
node {
  input: "99"
  output: "102"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 10
    ints: -1
  }
}
node {
  input: "27"
  output: "104"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "102"
  input: "104"
  input: "28"
  output: "106"
  op_type: "FC"
}
node {
  input: "106"
  output: "108"
  op_type: "Relu"
}
node {
  input: "108"
  output: "110"
  output: "tmp1"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "29"
  output: "112"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "110"
  input: "112"
  input: "30"
  output: "114"
  op_type: "FC"
}
node {
  input: "114"
  output: "116"
  op_type: "Relu"
}
node {
  input: "116"
  output: "118"
  output: "tmp2"
  op_type: "Dropout"
  attribute {
    name: "ratio"
    f: 0.5
  }
  attribute {
    name: "is_test"
    i: 0
  }
}
node {
  input: "31"
  output: "120"
  op_type: "Transpose"
  attribute {
    name: "axes"
    ints: 0
    ints: 1
  }
}
node {
  input: "118"
  input: "120"
  input: "32"
  output: "122"
  op_type: "FC"
}
name: "torch-jit-export"
input: "1"
input: "2"
input: "3"
input: "4"
input: "5"
input: "6"
input: "7"
input: "8"
input: "9"
input: "10"
input: "11"
input: "12"
input: "13"
input: "14"
input: "15"
input: "16"
input: "17"
input: "18"
input: "19"
input: "20"
input: "21"
input: "22"
input: "23"
input: "24"
input: "25"
input: "26"
input: "27"
input: "28"
input: "29"
input: "30"
input: "31"
input: "32"
input: "33"
output: "122"
