ir_version: 1
producer_name: "pytorch"
producer_version: "0.2"
domain: "com.facebook"
graph {
  node {
    input: "1"
    input: "2"
    input: "3"
    output: "4"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
    attribute {
      name: "broadcast"
      i: 1
    }
  }
  node {
    input: "1"
    input: "2"
    input: "4"
    output: "5"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
    }
    attribute {
      name: "beta"
      f: 1
    }
    attribute {
      name: "broadcast"
      i: 0
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
