node {
  input: "1"
  output: "3"
  output: "tmp0"
  op_type: "Reshape"
  attribute {
    name: "shape"
    ints: 1
    ints: 1
  }
  attribute {
  }
}
name: "torch-jit-export"
input: "1"
output: "3"
