node {
  input: "x"
  input: "y"
  output: "3"
  op_type: "Add"
}
node {
  input: "x"
  input: "3"
  output: "4"
  op_type: "Mul"
}
node {
  input: "4"
  output: "5"
  op_type: "Tanh"
}
node {
  input: "5"
  output: "6"
  op_type: "Sigmoid"
}
node {
  input: "6"
  output: "z"
  op_type: "Scale"
  attribute {
    name: "scale"
    f: -1
  }
}
name: "torch-jit-export"
input: "x"
input: "y"
output: "z"
ir_version: 1
producer_version: 20000
producer_tag: "pytorch"
