node {
  input: "1"
  input: "2"
  output: "3"
  op_type: "Add"
}
node {
  input: "1"
  input: "3"
  output: "5"
  op_type: "Mul"
}
node {
  input: "5"
  output: "7"
  op_type: "Tanh"
}
node {
  input: "7"
  output: "9"
  op_type: "Sigmoid"
}
node {
  input: "9"
  output: "11"
  op_type: "Scale"
  attribute {
    name: "scale"
    f: -1
  }
}
name: "torch-jit-export"
input: "1"
input: "2"
output: "11"
initializer {
  dims: 2
  dims: 2
  data_type: FLOAT
  float_data: 1
  float_data: 2
  float_data: 3
  float_data: 4
  name: "1"
}
