ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    output: "5"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.0199999995529652
      type: FLOAT
    }
  }
  node {
    input: "5"
    input: "1"
    input: "2"
    input: "3"
    input: "4"
    output: "6"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 0.899999976158142
      type: FLOAT
    }
  }
  node {
    input: "6"
    output: "7"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: INT64
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "7"
    input: "8"
    output: "9"
    op_type: "Reshape"
  }
  node {
    input: "9"
    output: "10"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 75264
          }
        }
      }
    }
  }
}
opset_import {
  version: 6
}
