graph torch-jit-export (
  %0[FLOAT, 64x100x1x1]
  %1[FLOAT, 100x512x4x4]
  %2[FLOAT, 512]
  %3[FLOAT, 512]
  %4[FLOAT, 512]
  %5[FLOAT, 512]
  %6[FLOAT, 512x256x4x4]
  %7[FLOAT, 256]
  %8[FLOAT, 256]
  %9[FLOAT, 256]
  %10[FLOAT, 256]
  %11[FLOAT, 256x128x4x4]
  %12[FLOAT, 128]
  %13[FLOAT, 128]
  %14[FLOAT, 128]
  %15[FLOAT, 128]
  %16[FLOAT, 128x64x4x4]
  %17[FLOAT, 64]
  %18[FLOAT, 64]
  %19[FLOAT, 64]
  %20[FLOAT, 64]
  %21[FLOAT, 64x3x4x4]
) {
  %22 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [0, 0, 0, 0], strides = [1, 1]](%0, %1)
  %23 = BatchNormalization[epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%22, %2, %3, %4, %5)
  %24 = Relu(%23)
  %25 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%24, %6)
  %26 = BatchNormalization[epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%25, %7, %8, %9, %10)
  %27 = Relu(%26)
  %28 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%27, %11)
  %29 = BatchNormalization[epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%28, %12, %13, %14, %15)
  %30 = Relu(%29)
  %31 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%30, %16)
  %32 = BatchNormalization[epsilon = 9.99999974737875e-06, is_test = 1, momentum = 0.899999976158142](%31, %17, %18, %19, %20)
  %33 = Relu(%32)
  %34 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%33, %21)
  %35 = Tanh(%34)
  return %35
}