ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "Add"
  }
  node {
    input: "0"
    input: "2"
    output: "3"
    op_type: "Mul"
  }
  node {
    input: "3"
    output: "4"
    op_type: "Tanh"
  }
  node {
    input: "4"
    output: "5"
    op_type: "Sigmoid"
  }
  node {
    input: "5"
    output: "6"
    op_type: "Neg"
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    dims: 2
    data_type: FLOAT
    name: "1"
    raw_data: "\000\000\200?\000\000\000@\000\000@@\000\000\200@"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
