ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    input: "0"
    output: "1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    input: "2"
    output: "3"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    output: "4"
    name: "Shape_3"
    op_type: "Shape"
  }
  node {
    output: "5"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "4"
    input: "5"
    output: "6"
    name: "Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "7"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "6"
    input: "7"
    output: "8"
    name: "Sub_7"
    op_type: "Sub"
  }
  node {
    output: "9"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "10"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    input: "3"
    output: "11"
    name: "Unsqueeze_10"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "10"
    output: "12"
    name: "Unsqueeze_11"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "9"
    output: "13"
    name: "Unsqueeze_12"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "14"
    name: "Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "0"
    input: "11"
    input: "12"
    input: "13"
    input: "14"
    output: "15"
    name: "Slice_14"
    op_type: "Slice"
  }
  node {
    input: "15"
    input: "8"
    output: "16"
    name: "Gather_15"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "16"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 0
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
