ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "x"
    input: "x"
    output: "1"
    op_type: "ATen"
    attribute {
      name: "operator_name"
      s: "add"
      type: STRING
    }
    attribute {
      name: "overload_name"
      s: ""
      type: STRING
    }
    domain: "org.pytorch.aten"
  }
  name: "torch_jit"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "ATen1_dim_0"
          }
          dim {
            dim_param: "ATen1_dim_1"
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
opset_import {
  domain: "org.pytorch.aten"
  version: 1
}
