ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "\022\254`=\314$\241\275\"2\032=\342\322:=\022kx=\300<\313\272@\035\234\275@\362w\275\3564n=\000\351\217:\210\305\025\274\026\332c=\316\222I\275;fO\275\276\337\231\275\211 \252=\246\344[=;~`\275\233c\005\275f@\361\274\272\351\\=\310\003\030\275\300\216\337\274\360o\230\274z\262{=\320\n\216\274\000z\366;P\254\217;^\023]=d\326\234\274\027d\202\275\"\027R=\000\2673\275+\220\230=>\r9=\313.w\275h\020\030\2756\312\031\2755\007\243=v\010\001\275\240\026k\274\242/t=\215\347\222=\336e1=i\316\210=f\325\373\274\006\364\005\275\316\215(=0+\035=\246\016K\275K\'\004\275\362\177\001=2Pi=9\271\221==$\231=R^_=\220_\200;\300\305\035\274\256p@=\034\260\375\274\260X\355;\241^\243=\300\361\305:8\236\226\275;\227\013\275\212{.=D\366\213\275\2500\234\275\336%4=\033.\232=L\345\211\274f\344^=\276\351,=\271\274\245=\256e\033\275\310\3441\275\300H\341\272 \200b\274\200\303F\273\360\333U\275\233\021\226=\026da=(#\036\275E\204\236=\253e\246\275P\347%=.*\023=\357\271\203=\2739\221=\300\020\305:\216\3368=\273h1\275\266\360\247\275@\337C\274\254\240\213<Pc\301\274P\245\361;\\0\210\274\000!\245:\n\307\030=\340Ux\274\330\305\010\275\350\373M\274\216\244B\275\250x>\274\006\306h\275O\026\234\275\220\202\207\275J\224e=\345\344\240=\374\337\274\274z\263Y=h\324R<\\:\245\275\242\000n=r\026\032=\274\316\364<\230\261\025<\343\020&\275P\277\322\273x\376$\274N\227\006=P]\344\273\000e\201\272`\023P<\024\324\216<X\232&=\\\221\351<W\255\234\275L\330\323<\205@\227=\376\347D\275\325\r\235=\246kX=\262Jc=&\"o=\333\025\000\275\3343\351\274\236h9=\004\240\313<\340\312\222<\026I\247\275\020\233\251;\340g\366\274\200=\327\274]\260\213=\232<*=L\\\226\274l\265\332\274\003$\242=\343\367\214\275\217\212\247=\000/\215\272R>\216\275\206\312\326\274`\267\013;\036\355\240\275Pdi\275X\210.\274\353-&\275\002q==\3261\001=FUG=Xa8\274\305\031\200=\326\017&\275\030\007\005=\020\262\351;D\333\230\274\203\305\206\275\256\335N=\206\3408=xM{\275oM\224=\300-k\275\345\264\234=\01686\275x\202\014=\350\246\027\274d\325\212\275\020$V\275V\256\257\274r\263k=\203\243\017\275\241w\212=\264\232\327<6\035\003\275HPl\275Ha\213\275\254\337\251<`b_\273D\263\227< \377\347\274\377G\223\275\342Z.=>Ii=8\257M\275\032\325C=LV\360<|\t\344<\306\325\016\275\0262T\275\200\rB\273\033\324\\\275$<\251<\326G\t=@[\204\272\320i\247<\246~%\2752(d=+\366\244\275\324N\251\275\030\262\222\275\2374\217\275 ^\245\2740\t\244\273\276H]=\326\250\312\274\370\017O\275\266\305B=\3064\212\275\316\350t\275V\025\251\275\000\206)\271\240\220\016;\220\034\207;\372\377[=z\026x= \227\005\274\030\350\"\275\216\223Y\275\0208\347;\000C\255;\223j\232\275\222d0=\240l0\273\240\235}\273\277\234\221\275rb0=\235\255\241=\250\202\031<\252\345\\=\203Y\221=Ve\375\274s:)\275\273\034\240=\020\372\220;\300\245\211:\253\250\020\275\000\340\336\270\240\327e<J\376c=\020A\356<;\013?\2750\027\337;\030\355\035\275@\230\302<lu\350<`NA\275e6\244=\312\024r=\300\347\263\274,M\251\275`\177s\274\200%8\274\035\353\221=6Y\020\275\235\212\243=\2302*\275\202\367\242\275J\250\233\275\034\331\272\274uJ\234=L&\365\274d\323\234\275\243\324F\275@\253,\275*\245\225\275\013?\252\275\3510\232=\342\206P=\200\331g<\033\2714\275\3304U\275\277r\230=*:/=\347\035\242\275 \270y\274\256\000\027=nC\033\275\030G<<\266B\033=\334\364\224<\200R\007;6y\204\275\014\221\326<h>3\275\034C\232\274S\232\020\275\254\255\365<\332\350\247\275\300\371\256:\356\3246=\020\230\377<F\226\335\274Fh\003=\220\334\357\273$p\351<\332\247S= \365\302\274E~\247=?\013\244=\034?\340<\373\360\226=p\250\251<\303IT\275n\221\002\275\232\340b=\034\311\371<\322\200#=\334\230\274\274\216\314\001=\306\346\342\274>\312H\275\264\001\264<\366b\364\274[;[\2754O\241\275\276\204\021=\340\344F;\222]n=\325%\250=`\017\016\275@\372Z<K\025\215=\355\206\230=\200\272\005;\226\236\235\275P\376j\275\212N\014=\300\273\374\274&+\013=2]q=\032\010\232\275/\366\223=\024\262\227\275c`\217\2759\033\224=\340\302j\273v\031b=\240\315m\273\227\330\210=@W\005\275\274\237\223\274\240\255C\273\333\034\033\275\236\324p\275 \212K\273\242;\022=`\003\023=/3\247\275<\257\255\274\200e\242\274\013\025\226\275\263\267!\275\322\204w=\030\320k\275\001\343\215=\010\364z\274\260\033\242\273\000\224\005\272p|\260;@\231\340\272z\212\006=@\023\036=i\n\215=\320\021\373<d\357\246<\306\321\214\275\tP\223=P`l\275K\"v\275\200\003{<\332/\003=\"\335-=L\246\252\275\217\247\207\275\303hz\275\344N\247\275@i\020=s\220\033\275\030\324_\274\320\231\232<\205\307\222=\270\3757\274\224\317\244<\002\326Q=\216&}=\2400I<\346G\336\274}\323\211=\276\232d=\034\200\237\275\n\344X=0\276\214\274\274\320\235\275b)f=\266f\010=\2000\310;\240\301N\273\223\210\250\275\000\224+\273\235W\222=Fg\026\275\344\177\207\275\276$\031=\250\355L\274\332`B=\234\376\366<\253\221\234=\210\362@\274\004\357\246\274\326\202/=\234\016\355\274\235\310\202=\333(\223\275\306V\342\274\256\031N=x\232C\274 )\023\273\000\361\340\271+LU\275\000\2424\2744)\362<\266OZ\275\361`\210=g\214\246=@\325\274;\300\227\005\274\212{a=E9\217=xXA\274\340\321n;;\247\215\275\300nK\274\030\315i\274p\301\370;`\023^\275bUz=\342\240\243\275h\036%<\330\304[\274\327$\211=\220\260\230;\214L\257\274\372\336M=\211\223\234=T4\216<\260=\212\275v\270`=N\2751=\036.n=T0\306<!p\210=\344\251\353<\206M\n\275P\'{\275b\207n=\000h\373;\353\004k\275\336\225p\275\206G\273\274\256\344(=|l\344<\231\363\233=\220\264\373\273\310\337f\275pX\243\273\n\341\013=fq&=\203\217\204\275\230\266\021\274\263\334\t\275$\233\320<\340O\"\275\"\206K=<<\347\274 E\334<8\025\033=\233\002U\275\\\203\254\2749\226\223=\265\341\204={\236\207=\254\211\372<\326\023S\275\220[\324\273\361\300\235=\2405X<\224\270\246\274\347\324\246= \320\032\274X\377\010<\000\260\264\273x\273\"\275\"\206{=\350\264\030\275\341\215\200=E\203\237=\360p\221\273\266\"D\275y\217\212=L\256\340<,\335\215<\356i_\275\007\221\240\275\264\033\351<\330\2636<\3661@\275\230E|\274\340\2007\275\306\242<\275j\203]=\232D\002=xg.\274\234\276\346<\036\'k\275:\204l=\264q\377<\233P\\\275 \013%=\014\245\235\275\252\2048=\367\031\232=\300\216\"<\030\374\016=\226\306Q=N\206A\275\235)\246=f\203X=\016\376\014=xx\000=\000W6\275\\g\352<\226\312\335\274\000G\325\273\373R7\275\253\2677\275\3067u\275\374\333\247<\207z\230=\230\037g<\200\207^\275\226\005C\275\026-\204\275\320R\212\275\330\320:\275[\270\204=\340@\034\274m\204\240=@\3344<\340\325\016\274|\306\224\274 \274\364\274\032U.= \2433\274\006Lg\275\301\272\221=C\220\241\2754\024\234<\303\3655\275\037\215\230=h\257@\274\020\360\366;>^\023\275XS0<\001\231\247=\354X\340<\243\316\215=\360\346\004=H\265#<\260\361\201\275w\240\212= ._\274M\022\206=\0047\226<\303\302-\275\204\367\364<C\371\\\275\307B\220\275\240MV<\300)\275\273\310Sx<\316\256\026\275`(\010\274\340|\013\274\274\344\227\274\334\346\230\275\2009\242<\330\351\"<\006#\363\274\022\027m=\374#\344<\222\265\t=k\217\005\275\232<2=\240\031&\275\232\036\233\275\206\226\220\275u\034\222=\326\224%\275\310\343\250\2754\365\377<\332@4=\020\275\214;8\263r<\227\367\204=\316\013\245\275\326a\000=pT\220;\323\327\225\275\310\022Z<\014\353\365<t\001\205\274,\265\314<\254\315\214\275H9;\275Px\255;\025\r\242=@\373N\274\025\201\211=\036#@=\370\227\r<(\204\240\275WJ\244=t\366\241\274,n\223\275\3466t\2753\235\247\275\000jK\274Q\350\215=\020\230\351<\024\271\262<\240\2749\273\026Q\007\275\200\234\006:0\364\265;\325\230\231=\320\002\266\274>bT=\233\027V\275\006yv=\334m\375<\322\013]=rEx=80b<\200\222F<0\267\357\273Nm|\275\366\302K=\234{\357< z+;\000\370\247<`v ;\034o\226\275\346,\024=\033]\215=\314\233\320\274\002\237F=\200\034T\2750\024\330;\024L\207<@\376\357:\002\261:=\276\246\202\275\016g\016\275\002\312j=\206L\312\274\177\237\226=\234x\300\274\000\010{\274\274$\344\274\006\033;\275\213\352\r\275\300\223\274<\352_{=&\266X= \250\t\2740\332\204<\000\3702:\371\"\214=\026|\240\275\326\313\247\275\035\177\201=lp\262\274\324\222\261<\272\314]=\314\002\224\274\3209\375;\003?A\275\256\247\035\275\215i\235=Z\326,=\022ua=\240R\034=\220\367e\275\004\370\210<`aN\275\026\0137\2754\261\331<l\242\212<\376V9= \216\\\274\000y\365:\032A\002=\240;h;\262t\022=(\373\004\275X\\\000<\230\270W\274@U\367<>\243\020=3\314\227\275\312\002+=y\001\237=\334\377\241<\004/\236<\330\005\177\275\r\007\225=P\332\274\273/\005\251\275B \032=\274\255\312\274+;j\275`\2347\274\252\242==\334)\205<\300\365\320<\266P\024=z\316X=~{Q=\277:\241=\216\333\205\275\000g\2469\351\255\245=h\2529\275\200!\212<\016.V=vD\245\275\001q\224=T\225\332<\\/\255\274\370\325\232\275\240\357C<>\277F=\243!W\275h\262~\275\000\030{;\035\346\226=\\\277\310\274X\325\016=$G\240\275$\247\207\274\270`+\275\3000C<\350\371 =X\316(<0w\225<\270\244\241\275,\330\332\274F\250\025\275\323\013\224=F\236p\275\212\3235=%\371\203=\236\316N\275\200Rd\272\347\007\230\275\030\227a\274\036\220\r\275\370:\007=\006\016\030\275p8\353;{Z\232=\344\031\204\275\372\035\021=\224\036\231<\334\'\247<\252>1=<_\310<\020\035\260\274@\2463\275\346V\263\274\344K\242\275\300\327\000\275\006K0=\327\004\201=P\021\211;\340\236-\274\264\036\246\274m`\220=\213\037\246\275\317c\251\275R\367.=\013\241\'\275\314\r\275<\320\010\317;\034\255\272\274\310\245\002\275\200\327\251<\311\363\245=D\220\301<\332\320!=\233;\234\275\223\363\224\275\201\356\224=\240\245&<\250\324\025\275a\202\246=bt1=^y\017=\340v\345<V\224\244\275\366\035A=\340\247:\275+\037:\275\372\022\"=\000\177)<$\005\315<\010\017><\304,\250\274\366\255\226\275V\345L=\222\261D=\0302w\275s\352\035\275\020\316\364\273\377\342\245\275\010\247V<(\2774<@\271\263:\000\236H\273@2\216<\010\370y\275LO\250\27405\350;\343K8\275\243\360\206=d\266\251<\000\234\3329\026\213\033=`\rp\275\332\202J=\313\320-\275\333\035m\275\275E\246=\373Z\233=\321\300\240=\374]\207\275\272/\245\275\370\304\n=\200\304<\273\362J\016=\324\333\235\275M\252\212=\333l\027\2750\346\300\274J\360v=,/\277<\017\372\220=D\370\211\275\314M\213\275,\213\245<\260\360\217\275\240\215J\274\000\271\2269\232Qh=0?\262\273\340T\016<8\263_\274\212r/=r\263}=L\307\231<`\314\001\275R+\001=w:\236=\353[\225=\210d\034\275k%\021\275\200\233t\272w\342\223=o\200\212=\026\036d=`\001\311<;\343\244=\312\037\242\275\036\"[=\2706*\275\374\302\361\274\350\216\032\275p\263\214\275|9\252<8\177w\274\370)\004\274\270\301c\275\242\331F=\014r\212<`\307e\273\265\232\211=Z\315B=\333vi\275K\365/\275\000\177\327<\n[}=\240\266\002\274x\234\000<\014^\220\275N\301\242\275\335\237\222=\2408t\274\300\3277<\034\236\240<Hf$=\246l\373\274\236\"\210\275{\340\227=m\252\237=\253\024H\275P\366\277\274\222)k=\246\027+\275\000\317\330<\200\270\223;\000\233\225\274P\255\003\275\016\206\003=@\366}\274`1\020<8\336z\275KS\235=\200\276\364;3\010G\2751\r\220=03m\275\026\255$=@\364\314\272\000\233\336\271l{\245<\246bu=S\017\243\275\274\023\363\274\260%\366\274&!\r\275\372\3137=+\226\243=`!R<\230\262K\274\257\223\240\2758\235>\274q\036\201=5\356\236=\226\300\246\275\300*\206<vH<\275\356\367\007=\252\341Y=@A\211;\204K\222\275\314h\225<\326z$\275\202YZ=$^\234\274\226#P=\000\037\270;\362\034\036=\036\233\030\275\300~\247\273`\230\013;W\005\243\275`\375\311<P\013\374<\024\235\310<|\344\347\274\220$\233\275I\270\245=^\353J=+\247J\275\274\264\321<\262aF=\242\317\242\275F,3\275\202\362\006=\235U\200=\253 S\275\200\326\343;\375\214\225=:\3600=\2563]=\266\225a\275\350/d\274\376x1\275\226@\366\274\\\334\250\274\236\220W\275$\r\226\275\004\337\246\275\202\2521=j\272x=\216q:\275[\233*\275\256O\240\275L\363\203<\271\'\225=0\014\216\275\270\240\227\275|\222\311<&\233\273\274I\322\213=4\326\275<\314\353\233\274\352Q\221\2750\267\220\274\217\230\203=\375\026\235=#H\201\275\253\030\233=\320\017\301<V\354\017=\213-P\275@?\303\272@\303\200<|\n\317<\376\315X\275F\226G={dP\275\227E\207=\306\262\021\275+\335\243\275\266+\270\274\305\302\203=\016\300B=H\236\'<\354v\267<\310I\"<\020v\341;\252\001\037=;\356\232\275(|@<N\2640\275\310#c\274\342\265F=\360%\324\273\374g\371\274\0064K\275\210\332\"=1\014\245= \366F\273\260\252\245;\332\014s=\222%X=T#\345<f\266\317\2740\367\252\273\320\314\362\274|\030\302\274\214?\346<D\213\220\275L\202\251\275X=\n\274\344U\206\275\231?\227=p\271\234\274`\005\\\273\265]\244=\314\346\207\275\373\250\001\275\300\216\363<\332r\n=\326\370\237\275J\316==\016 \003=\276qW=\273\352G\275\233\256\233\275\030$b\275\000}!\275\235\311\203=\340\232?\273!\346\230=\026\202@=\2730n\275\311\242\247=\200\025]\274\377\231\225=\373\372\211=n=\247\275\030\017\030=\032W%=\253\325x\2758\331[\274\274\331\261<$\026\257<\214\004\203\2746\010\345\274C\010\210\275.\r0=js?=2\323,=\000\303<\274\000t\317<P\375f\275\326\0307\275\314V\230<JMT=\274\203\227<p\327\365;_p\226\275\n\377E=\314\222\255\274{\300\226=\214\261\221\274:\301t=\260w\231\275\366\253\373\2747\360\221=\245\244\211=\302\004x==Z\226=\230\316\032<\322\366E=l5\253<\360\347\353\273^\2515\275d\324\206<\036\215.=\364\371\371<\261\023\214=\200\000d;v\035K=\206\"\037\275\323\241\227\275\206>\255\274+\373y\275\336\316;=\350\3401<D\364\243<oy\217=H\212%\275\320\304\223\275+yg\275\232\345X=\2053\235=\305Z\227=\251f\206=[\005\234\275\000\343\336\273Hx3<@C\261\273\245\335\233=\240\r\232\275\340T\037<\024m\247\274\267?\200\275N\374\234\275\260T\364\274=\360\211=+\022$\275\304\267\245\275&\313i\275\321G\234=\006yD=(+!\2748\'\n=2x\000=\323\374\244\275\220\020\223<\200jC<\340\2677\275\270\345\021<\002\364>=\014\276\207\275@\320#<\220\270\316<\257\307\223=\361\334\247=\005\003\235=\000>\345:\230\320%\275\212\306J=(\0353<\032\225\005=\213\\\213=\300\033\314<\203nE\275\0323\'=\266Q$=\223\342\247=c\327\204\2754o\254<\360Q\265\273\260\325X\275z\266D=r\007X=\310\3731<\227\352\242=\177\353\204=\n#N=\240\204\361<^\224\010=f\237\376\274\224B\360<u\214\250=h5^<\360\262\275<\346@\353\274I:\211=\272\276;=j\272A=\336\201\021\275\245\250\234=4V\340<p\216H\275@>\243\274,\354\203\275\274\351\234<\224\370\231\274\000]\346\271\223\247\020\275\260\363\243\275\362\036z=)\217\250=\333\326A\275R\022i=>a\033\2750t\341<\227\211\227=\002\266{=\035\263\232=\200\267\366\274\204I\250\275\370\372W\274D\347\242\274\0014\233=\362\204]=.\033&\275]\355\203=\370\035n\275\300\000l\274\020*\315<\374\363\313<\332MG=l\266\327\274!\003\212=y\225\200=\254{\235\274\306\377\033\275\374\300\351<\000\327\362:8\342&\2742\311[=\347\205\226\275\213\307\220=\243\3657\275\363$\201=ey\243=\374\221\257<\330ZJ<\334\275\376<\336\323\234\275\323h\222=\342\360I=\01662=\275\345\203=\"\265\203\275F\3662=P|\205;\351\344\234=>A\031=44\221\2758j\205\275\350\241K\274\026\363\340\274`\3308\274\252s/=~B-=\254\260\252\274\032\247P=\014K\247\275G\032\214=&\342\020\275U\300\231=\265\227\243=nt\037=I\260\246=\300G\321;\214\256\275\274v\327{=\253d\233=\352\360j=\270\035U\274\252\223\177=\300\372\305:@\031\276\272\323\206\000\275\330\036\221\275\230XG<\234Y\251\275\306\262\025\275f\216\200\275&<\202\275vIc\275\310W/\2750\355\332<\250\315\205\275\354-\354\274b\n/=\246\267\350\274\256^\026\2758\226\016=z\0027=\020q\177\275F\205p\275sA\201=@|\364\274\003]$\275\014\006\335< \261\014\274\324A\342<>\347\222\275!\360\236=\240\266}\274\270\360\035\275\200\325m;\240\"\373\274b@.=~\310s\275\203\305d\275H\3649\275\000\'\3369\334\377\206<oo\224\275@T\253;6!a\275\210\214\234\275\003\205\211=\3321Q=\023\326;\275\236C!\275\266,&\275\243\3338\275\023PP\275\250\350N\274c\375\022\275\\l\257\274E\355\241=.\311:=8\242@<\020\030\370;\000\370\020\275 \310\343<\355@\212=\3636h\275\320\357\214\274\223\272|\275\274#\270\274-\254\225=\n\321\r=2\245D=\024\377\201<@\327\277:\000F\023<\353\0339\275\364Y\307<Z\332Z=z\202o=\356\000U\275\273Co\275\306\021\231\275do\201\274\323X\212=^vV\275\321\200\252=\200H\007\272z\0207=\200\344\033\272\"\234_=\266\332B\275<\260\217<hR\231\275\000\370=<\n\216\236\275~Qv\275p\275\215\274\273\373w\275\233\372\"\275q\332\217=X\357\025<\000\260^\275v{\037\275\200\224\226\273\310@\\\275\036-\026=\362\242j=\220-\346\273\034\301\260\274\020\336\332<\340\301;<\300)\364\274\346K1\275\200\374\242<\266BQ=\340pz\273l\003\333\274\234\352\352\274D\214\303<h\272q<\242\265!=\020\240$\275\353?\001\275\3704\024\275\226@\016\275\370\231\n<\272\016X=\300\360\225\274\323jK\275(\037p<V\362\004\275`B\271<\246\372V=\033\252F\275\004\303\217\275$\362\355<\340ux\274\006\177\"=CV\232=b}[=\0309\032=\223L\222=\006\002\341\274<%\200\274\264\004\211<\220k(\275p\t\241\275J\303E=6\"l\275^\361g=N\206i=\202c8=Z\031g=\353\353\223\275\360\003\306<\277\037\227\275\273>l\275H\274 <\036\247]\275\343\"2\275\\^\250<\304\353\330<;\214Z\2753\003h\2758\211\n\275@q\354\273h\243\037= D\033;\226Tq\275qn\233=\376\007\213\275P\263\266<\020\355\206<\275\222\222=RC4=<\217\231<\274J\203\275 0\016<\334\334\210\274\032\0024=\251/\226=\274f\310<\000\353\316\272\016\345\000=\022Jf=2*4=\210\374#\275\206L\001\275\005\007\227=\242\227:=\360\307\357<ZN<=X\230D<\333\351a\275P!\252<\240\246r\275\242\203G=\242\2173=0\240\321\273\243\260F\275\032\t5=\200\n\203<\206\311A=\000\203e\274D\336\241\274\360\310\277\273\200\001?;\262\374\235\275N\300J=\202x.=\335\016\201=\355o\224=\214\031\267<(\363\005=\206\266P=@V\202;\201\352\221=\340H\260\274\260\322\355;[\350\223\275*}R=\266\306\360\274\346!_=:6\222\275\300m\224\275\362c\210\275\031\254\241=(\277E\274\360\013\360;\300\010\321\273#\240\"\275\323\027\030\275\373\016P\275JQ\252\275P6\272<C\356\237\275\364\t\214\2746\017\024=\303\230\213\275G\317\212\275@\220_\274\276\336\036=\014#\214\274\316U!\275\365^\212=*\250\033=\314\304\200\275\031,\205=\375\010\224=p\025\357\273\310f&\275\316,:\275\20062\274Y\367\215=\2315\236=>\223M\275x\027\017\274\301\264\245=\302\322$=<\377\241<\273e\233=\n(.=p\370\352<\303\240+\275 \253\367\274\302\037\n=\220j\320\274mP\204=<\355\305<@\027\241<\302\033Z=\316\303\027=\343\005E\2750`\237\274\223w\234\275\310\3579<\177\013\244\275`\222\315<H\215G\275H\370\003\274\353\022_\275\330\312\222\275\340\336P\275\010\002\027\275\200\310S\274`\201l\273\347\277\213\275de\252\275\272\020\022=\323\265\236=J\302O=\314\002\210\275P\277\332;\305\354\215=\240v\217\275k\303X\275\230p\037\2746\235\355\274\373\017\231=\206Bl\275\240\215\010<\266\300\256\274VN\023=\364\237\270<\246\241\363\274\240\213+;\223\241\216\275{\376\014\275\342`\\=\026]\321\274\250\243G\275\312\347z=\003/\213\275k\303\224=\346\316\001\275$\317\300<X<\222\275<*\246<\200\375\361\273\263\244\202=\206\321S\275Kv\226=\006\260\222\275\002\211\211\275ZD-=\000\237\313:\323\242\r\275\232-v=\202\013\216\275P\312\356;\266\245\235\275\251\272\222=`\000\301<\360\004\333<\361\306\220=\313\366\007\275z\2220=|`\307\274\340\316\235<U\366\232=`\326)<J\336;=\360\316\201\274\2700F\2754S\371<X\251c<\000>\314\274[\274*\275\250\003I<\021\352\240=[.\234=\360\232\227\273\262\241/=\203\315\031\275\346\305~\275H\354\037<PXM\275}\036\215=\270\301\231\275s\261\215\275%\346\236=\276\2764=\210\341V\274;\336\240=\020;;\275 \316\230\274\330bz\275\200\261N\275\253S2\275g\262\237\275hv\225\275\020\343X\275\000v\353\274&r\323\274\364\204\246\275\262\201\243\275\364,\243<h\263\013\275Y\010\201=F\220\035\275\260\035\003\275\341\005\217=\026@>\275\230\3054\275\020i\205\274\332\023\177= \353y\275\222_\251\2753f\237=\205\254\240=d!\375<p\006\236\275\000\307O<\302\316\237\275lh\305\274\220\250\214;\204c\321<\020\362\335<\373M\217=\266F\356\274xR\037=\000\224D\273\010\2632<xY\025=\334s\224<\340(\023<`\227\243<\210\224\215\275\216\320z\275\023B[\275 \275\014\273\340\300O\273\333\354\245=\347<\241\275\322zE=\024\010\245<\032\022@=\374\262\277\274\000,@<\340S\003\275\220%\245<D\325\215\274\220\374\320\274\375\335\203=\302B\241\275\000\310\372\272\274\233\244\275\360\020\272\274 \2706;{QE\275\370\0204<#:\231=\236hI\275\342\')=\300\022\227:\336\023\010=hiT\275\243f \275\260\225\235<\350o\013\275\365j\252=\000\020\274;\300>1\275@\310\371<\365s\233=~ZT\275\000\326\200\272\324b\340<\323V\226=\000\374\2659>\264\006\275^\"q\275\376p-=\300\357\256\274\216\352Q\275H\t8\274\220\362\323;\274s\213<v\207I=\034\311\325\274\001J\220=\304\354\223<\266\266E=\034\240\314\274\360*\340;/\304\245\275\357\371\221=\320\223\212\274\243gV\275\316\371q=Lu\201\274\036\370e= \'\034=\254V\361\274,y\212\27434\025\275tG\301<\240\347B<b\022g=\355\'\211= \001\222\274g\254\226\275@#\337;\324\266\234\274B\374f=\'\274\224=\370{\000\275\036F==\223\010\242=@\232\267:+\364`\275\242\302#=\362xh=\356\342J=\360\257\t\275\034G\362<XDs\274&\2743\275\204J\235<`w9\273\345\210\221=\316h\016\275\346\210\365\274v\345\314\274\030\255\006\274\023~I\275\230\026\001<4\'\270<\200eZ\273\326cs\275\310\\\026<\222\357b= \023\016;hjV\275?\302\202=(\210Y< \244q<\320\224*\275\360\271;\275\330J\013\275X\337\034=A\233\240=\340\036\200\275\300\262?<\372c^=\213\027\204=x[6\275\236\304]\275\306Y\021=\200=\\\275\340cO\275\252aZ=\036Yw\275\022[0=\366\264#=\000\326c\271=\350\206=\200\300\223;\202\271?=8\3606<\314\351\203<,\275\242\274\006\223;\275\254\244\264<w\241\245=\242\010\237\275.r\024\275\342\266\177=\314F\206<\000(\2529\002\350\225\275\330\272H\2750KI\275\000v\241\2747\r\204\275N\330\236\275\362;L=\332\364H=v\252z\275D\333\225\275\250\374\247\275\312MD=z\260\'=u\366\224=\\5\344<\260\242\376;\334]\353\274\\\213\364\274`\366\373<&\021,\275\233\362=\275\262\352a=+mg\275`~\016<\266C =\202:\210\275"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
