ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Shape_0"
    output: "onnx::ReduceProd_2"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    input: "onnx::ReduceProd_2"
    output: "onnx::Div_3"
    name: "ReduceProd_1"
    op_type: "ReduceProd"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Div_4"
    name: "Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Div_3"
    input: "onnx::Div_4"
    output: "onnx::Cast_5"
    name: "Div_3"
    op_type: "Div"
  }
  node {
    input: "onnx::Cast_5"
    output: "onnx::Cast_6"
    name: "Cast_4"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "onnx::Cast_6"
    output: "onnx::Unsqueeze_7"
    name: "Cast_5"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "onnx::Unsqueeze_7"
    output: "onnx::Concat_9"
    name: "Unsqueeze_6"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "onnx::Concat_12"
    input: "onnx::Concat_9"
    output: "onnx::Reshape_10"
    name: "Concat_7"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Shape_0"
    input: "onnx::Reshape_10"
    output: "11"
    name: "Reshape_8"
    op_type: "Reshape"
  }
  name: "torch_jit"
  initializer {
    dims: 1
    data_type: 7
    name: "onnx::Concat_12"
    raw_data: "\001\000\000\000\000\000\000\000"
  }
  input {
    name: "onnx::Shape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "11"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "Reshape11_dim_0"
          }
          dim {
            dim_param: "Reshape11_dim_1"
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
