ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "0"
    output: "1"
    name: "Sqrt_0"
    op_type: "Sqrt"
  }
  node {
    output: "2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "2"
    input: "1"
    output: "3"
    name: "Div_2"
    op_type: "Div"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
