ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "0"
    output: "1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    input: "2"
    output: "3"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    output: "4"
    name: "Shape_3"
    op_type: "Shape"
  }
  node {
    output: "5"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "4"
    input: "5"
    output: "6"
    name: "Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "7"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "6"
    input: "7"
    output: "8"
    name: "Add_7"
    op_type: "Add"
  }
  node {
    input: "3"
    output: "10"
    name: "Cast_8"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "8"
    output: "11"
    name: "Cast_9"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "10"
    input: "11"
    input: "14"
    output: "13"
    name: "Range_10"
    op_type: "Range"
  }
  name: "torch-jit-export"
  initializer {
    data_type: 1
    name: "14"
    raw_data: "\000\000\000?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "13"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
