ir_version: 6
producer_name: "pytorch"
producer_version: "1.4"
graph {
  node {
    input: "input"
    input: "target"
    output: "2"
    name: "Sub_0"
    op_type: "Sub"
  }
  node {
    output: "3"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "2"
    input: "3"
    output: "4"
    name: "Pow_2"
    op_type: "Pow"
  }
  node {
    input: "4"
    output: "5"
    name: "ReduceMean_3"
    op_type: "ReduceMean"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "target"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 12
}
