ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "tensor"
    output: "1"
    output: "2"
    output: "3"
    name: "Split_0"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "split"
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "tensor"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
