ir_version: 6
producer_name: "pytorch"
producer_version: "1.4"
graph {
  node {
    input: "input.1"
    input: "target.1"
    output: "2"
    name: "MeanSquaredDistance_0"
    op_type: "MeanSquaredDistance"
    attribute {
      name: "reduction"
      s: "mean"
      type: STRING
    }
  }
  name: "torch-jit-export"
  input {
    name: "input.1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "target.1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 12
}
