ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "input"
    input: "weight"
    output: "2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "l\306\240\275\360\360\205\274F\362#\275<\024\266\274F\304\226\2756\371\010=\213\374\230\275\220\000\256\273\244M\355<P\034\346\274\222\255A=`4,<\232\241;=R\000[=8\256\026\275\240\030\370<\213\255\023\275@\375\325<\273W2\275\346\343\035=\3403\212<\026\224\005\275+l\'\275@\237\260<]<\237=*\316#=\240\327\003\274\300\212\204\273\222\002B=\260:m\275\244\363\342<L4\342\274*}E=p\205\363\274P\006\207;\034\206\346<\006\223j=h\256H\274\243\262\233=Rd\220\275\270\213s\274G/\252\275P5\342;0\272\301<\216,\n\275\200\303\r=8U]\274\250N\224\275\305\006\203=\"tR=\256\224,=e\"\210=\274\007\373<\312{5=\371\237\215=\244\213\211\274\230\032\205\275x\335\'\275`B6\274(\010\026\274\200\016\024\272\312\233C=L\376\332<\013a|\275\246\023\315\274\334\230\240\274z\275O=@\250\367\274\000\317\016\275\330\204[\274\220\246\255\274d\025\250\274\277\374\246\275\325\017\230=b\2525=\256\203!\275\023\370T\275`\377=;\232{B=v\364t\2753\352\000\275\200\305\016=>*\\\275\250\007\030\274\013\263\200\275\345K\236=\022\3767=`\300\235\275pt<\275@\376\361<\200\247\225;\274\351\264<l\236\213\275~\3036\2750\340\032=:\"\202\275\2641\217\274Z\032\026=b(1=\020\311\251; \346\305<\276\326\027=(\201\037\274\234\206\272\274\261T\202=\223^\246=(\033\036=p5\025\275\020t\224\275cs\250\275\200\037\027:\203\366\002\275\366\311\253\274\230\377?\274\321f\241=[\305\241=\200N\377\273\334\375\314\274\230\303%=\020\346\331\273\034d\242\275\364\206\336<uc\243=hH\207\275$p\223\274\364\013\224<\267\371\212\275;\036\222\275\032\321~=\254\272\361\274\356\033G=\200\035\364;\334\217\246<f|c\275\244\314\221\2742)a=\230\216\034=P`\305\2748\366\'<_\252\202=\246\211\225\275>A[=0+\315\274\374\340\212\274Fm\"=f\310\215\275\250BN\274\307\027\243=l\262\365<\320m\374\274\364\262\224\274\215\227\206=X\365\000=zag=N\315[\275\240\320\304<\200\020t<\210\377m<\ry\236=\316\363<=2Hk=F\340\025=\000u\017=(}m\274\262\240\226\275\320*\220\275V\227T\275p\376\\\275@\257 =lT\323<\326\247\302\274\306\001\202\275\355\003\250=u?\200=\372T\"=\215\356\250=\203\2725\275\353aB\275\373\313G\275\0004\204\273r\247\226\275Y\033\207=\240}\014;~\373)=Ns;\275\300\250\014\274\030\2243<|\331\272\274\237\027\241=K\362\033\275,\367\323<\376\230g\275\370\232!\274v\034\265\274ZE\023=\222on=\234\007\246<P\356\367\273F\317\256\274\303\316\205=lN\241\274\016jv=\310\336\027\275m\250\214=\301\373\251=\302\372i=\"\305C=\344\026\376<.\325\'\275\000\\\202:T\020\353<Va\262\274\210\302t<.\351G=\326 \236\275XW\233\275\316=L\275\010\215&<H\023}\274\364\033\223<\320V\242\274#s_\275xF5<>.g=\350\362L\275/\232\225=l\003\250<qH\250=Zn\234\2750]\243\275\260\232\347<\2346\237\275X\334\213\275\372\217-=\202\261%=\330\203\233\275\272\235u=\364\275\204\274\232i}=kOH\275\"H\242\275kFb\275(\252S\274\360r\252\275P\r\272\273\226Z*\275\\\344\236\274\000\340F\267\020B\231;o\361\246\275\342\222/=\3063Q\275z\004P=\305b\234=\320\251\343\274\240<\031<b4<=pW\330\273\"\315\216\275.T\031=\022c\"=\270\000;\275&\323e\275\210En\274\304\330\205<\373\236,\275\340F\003\273&\200\023\275F\372\004\275X\332:\274\306\030\002\275\301\030\203=\334`\263<?\274\230=\305\030\232= \'_<\340\000\016\275^\220O=`\016>\273\342\256|=\314\304\221\274w\354\226=\310Y4<\334\254\227\274\246\256^\275\026\235|=\010\2301<\204$\354<H\370\t=0\004\215\273\366\231+\275\306\300\313\274\240 s\273\306\363S=\020\225\307\273\374\020\255\274\010\2169\274\340\'`<\2517\210=\325\312\200=\020\266\237\2738\3734<\365\306\232=\326\365\025=\370\020\020\274\232XJ=\372x\033=FW\267\274\230\024\n=\260o\330;\234s\375\274@+\326\273\353\241\240=\304\017\315<J\347\214\275\366\205Y=`\256\222<\210\350\'=\000\227\2679\032\301\007=\320\016\314<\027\331\225=\266\"4=\030`\025\275\n\3402=p\365\241\273\352\260a=\266\211\357\274\014^\310\274\247\322\235=\370\221p<Hm?<\200\003\014<p\000\262;\340\315e;\006N\224\275\265\275\244=\013\357\242=X\373j\275\200\316\250<\275\022\215=\2601\204<^\322\022=\2428~=\272\343\020=X\312v\274\312\337\215\275\376\370 \275H7K\275\300\362\334:X\257q\275z\276X=\300w\206<\323\327\023\275\260\312E\275\004\240\337<\244j\243\274`m\202<xG\000<\210\324)< \362<\274\354\306\205\274\364\022\240\274N\236\003=\206\016\\\275\300\371\377:\336\262\n\275l0\242\275\220\031\300<\\Y\322<\'\336\227=nE`=\233\n\247=\326\034\206\275@\216\224\275\264S\324<.H\'=R`\026=`\305`\275)\217\205=\257X\224\275\214\351\265<0\260\002\275\034\255\365\274\331\334\206=\235\235\223=\356\210\004=@\372\030=\000DU;\260EQ\275P\377\261<\237\307\222=\342\005\017=7\025\231\275\004\270\217\274\340\303\331<\000\314{\274VZ\324\274c\241\225\275\350\312\013<\004\337\266<\230\035\233\275\334S\202<lm\315<\240\273\376<\036Z^=F\261I\275|d\336<\320v\374;\254A\306\274\300\\\246\273\025f\250=\000\373/;,I\270\274\000:\240:\313\304$\275\353\020F\275\234\345\231\274\316\3110=\200j\323\273\024\334\237\2746\310\r=\276[==`\354{\274 a\254\274x\352f<6\2279\275\232\210{=\000x\276\274\314\311\345\274\301\024\234=\024\037\204\275V\252\267\274\225o\232=\200\224\036\275\244\303\216\274\273\247\243=\006\356\341\274\032\225\035=Rw\022=\\\266\203<B\255\220\275h\016]\275\346B\210\275\3120\250\275&b\276\27488 <\276s\225\275n\217\232\275\2206\211;\354\330\375\2748\363{<L\226\215<\245\316\251=\340\247E\273\253 \212\275\243xa\275z<\235\275\350Qz\274\350k\034<\340M\341<\224F\202<P\276\234<\310\322<<\0201\362\273\363 \031\275l\375\240<\210\3013< \340\277\274r\276x=&\031\246\275\254\241\310<\363\257@\275\222\2504=Iy\205=F\322q=\376\341\002=\316\375\"\275\\\200\226\274\300\203\277\274\2000%<\250\257%\275N\365%=\216\313F=K1\n\275\220\250\304\274\350\316o\275\323\220=\2750\002(\275\222\274m=#\332\221\275\020b\314<o\t\231=\203\313b\275\306x\226\275\366\3678=r\010Q=&\325\016=A|\206=\362\307W=\200\033T\274\362\240|=+\246+\275\260\n\022=\243\337M\275\240+\231<\002W8=\354_\377<f\3409=\2406N\274\274N\352<@g.<\371\016\216=b\224F=F\233w\275\230\352\005=\262\2415= \035\274<\233\210,\275\341\036\246=\273\013o\275\363\317\212\275\320Q\335<\226-\020=\020&\317;`WN;J\007\017=\256\242q=^\014%\275\020\031\326<\214\205\373\274F\2110\275\320?1\275{\013~\275\347\374\217=\2264\347\274v\335\277\274\340\033\004\273xY^\275&3]=\306\251\324\274\316T5=\200O\306<bj\251\275:\353\234\275\330W\246\275\275\'\231=-\253\233=4y\351<\010\334\r\275\020\206\340<\352\362\200\275x\227]<X\223:\274\372\334i=0}\253;\000\250\320\271@\334\361\273\377\322\243=V\265n\275\376\314\032=\347\217\231\2758\300z<~\014\217\275F\324%=i\267\230=\233\276#\275\377\022\231=\007\322\230\275\272\343\"=\230Yh<\224K\234\274H\217<\274\326h\010=\010\307x\274;\024\245\275\314\231\366\274y\305\220=\334\366\222\275\246 \346\274\226\336\014=\372\220y=:T\200\275\3332l\275\356\352M=v,h=\316\006^=z\360C=c\204\221\275\344\016\341<\000\315E\273\350\243Q<\340|\002\275u \245=\320\371\223\273\213\234i\275\222\3310=@2\345\272;\311T\275\303\331\026\275^AW\275|6\206<\354{\222<\234\373\274\274@\001\340;\260K9\275NL\251\275\200\244\003\273I\310\241=8C~\275Pj\207<\330\211+\275\250\275V\274\314j\237<\310<(\275JX\222\275@\212\251\272\220l\313\2732\017w=\0326\010=\0022D=0rV\275\264\352\237\275SGN\275\372#\211\275`]>\273L\275\312\274p\272\372\273\260\266\300\274\250\203a\274\324\255\227<\255@\247=\274\372\214\274\257\027\214=\337K\231=^U#=fH\264\274po\265<[\305_\275\360\257\350\273H\240\037\275H\260\202\275p\207\220\275\214_\366\274\334Q\252<\000W\346\272\340,<;\342E\017=\244\033\303<\252te=\300\217\243\274\004\227\234<\200HY\272<T\352\274\263!e\275\2008\275\274\037\205\241\275`\336!<7\244\207\275\326f\355\274\226^\005\275\241F\222=C\035\213\275\224\005\243\274\024p\364<@\377\300<-\014\214=\304\253\245<\322\246H=\270\345L\275\036\343S=@\t\355:\330\247\027\274\360-\031\275\214\371\374<\226\2630=\343\342y\275L\371\203\275\030-\010=\302\007\227\275;\212\240\275\252\356v=\354E\331<\300\026\322;\000Y\374\271\276\316\r=\030\316s\275\253\347\215=\0106>\274(\372\005<\327\217\241\275\320I\246;\020\216P\275\202\020@=\262\036\242\275\341\323\231=l\013\240\274p\337\350\274\000j\014\272.\201\213\275\220+\334<\0015\213=\023c\017\275\000\257\335\274\2136\216\275\\O\246<\322j{=\005\360\212=\340\025\333<h\033\031=&\207z\275\226A\t\275?\212\246=\300)\241:(\336\n=\370\345|\275\276\327\214\275\345\273\206=\320\206\027\275\316h8\275\000\342l\273\220F\306\273\272\037\025=\"\377T=9p\227=\360\033\312\274\306\002\261\274\302\314\205\275\220Y-\275 5\177\274\016\277.\275`*\006;\240t\222\274vCD=\020\021\225\275@\217\334\272S\023\001\275\220\371\267;\023^8\275\242\023\250\275\000\355\376\272\360Q\364;\031,\224=\363wh\275\270yK\274\0214\212=O`\244=@SP<\020y&\275\252SI=s.w\275 \t\217\275\020S\352;\326OG\275l\362\331<\326\323\023\275\276\262v\275\234n\371\274\376n^\275\003Sp\275\326\2343=\000\372\010\274\266Y\022\275\030S\247\275I\255\202=\336\361I\275\005\375\212=\222\351\220\275\313O\035\275\245\370\243=(\035\017=f\355Z\2758\330_\275\376\021,\275\352a\002=\222\0002=\006k\375\274v4\217\275\230\016d\275\202\345T=\240Xn<8\221\013=r\264/=3\336[\275o\233\200\275CRs\275\241\315\247= \002\";\020\240\233;\354\214\246\275\330\311`<\272\274\236\275\360\233_\275@\312\256;\2174\230\275\202\246\030=f?r=V&\017\275B\rx=\231\346\204=0\214\235\275\200\375\212;l\004\265\274H\273S\274\266\361?=\023\033/\2750\212b\275\010u\034<t\256\216<\306\3277\275\373>\025\275&\220\231\275\332UA=\333!.\275b\266$=pI\215\275s#d\275 \1773\273G\245\251=\000]1\274\030\010\003\2744\034\226\274H\306D<\366\260\322\274S\371\203=\350G\013<^\250/= \2144;S\032\200=n\255W\275\320T.\275~\364\006\275\323\254\r\275\020\322\302;\346\370\035=Hh{\275\216.p\275r\277N=\230\260\034=`\251\217<\002{\020=\310\244\037<f\253\351\274x\361Z\274\260\023\263\274@\030\020\275\270\271O\2758{M\274\226\"\\\275\303YE\275#\253U\275\013i\236=\177j\250=\202N;=\314\355\212\274p^\263<\2000\r=\340-U<\032\2100=\302\256\000=\320\214\334<\245M\242=\263\260\215\275h\324\002<E\240\210=g\235\213=\220\n\301\274\222\253c=3[K\275\200\311\253\273\231\177\232=\250=h\274\036\2161=\255T\252=C\216\021\275`\207\021=~(\006\275\274\360\273\274&\020}=@:\330<4_\224\275\231\366\237=\252[q=\212{==\310\342\032<\336\023\035=&i\325\274\014A\356\274\266\2713=xDU<\217\210\243=@\t\304:\300\271\233\273\206>F=\003\032&\275c\235\227\275 \0257;\025\352\247=\017g\202\275xXV<\313__\2758\245\222\275\200\021!\272\340\346\362\274D\321\242\274\324\376\340<t\021\240\274x\002\031<\000L\002\273\373\013\202=,\244\353<\274O\367\274\317_\200\275\022\204b=\370D\021\274nG\t=\000\252\023\275j\342q=jYg=\000\003\202;\240\025\261<t*\211<JZ\001= \235*\274\014\014\223\275s\007o\275\010\205S<>\374\251\275\003\311\242\275\263\023<\275\022\2260=p:\314\273\253\200r\275k\334c\275(\251\004\275\033\207{\275#@\237=[\276Z\275\326\3544\275#\361o\275\206\002\367\274M\261\207=\340\360\371<@f\313;sd\250\275\216\367\t=\315\263\237=\300\246\256\272V\026h=,A\334\274\034\010\240\275\000n\010\273\230\021\010=\026\363\025\275\300=\236;xNd<O\316\243=\216\0202\275\302F\224\275(\366\036\275\362\373u=fp\036\275\300*\263\273>pu\2756\272/\275\020w\222\275\3448\314<\222^f=h\3135\274\320\357\305\273\314\005\257<8\377H\274\320`\345;29\014=uZ\203=\336=.=<\030\247<\3777\222=\223\"\230\275\353\275`\275\307\275\212=\255\253\236= \035\037\275\r\000\206=\310\242\034\274\326\277\276\274\000\330R\273\346x\261\274\014\374\273<\3606\317;\000l\332\271\210\202\017\275\276TO=\246\204S\275\300\370\225\272\366\314`=\323\3655\275P\345c\275l|\265<3\"\215\2753V\016\275\321\360\224=j\317D=\355V\232=Z+\243\275\\\201\240\275\020\362\251<p\327\361<c\323E\275\340\302\365<X\346k<K$\021\275\357V\237=\007\023\203=\313`\215=V\240\336\274\000\256\001:\370\210\"\275\335\254\213=\221\t\233=\370E)\275\034h\306<\235\371\220=\270\256-<\374\305\345\274@\310P\274[\351_\275/\"\247=\020\031+\275\260I\225<\342f\225\275@\213\003<\336\361p=\220O\214\275\374D\362<\000[\341:\322\3108=\356\214 \275\326HL\275\350\245\030\275\010\202F\274\323\303\217=\000\276\247\273\363yz\275\220\376A\275|Y\241\274\360\021\310\274\000>\355\273&k\t\275\216\303\"\275\020\240\276<\360F\314<\200U\017\275n\344\000=V%\007\275\240P\177;D\275\214\274\000>\n;\035>\213=\000\020\n\275\203\"\232= cy\273C\376g\275`Q\357<\350\247\031<ao\247=\235\265\202=\274\216\236\275\261\267\222=\225v\234=\322\3451=PQ\213\273\371m\245=p$\260;p\232\237; \241\177\273V\3307=p\264\354\273(5\005<\260,\005\275\230\213-<j=/=\236\2605=\355\013\240=0k\365;\270.\236\275\273\004P\275\220\017$\275\200\332\325\273(B\216\275\353\227\210=\255\365\216=~\263v\275\260d\261\274#dP\275\343\200:\275\347\225\234=k\312\"\275\210\003\032=\262\2026=\300\0246<\363&V\275\220\240\303\273\220^\206\274\205\010\252=*\243k=\350T\033<\322\0056=\337\251\205\275r-D=8F =\341\226\250=L\321\301\274\333\212b\275\007\370\215=G\201\246=\320\251\326;\034\326\225<\273\352\245=\257\241\220\275\206\007\321\274\243k{\275\370\364\"=\202\361c=/\377\222\275\300\032\\\274\223\276\232\275R\341{=\277.\210=<\225\336<\000\226\'\272\200 i\272\nLd=\234\n\353<^T\202\275\\%\210<\251/\210=\356\001^=\273;q\275\304]\205\275\032\006V=a$\212=\353\246+\275\200\177U\275,A\236<6\242,\275~K0=:F\000=s\314\206=\244B\211\274\354\362\310\274\274\177\205\275\261\342\227=\366\274.=\3408\030<\313#P\275\375\207\216=\267\210\234=\014\006\251\274c\210E\275\2206\024\275\262\240_=.a\223\275\353\177\032\275\200\300\020\273Z\272]=8\3737\274\200W{\275F\001g\275\014\251\335<\200\005C\272\3140\251\274\212\220V=(\337\001=@4\271;,\253\310\274\246a`\275\216Y\250\275ZO$=@\276\230:\017\373\214=\000\225\364\274\007\256\244\275#$;\275.\010i\275\034\367\207\274ky\226\275\336\211\t=\"\336u=\200\001\034;\253\343\251\275\024c\355<\020\231\220\274\264x\262<\314\\\314\274X/\202\275\242\t\212\275\\\326\311<\014\236\327\274\331C\231=\200\2210\274\210\3102<\312\314`=mh\237=\014\031\370<\217\275\217=\327\355\210=]\032\251=,<\216\275\242\263\n=\210N\034\275\276Lv\2758D\035<*\356y=\221\305\223=\300i\247\272(|\r=\300T\305\273\270\020G<V\374\253\274\336\245\035\275S\327V\275\324\343\233\275\000\357\037\274\323\200\240=dx\367<\300\201\215;\320\351\220\2758\024\036\274f\232\237\275\370KZ<\026\037\371\274\255\346\207=6.X=s\300\221\275\216\211@=\260\225\257\274#\346\246\275@3\353\274\300$\'<\346\236;=\300\252\234;\265~\201=\343\251\230\275\020\222\024\275\376l\251\275\340O\031\274c\022t\275B<E=\342gN=(8\016\275EK\236=(\235l\275\304,\201\275\314j\205\274\254\310\225<\237_\231=\316\025h\275\217\236\205=\340G\t=\206\301&\275s|_\275@S\343<\260\036\331\273\265\243\210=\030\270#<\023m\235\275\014>\326\274H2\004\275v\343C\275\230\t6\274\030\274\020=\006\301T\275(\202}\274\363\343\023\2752\323U=\357\216\203=y\257\214=\333&\247=F\241\"\275\300\325n\275\266\337t=\246\321\023=\030~`<\320\032?\275\306\'\210\275V\244\342\274y\355\214=FE,\275P\213Y\275\344\330\373<u\002\221=0\255\301;\334\222\264<\206F]=@\327\307\274\347\222\231\275\000+\345;v\335?\275\326\252\007=\300\2003\275\331\260\237=\330\333\004\274\271y\207={4r\275J\363\221\275\336A\"\275\364\000\251\274y\307\201=2\237\204\275\216\322\003\275\364\237\313<\020\035\326;@\211\025\275bta=VPA\275\252\032\"=\340\261\243<\033\362?\275H\211H<t\361\324<\2005\010\2740\020\323\274:\306%=\230\257\022\275\320\325\231\274\340b;\274@\274\304;\010gN<$\311\212<\032\330\220\275\226\341V\275\224\203\260<\331-\215=>\361^\275P1\302\274\013xY\275\033\004\205\275\353\374\226\275\314\254\311<p\356\311\273\226\211/\275\017\244\246=\330]#\274`2?<\267\224\252=p9s\275\006\266\343\274\"\025\210\275\240E\333<$A\235\274\323\267\247\275\300#\322:\300H\202:\031\022\234=\360b\213<F\257y\275\306\250C=\266\241C=F\377\t=\363\177\013\275\242HJ=\200\023\341\274\020\r\201;\360\323\351<s\001\017\275w\310\226=\223\355\230=\020\356\311;\270\325O\274S,5\275~\002i=\330\027\004\275\343\334\223=\250\336_<\245<\206=\272T/=\336\333w=\360\201\266\274\230a>\274&\330\227\275\202DF=X\006U\274\263,b\275\274\253\311\274\323\352\225\275\241\025\212=x\033,\274\\\330\226\274\370\325\024<\000\374\276;\336\217S=\023\234G\275\025\242\210=\360\242-\275\240\352\016<4?\204\274\370\312\025<\340Jw\273\350\370\n=\023bK\275&\266Q\275\206\266[=?\203\213\275\017\030\200=V\032\246\2758$Y\274\302\312\n=N\300\030=\340\310V< \253\t\273\271I\244=\336\243\205\275`&\215\274*\364V=73\236=d\251\227\274\311\227\231=\216G\007=d\273\200<\271\207\200=\232\216;=\002m\230\275\000\034\"\273\223R\236\275\010\306]\275\230AO<\344\034\224<\361\306\246=\220k\272\274\317\325\210=\211\225\240=`{.\274\'\203\236=\300z\204;0\265\370< \013\206<\262\000K=\320~\374<T\235\206\274\313\227v\275n!R=\000N|;[B\244=\333Ye\275\236\037k\275\374\250\361\274V\322r=&\030\371\274\370B@<\200\365K:\\Y\333\274\340\n\035<N\202m\275k]*\275\230\006 =\376\001i\275\237\341\202=\301\260\243=0\025\332<\343\034\232\275\244%\330<\250\367S<X\323x\275\266\202\013\275\2711\245=\006\211-=\243\366\203= \253\267\274`\023b<\356C/\275\200T[<\315/\232=\207\371\247=\212dd=\200L^\275hp;<H\251X<\\\357\206<\014A\251\274\374C\304\274n\262z\275P\247\351\273H\335\201\275L\025\217\274\314N\232\275\221\235\203=\270\002\204\275\364:\360<\267?\251=n\030i=\023A\252=\320\333\006\275\224\305\210\275\256\310\221\275\240\340t\274\330\307o\275\353\003\002\275\2231#\275\345\243\246=\000W\336<\240\335k<\010\236#\275\366\246\266\274%^\231=r-\017=\032\364\031=xQ\006\274;z\242\275<\343\211<\255\236\203=\032]s=D\264\317<\3134\203\275\330#$=\000\032`\275\301)\204=\n\001L=\322\206|=\020\221\202\2750\225\211<h\017/\275\'\365\204=v\227O=A\177\247=\320\353\210;\246\367\350\2749x\212=\356il=\340F\014;\210\222\021=f\322\024\275N\303C=\332\330\\=\236,^=`\2273\275\320\010\373<\364\337\204\274MP\246=\200\372\266\274v\351Q\275\362c\221\275\371\024\230=b\215\234\275\224:\227\274\316\341\t\275\020\334B\275\2645\230\274\\\270\246\274\250\211\223\275\353[\025\275\"t\027=\212\000\005=5\222\230=\334\307\216\274\232\243\220\275VG7=\020\226\351\274v\237\305\274.=!=\261$\252=\t\370\221=\034\223\207<\014\261\203\274p\233\222<f6\276\274z\'s=@g\240<*eY=`\3557\2738D+<\006\315c=\000#\032\275\177(\226=\260\020G\275\312P~=\346\357c\275\002\305\212\2756\215\215\2750\320\200\273NT\004=\230\222v<\316yy\275\220g\361\274\3030g\275\234\273\344<,\344\237<\310\025\r=\333l\214=\303E\r\275p\226\\\275.\023_\275\230\337.\275\316\nv=\t\250\202=\240X\354\274\3000\375\273\30685\275t\242\237\274V\374\230\275\242#\036=\260\021!=\213\301v\275\200\203\215\273\346\337\266\274\022\2556=&Dq=\030q9<V_\214\275~\314\206\275Y\207\232=\264\002\224\274\260G\343\273\353c\031\275\006\006?\275\036\357)=`W\017\273x\357i<\224\230\213\275\265\344\212=\356\017^=W\233\251=\345T\204=\316\354\022=\3403 <\014\374\217\275\013\303w\275@\213\206:B\332H=\200\267\001;\342\004)=\300@\250;\340\377j\274\000\203\201<\000V\000\271\320\2354\275\314\004\365\274\331\370\205=.\020n=\330*J\274\360\274y\275\371\242\210=k2G\275 \242o;\320\215\332<\000\200\314\272\374\304\303\274#\334\213=\302aE=\242\215\244\275\206_:\275\000\177\027;\252\245\013= 8\013=lH\260\274\250\034w\275\305\214\240=\353>|\275Sd~\275\247b\247=\204h\377<*\203\027=&\304J\275\033\354S\275\014&\307< wf\274\tE\206=\360c\345\274\035\354\245=\032\026\001=V.\026\275G\353\207\275\312!N=\000?\"\275~\256\210\275\010\326?<\202\t.=P\263\227\274x\310\014<#\002\026\275\2413\203=-,\234=Z\317^=\244\003\245\275\220\346\233\275\032\206==%\352\223=rD6=(\"\010<\314\t\210\274*\033\200\2758\215>\274\271!\241=\250\303\r\274f\313\243\275 \241E<f\020\233\275\202Nr=P\212\236\273\340\025&<\340\013x<\310\t:\274<>\216<\033\004z\2758\367U<\320\335\002=\023\204r\275\320\017\243\275@\014\304:t\177\270<\340-\300\274p\036W\2750/\257\273>\202&=\376\346F\275\2620\237\275\345\334\244=\307\375\240\275\240tR\274~A =X\003T\275\000<\363\273 \377W\273`\214=<\014\022\240<\016\204#\275\256\274h=\310\370+<\301\223\250=\300=\272;\020&(\275\000\2006;=B\241=\316\344`\2750(\355\273{\336C\275\000\344,\275\247\300\200=?4\226=:\321B=Kde\275\353\0101\275g\223\217\275\300,\345\274\344\024\314<\252mo=\200\247\026\275[\rB\275\240\263\343<I\332\212=pG\345;\306Sv=\245\014\221=hem\274\211\201\236=^\ny=\340\016\267<\304\360\223\275\354\275\322\274l-\222\274\000d\2278\3626\225\275}\242\201=&\247i=\240-J<\026V\212\275\223g_\275bg\251\275\234\306\360\274rlP=B\371\201\275>&e=\300%p\274\350\372\003\274\254\215\350\274le\224<\226\344\361\274\016\000*\275\300\305V<\003\254\212\275\340\360\362<\266\371z\275\031\201\202=\262\373m=p\267\276\273P\245\207;P\241\354;T\003\351<\330\033S\274h}X<\300J\371\273\206\r^\275\210z\003=\"\352\211\275H\242k\274\335\320\240=\3007\231\272\220\325\260\273\322\222\034=my\235=\"J\007=F6\321\274\306gf=\260y\260\273x\326)<\206\200J=\330\330C\274f\365\003=\260}\242\2732l/=.\352t= \374\221<\300\274\311\273\253\344\207\275\260\3479\275\274\257\222\274{\307\227= \363];\020\027\360<\360\201?\275\200\032\234<f\375k\275V9*\275\034?\234\275\226\221f=\336\001a\275\023\007F\275\036\353Z=\206\001\177=\232\3025=\337W\222=\010\225^\275\314\326\255<\330b)\275\317\220\231\275\353\311=\275\373>\000\275\030\205<\274\254\021\212\274\340:t\273\016\300\233\275\245C\202=\267w\241=\372\201;=]k\247=\034\212\272\274\260W\374\273\353[\221\275\270\006\030<\226/y\275\207\'\236\275`\016C\273k\001\035\275\316%\207\275\200\252c;\200w,\274aE\233=\320\275\227\273\304\347\233<\235\250\212=\020b\251\274.\375p=\265\343\237=.\256\017\275\317c\212\275\302\250<=\313\001\'\275\254\217\217\275vJ\233\275\005\275\240=%\225\242=\3547\202\275"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
