ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    output: "1"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    output: "2"
    name: "Shape_1"
    op_type: "Shape"
  }
  node {
    input: "2"
    output: "3"
    name: "ConstantOfShape_2"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "4"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "3"
    input: "4"
    output: "5"
    name: "Mul_4"
    op_type: "Mul"
  }
  node {
    output: "6"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "6"
    input: "5"
    output: "7"
    name: "Equal_6"
    op_type: "Equal"
  }
  node {
    input: "7"
    input: "3"
    input: "1"
    output: "8"
    name: "Where_7"
    op_type: "Where"
  }
  node {
    input: "0"
    input: "8"
    output: "9"
    name: "Expand_8"
    op_type: "Expand"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "9"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
