ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Slice_1"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_2"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_3"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_0"
    input: "onnx::Slice_2"
    input: "onnx::Slice_3"
    input: "onnx::Slice_1"
    output: "onnx::Unsqueeze_4"
    name: "Slice_11"
    op_type: "Slice"
  }
  node {
    output: "onnx::Slice_5"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_6"
    name: "Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_7"
    name: "Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_0"
    input: "onnx::Slice_6"
    input: "onnx::Slice_7"
    input: "onnx::Slice_5"
    output: "onnx::Unsqueeze_8"
    name: "Slice_15"
    op_type: "Slice"
  }
  node {
    output: "onnx::Unsqueeze_9"
    name: "Constant_16"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_4"
    input: "onnx::Unsqueeze_9"
    output: "onnx::Concat_10"
    name: "Unsqueeze_17"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Unsqueeze_11"
    name: "Constant_18"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_8"
    input: "onnx::Unsqueeze_11"
    output: "onnx::Concat_12"
    name: "Unsqueeze_19"
    op_type: "Unsqueeze"
  }
  node {
    input: "onnx::Concat_10"
    input: "onnx::Concat_12"
    output: "13"
    name: "Concat_20"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  name: "main_graph"
  input {
    name: "onnx::Slice_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "13"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
