ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "0"
    output: "1"
    name: "NonZero_0"
    op_type: "NonZero"
  }
  node {
    input: "1"
    output: "2"
    name: "Transpose_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
