ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::ConvTranspose_0"
    input: "weight"
    output: "2"
    name: "ConvTranspose_0"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch_jit"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "\247\2459\276t\251\032\275\030O\275\275,?R\275#\027.\276\322)\236=Q\2470\276\240\353H\274\322\001\211=\272\332\204\275\336\243\337=@\330\306<n\250\330=~\341\374=\254\375\255\275\n=\217=\024\206\252\275\364\027w=\262\356\315\275\342P\266=(\225\037=<>\232\275\250R\301\275\024\362K=\241\3367>f%\275=\010=\230\274\340\013\031\274\002\006\340=\341\366\010\276\332\007\203=^\231\202\275b\n\344=\331\230\214\275\300\351\033<\316\027\205=yn\007>\020\272\347\274\311\3103>\270\272&\276x\234\014\275(\203D\276\370\231\202<p\262_=\265\214\237\275\322\261\243=\270\222\377\274\036@+\276\331K\027>\312\002\363=rG\307=\3031\035>\256\356\220=\"\217\321=\311\210#>\350\322\036\275\364\261\031\276}\325\301\275pt\322\274\360=\255\274\000\366\252\272\212\336\341=,\337|=\014\266\021\276`\315l\275\010q9\275\252\340\357=\'\374\216\275\263\346\244\275\200z\375\274\264\203H\275\020\026B\275\000\322@\276\375\225/>\362\304\321=/\200\272\275\\\352\365\275\340c\333;\302\221\340=\277l\r\276\250\333\224\275"
  }
  input {
    name: "onnx::ConvTranspose_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
