ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    input: "target"
    input: "weight"
    output: "3"
    name: "SoftmaxCrossEntropyLoss_0"
    op_type: "SoftmaxCrossEntropyLoss"
    attribute {
      name: "ignore_index"
      i: -100
      type: INT
    }
    attribute {
      name: "reduction"
      s: "mean"
      type: STRING
    }
  }
  name: "main_graph"
  initializer {
    dims: 5
    data_type: 1
    name: "weight"
    raw_data: "\334\204b?x\017\034\277C\300T?\246\205\346\275\227W\315\275"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "target"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 12
}
