ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::NonZero_0"
    output: "onnx::Transpose_1"
    name: "NonZero_0"
    op_type: "NonZero"
  }
  node {
    input: "onnx::Transpose_1"
    output: "2"
    name: "Transpose_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  name: "main_graph"
  input {
    name: "onnx::NonZero_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "Transpose2_dim_0"
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
