ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "x"
    output: "onnx::Gather_1"
    name: "Shape_7"
    op_type: "Shape"
  }
  node {
    output: "onnx::Gather_2"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Gather_1"
    input: "onnx::Gather_2"
    output: "onnx::Unsqueeze_3"
    name: "Gather_9"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Unsqueeze_7"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_3"
    input: "onnx::Unsqueeze_7"
    output: "onnx::Concat_8"
    name: "Unsqueeze_11"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Concat_25"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Concat_26"
    name: "Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Concat_27"
    name: "Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Concat_8"
    input: "onnx::Concat_25"
    input: "onnx::Concat_26"
    input: "onnx::Concat_27"
    output: "onnx::Reshape_15"
    name: "Concat_15"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "x"
    input: "onnx::Reshape_15"
    output: "onnx::Transpose_16"
    name: "Reshape_16"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Transpose_16"
    output: "x.1"
    name: "Transpose_17"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "x.1"
    output: "onnx::Reshape_18"
    name: "Softmax_18"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    output: "onnx::Unsqueeze_19"
    name: "Constant_19"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_3"
    input: "onnx::Unsqueeze_19"
    output: "onnx::Concat_20"
    name: "Unsqueeze_20"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Concat_28"
    name: "Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Concat_20"
    input: "onnx::Concat_28"
    output: "onnx::Reshape_23"
    name: "Concat_22"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Reshape_18"
    input: "onnx::Reshape_23"
    output: "24"
    name: "Reshape_23"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  name: "main_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "x_dim_0"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "24"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "x_dim_0"
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
