ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "1"
    name: "RandomNormal_0"
    op_type: "RandomNormal"
    attribute {
      name: "shape"
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      type: INTS
    }
  }
  node {
    input: "1"
    input: "0"
    output: "2"
    name: "Add_1"
    op_type: "Add"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
