ir_version: 4
producer_name: "pytorch"
producer_version: "1.2"
graph {
  node {
    output: "1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    output: "2"
    op_type: "Shape"
  }
  node {
    input: "2"
    input: "1"
    output: "3"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "3"
    output: "4"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    output: "5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 11
        raw_data: "\000\000\000\000\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "4"
    input: "5"
    output: "6"
    op_type: "Mul"
  }
  node {
    input: "6"
    output: "7"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "7"
    output: "8"
    op_type: "Floor"
  }
  node {
    output: "9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    output: "10"
    op_type: "Shape"
  }
  node {
    input: "10"
    input: "9"
    output: "11"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "11"
    output: "12"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    output: "13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 11
        raw_data: "\000\000\000\000\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "12"
    input: "13"
    output: "14"
    op_type: "Mul"
  }
  node {
    input: "14"
    output: "15"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "15"
    output: "16"
    op_type: "Floor"
  }
  node {
    input: "8"
    output: "17"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "16"
    output: "18"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "17"
    input: "18"
    output: "19"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "20"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "19"
    output: "21"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "input"
    output: "22"
    op_type: "Shape"
  }
  node {
    input: "22"
    output: "23"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 4
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "23"
    output: "24"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "21"
    input: "24"
    output: "25"
    op_type: "Div"
  }
  node {
    input: "20"
    input: "25"
    output: "26"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "input"
    input: "26"
    output: "27"
    op_type: "Upsample"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
  }
  name: "torch-jit-export"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "27"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
