ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "0"
    output: "1"
    op_type: "Mul"
  }
  node {
    input: "1"
    output: "2"
    op_type: "ReduceMean"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    output: "3"
    op_type: "ReduceMean"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "3"
    input: "3"
    output: "4"
    op_type: "Mul"
  }
  node {
    input: "2"
    input: "4"
    output: "5"
    op_type: "Sub"
  }
  node {
    input: "5"
    output: "6"
    op_type: "Abs"
  }
  node {
    input: "6"
    output: "7"
    op_type: "Sqrt"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "7"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 9
}
