ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Slice_0"
    output: "onnx::Unsqueeze_1"
    name: "Slice_0"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 2
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "onnx::Slice_0"
    output: "onnx::Unsqueeze_2"
    name: "Slice_1"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 4
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "onnx::Unsqueeze_1"
    output: "onnx::Concat_3"
    name: "Unsqueeze_2"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "onnx::Unsqueeze_2"
    output: "onnx::Concat_4"
    name: "Unsqueeze_3"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "onnx::Concat_3"
    input: "onnx::Concat_4"
    output: "5"
    name: "Concat_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  name: "torch_jit"
  input {
    name: "onnx::Slice_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
