ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    input: "weight"
    input: "bias"
    input: "running_mean"
    input: "running_var"
    output: "6"
    name: "BatchNormalization_0"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.9
      type: FLOAT
    }
    attribute {
      name: "training_mode"
      i: 0
      type: INT
    }
  }
  name: "torch_jit"
  initializer {
    dims: 2
    data_type: 1
    name: "weight"
    raw_data: "\000\000\200?\000\000\200?"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "bias"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "running_mean"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: 1
    name: "running_var"
    raw_data: "\000\000\200?\000\000\200?"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
