ir_version: 4
producer_name: "pytorch"
producer_version: "1.2"
graph {
  node {
    output: "3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "x"
    input: "3"
    output: "4"
    op_type: "Reshape"
  }
  node {
    output: "5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "4"
    input: "5"
    output: "6"
    op_type: "Tile"
  }
  node {
    output: "7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "y"
    input: "7"
    output: "8"
    op_type: "Reshape"
  }
  node {
    output: "9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "8"
    input: "9"
    output: "10"
    op_type: "Tile"
  }
  node {
    output: "11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "z"
    input: "11"
    output: "12"
    op_type: "Reshape"
  }
  node {
    output: "13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "12"
    input: "13"
    output: "14"
    op_type: "Tile"
  }
  name: "torch-jit-export"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "z"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "14"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
