ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "2"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "3"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "0"
    output: "4"
    name: "Shape_2"
    op_type: "Shape"
  }
  node {
    input: "4"
    input: "3"
    output: "5"
    name: "Gather_3"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "1"
    input: "5"
    input: "2"
    output: "6"
    name: "OneHot_4"
    op_type: "OneHot"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "6"
    output: "7"
    name: "Cast_5"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "0"
    output: "8"
    name: "Unsqueeze_6"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "8"
    input: "7"
    output: "9"
    name: "Mul_7"
    op_type: "Mul"
  }
  node {
    input: "9"
    output: "10"
    name: "ReduceSum_8"
    op_type: "ReduceSum"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
