ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::And_0"
    input: "onnx::And_1"
    output: "2"
    name: "And_0"
    op_type: "And"
  }
  name: "main_graph"
  input {
    name: "onnx::And_0"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::And_1"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
