ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Floor_18"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\300A"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Floor_18"
    output: "onnx::Cast_7"
    name: "Floor_1"
    op_type: "Floor"
  }
  node {
    input: "onnx::Cast_7"
    output: "onnx::Unsqueeze_8"
    name: "Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "onnx::Concat_19"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Unsqueeze_11"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_8"
    input: "onnx::Unsqueeze_11"
    output: "onnx::Concat_12"
    name: "Unsqueeze_5"
    op_type: "Unsqueeze"
  }
  node {
    input: "onnx::Concat_19"
    input: "onnx::Concat_12"
    output: "onnx::Reshape_13"
    name: "Concat_6"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Reshape_0"
    input: "onnx::Reshape_13"
    output: "14"
    name: "Reshape_7"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  name: "torch_jit"
  input {
    name: "onnx::Reshape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "14"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "Reshape14_dim_0"
          }
          dim {
            dim_param: "Reshape14_dim_1"
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
