ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::ConstantOfShape_11"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::ConstantOfShape_11"
    output: "onnx::Mul_3"
    name: "ConstantOfShape_5"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Mul_4"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_3"
    input: "onnx::Mul_4"
    output: "onnx::Equal_5"
    name: "Mul_7"
    op_type: "Mul"
  }
  node {
    output: "onnx::Equal_6"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Equal_6"
    input: "onnx::Equal_5"
    output: "onnx::Where_7"
    name: "Equal_9"
    op_type: "Equal"
  }
  node {
    output: "onnx::Where_8"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Where_7"
    input: "onnx::Mul_3"
    input: "onnx::Where_8"
    output: "onnx::Expand_9"
    name: "Where_11"
    op_type: "Where"
  }
  node {
    input: "onnx::Expand_0"
    input: "onnx::Expand_9"
    output: "10"
    name: "Expand_12"
    op_type: "Expand"
  }
  name: "main_graph"
  input {
    name: "onnx::Expand_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
