ir_version: 4
producer_name: "pytorch"
producer_version: "1.2"
graph {
  node {
    input: "1"
    output: "2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "0"
    input: "2"
    output: "3"
    op_type: "Div"
  }
  node {
    input: "3"
    output: "4"
    op_type: "Floor"
  }
  node {
    input: "4"
    input: "2"
    output: "5"
    op_type: "Mul"
  }
  node {
    input: "0"
    input: "5"
    output: "6"
    op_type: "Sub"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
