ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    output: "onnx::PRelu_1"
    name: "RandomUniformLike_0"
    op_type: "RandomUniformLike"
    attribute {
      name: "high"
      f: 0.333333343
      type: FLOAT
    }
    attribute {
      name: "low"
      f: 0.125
      type: FLOAT
    }
  }
  node {
    input: "input"
    input: "onnx::PRelu_1"
    output: "2"
    name: "PRelu_1"
    op_type: "PRelu"
  }
  name: "torch_jit"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
