ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "_caffe2::GenerateProposals_0"
    input: "_caffe2::GenerateProposals_1"
    input: "_caffe2::GenerateProposals_2"
    input: "_caffe2::GenerateProposals_3"
    output: "4"
    output: "5"
    name: "GenerateProposals_0"
    op_type: "GenerateProposals"
    attribute {
      name: "spatial_scale"
      f: 2
      type: FLOAT
    }
    attribute {
      name: "pre_nms_topN"
      i: 6000
      type: INT
    }
    attribute {
      name: "post_nms_topN"
      i: 300
      type: INT
    }
    attribute {
      name: "nms_thresh"
      f: 0.7
      type: FLOAT
    }
    attribute {
      name: "min_size"
      f: 16
      type: FLOAT
    }
    attribute {
      name: "angle_bound_on"
      i: 1
      type: INT
    }
    attribute {
      name: "angle_bound_lo"
      i: -90
      type: INT
    }
    attribute {
      name: "angle_bound_hi"
      i: 90
      type: INT
    }
    attribute {
      name: "clip_angle_thresh"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "legacy_plus_one"
      i: 1
      type: INT
    }
    domain: "org.pytorch._caffe2"
  }
  name: "main_graph"
  input {
    name: "_caffe2::GenerateProposals_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "_caffe2::GenerateProposals_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "_caffe2::GenerateProposals_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "_caffe2::GenerateProposals_3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "GenerateProposals4_dim_0"
          }
          dim {
            dim_param: "GenerateProposals4_dim_1"
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "GenerateProposals5_dim_0"
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
opset_import {
  domain: "org.pytorch._caffe2"
  version: 0
}
