ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    output: "onnx::Softmax_1"
    name: "Transpose_0"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    input: "onnx::Softmax_1"
    output: "onnx::Transpose_2"
    name: "Softmax_1"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "onnx::Transpose_2"
    output: "3"
    name: "Transpose_2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  name: "main_graph"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "input_dim_1"
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "input_dim_1"
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}
