ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Add_0"
    input: "params.0"
    output: "onnx::Mul_2"
    name: "Add_0"
    op_type: "Add"
  }
  node {
    input: "onnx::Add_0"
    input: "onnx::Mul_2"
    output: "onnx::Tanh_3"
    name: "Mul_1"
    op_type: "Mul"
  }
  node {
    input: "onnx::Tanh_3"
    output: "onnx::Sigmoid_4"
    name: "Tanh_2"
    op_type: "Tanh"
  }
  node {
    input: "onnx::Sigmoid_4"
    output: "onnx::Neg_5"
    name: "Sigmoid_3"
    op_type: "Sigmoid"
  }
  node {
    input: "onnx::Neg_5"
    output: "6"
    name: "Neg_4"
    op_type: "Neg"
  }
  name: "main_graph"
  initializer {
    dims: 2
    dims: 2
    data_type: 1
    name: "params.0"
    raw_data: "\000\000\200?\000\000\000@\000\000@@\000\000\200@"
  }
  input {
    name: "onnx::Add_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
