ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::MaxPool_0"
    output: "1"
    output: "onnx::Sub_2"
    name: "MaxPool_3"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "onnx::MaxPool_0"
    output: "3"
    output: "onnx::Slice_4"
    name: "MaxPool_4"
    op_type: "MaxPool"
    attribute {
      name: "dilations"
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      type: INTS
    }
  }
  node {
    output: "onnx::Slice_5"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_6"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_7"
    name: "Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_4"
    input: "onnx::Slice_6"
    input: "onnx::Slice_5"
    input: "onnx::Slice_7"
    output: "onnx::Sub_8"
    name: "Slice_8"
    op_type: "Slice"
  }
  node {
    input: "onnx::Sub_2"
    input: "onnx::Sub_8"
    output: "9"
    name: "Sub_9"
    op_type: "Sub"
  }
  name: "main_graph"
  input {
    name: "onnx::MaxPool_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  output {
    name: "9"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
