ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Abs_0"
    output: "onnx::Pow_1"
    name: "Abs_0"
    op_type: "Abs"
  }
  node {
    output: "onnx::Pow_2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Pow_1"
    input: "onnx::Pow_2"
    output: "onnx::ReduceSum_3"
    name: "Pow_2"
    op_type: "Pow"
  }
  node {
    output: "onnx::ReduceSum_4"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::ReduceSum_3"
    input: "onnx::ReduceSum_4"
    output: "onnx::Pow_5"
    name: "ReduceSum_4"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
    attribute {
      name: "noop_with_empty_axes"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Pow_10"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Pow_5"
    input: "onnx::Pow_10"
    output: "9"
    name: "Pow_6"
    op_type: "Pow"
  }
  name: "main_graph"
  input {
    name: "onnx::Abs_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "9"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
