ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Shape_0"
    output: "onnx::Slice_1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "onnx::Slice_2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_3"
    name: "Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_4"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_1"
    input: "onnx::Slice_3"
    input: "onnx::Slice_4"
    input: "onnx::Slice_2"
    output: "onnx::Concat_5"
    name: "Slice_4"
    op_type: "Slice"
  }
  node {
    output: "onnx::Concat_6"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Concat_5"
    input: "onnx::Concat_6"
    output: "onnx::Reshape_7"
    name: "Concat_6"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Shape_0"
    input: "onnx::Reshape_7"
    output: "8"
    name: "Reshape_7"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  name: "main_graph"
  input {
    name: "onnx::Shape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "8"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
