ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Reshape_0"
    input: "onnx::Reshape_11"
    output: "8"
    name: "Reshape_0"
    op_type: "Reshape"
  }
  name: "torch_jit"
  initializer {
    dims: 2
    data_type: 7
    name: "onnx::Reshape_11"
    raw_data: "\001\000\000\000\000\000\000\000\030\000\000\000\000\000\000\000"
  }
  input {
    name: "onnx::Reshape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "8"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
