ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Pow_4"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Pow_4"
    input: "onnx::Pow_11"
    output: "onnx::Cast_5"
    name: "Pow_1"
    op_type: "Pow"
  }
  node {
    input: "onnx::Cast_5"
    output: "onnx::Div_6"
    name: "Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "onnx::Div_0"
    input: "onnx::Div_6"
    output: "7"
    name: "Div_3"
    op_type: "Div"
  }
  node {
    input: "onnx::BitShift_1"
    input: "onnx::BitShift_12"
    output: "10"
    name: "BitShift_4"
    op_type: "BitShift"
    attribute {
      name: "direction"
      s: "RIGHT"
      type: STRING
    }
  }
  name: "torch_jit"
  initializer {
    data_type: 1
    name: "onnx::Pow_11"
    raw_data: "\000\000\200?"
  }
  initializer {
    data_type: 2
    name: "onnx::BitShift_12"
    raw_data: "\002"
  }
  input {
    name: "onnx::Div_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "onnx::BitShift_1"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "7"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
