ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "1"
    raw_data: "/\331\026>\240\030\261;d\022?=\336i\275=\314\363(\276YE9\276\232\366\311=@z;;\251\225\220\275\000\350\205\272B\306\255\2752\235\355=\332~\304=R\347\237=\340!L\275\276\276\247=dl\322\275\002 \244=\026\307\344\275E\237\'>\353&\004>>q\333=\301}#>H\235\372\274M\351%\276\020t\017\276 \273)\276\343\013B\276==\230\275\246\326\267\275\374f\177=\263\236?>\302\315\243=>%\002\276\200L\354\272\216\225\266\275\246\224\321=\246\030\261\275\217?C>`\3510=\327d\002>\037p\024>Ppa<\256J\323=.\265\356=\370\022G\275\000\237;<\372\271\311=i\031*>`<\271<!\206\336\275\220]@\276 \207\306;\340\216\342;\316\376)\276x\352$\275\340\'U\274\\\262C\276\260\316\211\274\337v\004>\311#\034>q\221\001\276\251\235=>\225\347\020>f\344\234=\207\365;\2761\252\032>\340&\300\274{G/>\342H\225\275\324\010\363\275\252\232\302=pi~\275\270\325\325<\243\220\226\275x,\376\275\2700h\275\320K#<\314\341\022\276\210Qp\275\220Yd<"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
