ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    input: "x"
    input: "y"
    output: "2"
    op_type: "Greater"
  }
  node {
    input: "2"
    output: "3"
    op_type: "Not"
  }
  name: "torch-jit-export"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "y"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
