ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    output: "3"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 1e-09
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 10
    data_type: FLOAT
    name: "1"
    raw_data: "\340e\355<\246\305\315>L\n\205>j\270\273>\300\314n=t]3?\200)T=\362\257\357>\217~,?b\265\251>"
  }
  initializer {
    dims: 10
    data_type: FLOAT
    name: "2"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
