ir_version: 4
producer_name: "pytorch"
producer_version: "1.2"
graph {
  node {
    input: "0"
    input: "0"
    output: "1"
    op_type: "Mul"
  }
  node {
    input: "1"
    output: "2"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "0"
    output: "3"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "3"
    input: "3"
    output: "4"
    op_type: "Mul"
  }
  node {
    input: "2"
    input: "4"
    output: "5"
    op_type: "Sub"
  }
  node {
    input: "5"
    output: "6"
    op_type: "Abs"
  }
  node {
    output: "7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\300@"
      }
      type: TENSOR
    }
  }
  node {
    input: "6"
    input: "7"
    output: "8"
    op_type: "Mul"
  }
  node {
    output: "9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\240@"
      }
      type: TENSOR
    }
  }
  node {
    input: "8"
    input: "9"
    output: "10"
    op_type: "Div"
  }
  node {
    input: "10"
    output: "11"
    op_type: "Sqrt"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "11"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
