ir_version: 6
producer_name: "pytorch"
producer_version: "1.9"
graph {
  node {
    input: "input"
    input: "6"
    output: "4"
    name: "MatMul_0"
    op_type: "MatMul"
  }
  node {
    input: "4"
    input: "bias"
    output: "5"
    name: "Add_1"
    op_type: "Add"
  }
  name: "torch-jit-export"
  initializer {
    dims: 5
    data_type: 1
    name: "bias"
    raw_data: "\324BO\276@\245T>\350\377\245\275\374u\336\276&\212\304>"
  }
  initializer {
    dims: 4
    dims: 5
    data_type: 1
    name: "6"
    raw_data: "\212\332\356>\354\201\221>\340\035\224>D\356\257>\310\250\266\275@\265u>\004\354\261\276\024\2446\276\320\202\226\275\352F\377\276p\303E\275\2746*>\200\211\312<\364\213\351>\000\250)= \320\306\2748\247)\276\224\344,>z\226\330\276\244K\021>"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "5"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
