ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: FLOAT
    name: "1"
    raw_data: "\016w\371=\314\215g=\0007g\275\324d\323\275p\203\205\274@\221W<a\023\020>\270\340J=\230\244==\014\371H\275\002\225\263\275J\'\032\2766\370\321\275\312\356\375\275\247\320\013>\252\243\377=\213\220\030>9\206\313\275\022p\350=\267D\032>\010H\024=(\327U\275\300\340\204\274\3466\207=\203\205\021>\247G\345\275\252w6\276\220F!\274\236\212\250\275\306\206\343=vc\363=}$\242\275\222\232\352=X7\t\276\311\023B>\220T\300\274\215/\341\275\256\215\204\275\024}\016\276x\262\236<\0167\273=@\2164\2737\345%>\260\331\361<Z:\303=\241\250\023>^\202\201\275<\221<\276s\233*>\362\312\274=$P/\276\345m\345\275\030\270{\275F\323\327=g\210\213\275\016*\337=\220&3=\356\340\237=\240\270&\274\3516>>P0\331\274\345\'\013>8\265==y\231D>\330\354\224<&\276\316=\236\023\342=qx\"\276\030\251/\275\250\240\216<\000#\374:>\210\300\275\234\315m=\364\321\020\275PU\014\276\212m\230=\222\034\344==\355?>\304\343z\2758\206\206<\316\226\367\275"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
