ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "1"
    raw_data: "t\365\325\274\324\275\202<\276R\024=\200\345g<\374<\215\275\346@5\275$\263\216<CPy\275F\351\250\275L\256\362\274\260}\221<9\274\243=\326T?=&5/=#)\227=\360;\037=9\372\202=\275\361\220=@\221\274:\002\3157=0.\256\273\226.\261\274\355\342\223=\022\037\031=\247\305\222=#\243o\275Z/H=\270\225*\274~\321P=\312`\003=\n\036\207\2750\366\352\273\332\215,=\200m\244\274\360N\255<v\363!\275\200J3\275\373]\220=\010\236*<\230\315N\274\322\310\005\275 S\353\274\211a\237=\202\244\215\275\314\362\216<\221\177\240=R\024|=\300\337\357\273\014\204-\275\306\322~=@)\221<\364\272\252<\300\n\034=\315\260\224=r&\r\275`\316\250\275\340\033l\273b\002X=*\342#=H\215\205\275 7\302\273\250\323\001<\037\261\202\275\264\264\320\274\226E\374\274r\272b=\017z\215\275\315\024\242\275\276%(\275b)F=\317\'\022\275\200w5\273\300\341\244\275(\271p<\335\353\234\275\272\030\215\275\200\347&\274\246\334\307\274\220H\375\273\232BN=O\236\240\275\224}\204\274\000\021\004=\022\316\226\275(\314\030\274\000\257\035=\2613\203=T\033\335<?\210\236=\371\243\200=r\370\024=\2515,\275u[\240=\230>\021\274H\344e<d\021\312<L\305\374<s);\275\240\335E<\013x\200\275\235\256\242\275\000\213\352\271\002\005\243\275\300K\367\272,R:\275\276-D\275\251(<\275NV\036=\372\3362\275\301\010\251\275\344\266\267<\3418\210=\240\337\324<\342\351\031=\302\374 =\206|o\275\234\377\211\275\304;\310<\247\354(\275\370/l\275xh\306\274\340:\031\274\014\371\244\274\334\205\330<\244\376`\275^\365l=\0260A=\014\254\217<\250\324\241\275\204\202\334<\200\275\220\273\010\353\215\274UY\227\275\032\202-\275,\302\330</Q\225=\322 :=\342X2=P\r\300;\334\241\262<\026\355\017\275\254\025\242<\237\006\243=\016B\021=\036\226n\275\203\277\240=\221#{\2758s[<q4\217=\221\230\230=^\361Z=-\036\235=\342\321I=~6\240\275\260H\251\273v\301\020=p\003\332\273\246\222\020=bb\245\275\3127G=\360\323\211\273\300\360{\275\016\021X=\220\204\340\273\260\313\337\273\256\177\253\274\026\310\025=\330\021,\274\373\020\227\275(!i<$r\210\274\020\237\354\273#\027\237\275\306Y\t\275\242\366g=\023\233\010\275\260\341\366<\310|N<\035\006\236=\216\353L\275\324t\253\274\341\264\206=@iC<\r\177\203=\216\263+=G\263\205=\360\237\242;\343A\213\275v&P\275zMU=x\"\211\274M\211;\275\0007\232:8=S<\200\257\244\272\354\233\250<\350\321*\274gW\212\275\312\265B=\240\027y\275\266\223L=\312\2545=\t\370\204=C\345=\275\343\313\025\275\223\270\237=\224U\242\275\240\277\244\275p3Q\274\2506\014<0\332\215\274\307\367B\275`\204e\273D,\265<f\224d=S\237\242=\272\304&=\214G\223\2758\274K\274\265\335\207\275\\\275K\275\200\213\373<\252\\\005=G+Z\275\367fe\275\220-\242\273\257\357\242=L\251\300\274T\377\n\275t1d\275\016\356A=(\261<<\006\306\236\275(\205*<E^\252=t\360\247<\375\357\245=z3(=\256\244`\275\352\220`=\223\300\240\275\230\032\022\2750r\224;\225\233S\275G\225\210=\336\202A=\355G\244=\231\000\204\275\340\272\033\275F\273\330\274\332S\013=\271\226\243\275\224\275\250\274\374\260\247\275\261\276,\275\035\230\251=Si\210\275r\007u=\026\346>=\347,S\275\345\305\245\275\241v8\275 \000m\274\365\034\223=\262\237]=\000\377\304\272\220\346\022\275HG\231\275\000X|\275P\345X\274\240\211(=\370\271!\274\207M\217=\n\200<=e9\235\275|\321\022\275\3017\240=\301M\252=\351{\231=\254\344\251\275.\214I=J\320&=\232\261\"=\000vt;h#\026\274\0240\355<\2443\327<V\251\313\274\324\030\322<\274=\247<o 4\275\270O <\313\241\037\275~\275\352\274J\337\225\275\020\355\317\274P\267\200\273e\216\242=\177\023\221\275\264U\205<\320\237:\274Q{\202\275\300L\031\275xH\210\275\342\362n=\342%}=ND\360\274\313\310\250\275\006\035\234\275\032\272y=r\025I\275 .f\273\310\017)=\266\034\222\275~\304\030\275k\240\t\275\004]\232\274\330\214N\274\210L\242\275\3342S\275\244\234\272<\362)I=;#\215=\360\361\225;\035\331:\275\300s\365\272\313\354\006\275`\300*\2736;s=\270p0<\316G\232\275\34080;\341\020\215=M\037\245=\000\304\3108 \274\244\275\264\213\212\275]\264\221= \363n\274\200Y\206<\013\005\224=`<n<\234\226\212<\0107Y\274\370\275\216\275\000\2115;\314\337\226<\000w\231\271\310\"*\274#\226\214=\365\302\207\275\204\223&\275Y\317p\275\357,\247\275]O/\275\233\255{\275\256p.\2750\342)\275(X/\274\3165\006=\374\013m\275]\3638\275\231\032\214\275\342yv=f\332X=\331\345\215=D\352\221\274&\315~=\260\245\224\273\326\265\031\275\212\367F=\240WC\273:\203u=\0300\007<N\373S=p\274\321<X\271s\274G\226\234={G\231\275\376\356\250\275\n\235I\275\350\034\251\274\317\350K\275H<}\275\006E\002\275H\353=\274\370\365O\275\030\374\035\274\213\370\025\275b\367W=\356bz\275\\\316\203\274$\211\276\274h\007W<Bv-=\262\016u=\374/\350<\220\274\227\273b\374u=>\246\032=8\244Q\274\313\333u\2752\201S=\235\024\224=\271\2064\275\342\005^=F\312+\275\000k\2019\014S\225\274\023l\010\275p5\030=h\331\312\274fB\220\275F\373:\275\036*{=\333\027\230=\232\233Z=`\304X\273\223d\232=\030\235\036<h\205\267\274@\257\267\274\000!\211:\364\361\211<\234%\033\275/B\227\275\346\214\007=\241\307\227\275\300\203j\273H\221Q\274\377lm\275B\320\232\275\360\362\356;\340\307\336<~\244\312\274\330$@\274(\214$\274^j\035=\232Rc\275#+\232=M{\252=2y\"\275\222\237\210\275Y\013z\275\266W\006=t\326\245<hk\004<\026W\340\274P\231\212\2746M\344\274\"\234c\275||\344\274\274\241\341<\010\001K\274\260\363\265\273\260s\234<\320\010\027\275\322\r@=Q\327\225=\270\215\224\275\322\361\006=\254)\370<\206\302Y=\270p\022\274{\347\232\275\320\004\245<\264)\314<\224Z\266<5\367\234=zd\010=\304X\274<\300\326\210\275\344a\255<\340\344\035\274@T\003= o\212<\374\351\306\274u\225\234\275_/\226\275\245?\220=[\345\221\275n\304Y=\366\354L=\346\021`\275\036)0=\2306\215\275[\246\222=\226so\275x\371\207\274\240} ;\250(;<\304\363\245<\332?\000=\364n\230\274\304\202\223\2744\214\224<\215\326J\275dQ\200\2741\014\227=\225\240\230=\217\253\005\275\244\211\317\274\210\004C\275\330\220\210\275\001\215\237=\240Y\252\274\004\313\333<\034e\225\275\210\360a\275\024P\236<\352\276[=\020br\274\254V\346\274@+\034<\220\202\003=$h\257\274\244S\250\274\006\371r\275\244l\374<\236\265\n=\200kQ\272TQ\366<74\217=\236\031s=@)^\273\302$\231\275\342\240\177=\004\022\217<~\331\024=|\221\243\275\206\034\246\275\010,X\274/~\243=X\364\222\275\204\355\323<\326;]\275i|\236=\300\261\244\272\365\203\215=\200\014\322;w\236\225=W\007\230\275|\230\302<\346\264:=\236\370$=\353\216\r\275\334\022\272<\234\026\202<\227\316\215\275i\314\227=p/\364\273T\225\204\275\213S\207\275\373\266\203=\341D\212\275\246\022>\275@:\200:uf\210=Y\271t\275\346\224\341\274<\212.\275t\250\226\275(\376/<\200o\n=\346\215\207\275P\203\225\273F.\031=\313\376\221=&\252]=\371\261`\275\3105\024=\244\250\201\274\200Pj\273Hs?<+;\247\275\220 \222\273\200{=\273?\242\003\275\323^;\275\3261-=\366\216\244\275]`p\275\240\177\300\273.T\037=\266\312\t\275\n\2574=#Rd\275b\277\036=#\021\233=cf^\275\224\023\222<r\203=\275n\247\346\274\216\347Q=\202\226}=\336\300\036=\231\332\245=\024\233\227<\252q/=\300\374\335\272J\220\232\275E\353m\275\340\304\374<$\"\031\275\014\241\217\275\302\277I=Y\022\244=\000\310P<\340\313\\\275\202\273n=\230\365A\274\240\340\n<y\241>\275=j\244=\000\275\312\273.RN=\215\225\246\275s\374\025\275\325w_\275\360\203\301\274@\241^\274R\373w=\262z0=\356>H=R\275&=\203\214\014\275hV\210\275\n\305*=\010!T\274\034H\261<\300G9<\360\271\033=\312\2054=\202\000/=\342I;\275\364<\330<\212t\004=\032&D=\240Sw\273!\236\237=\331d\242=\277\310\247=0\306D\275\215M\201=\205\377N\275:\300)=\036\310\247\275\\\342o\275\253)\233=\260\014\365\273\\\273\232<\270\330}\274P\215\276;\314\341\312<\331\305\\\275\245Na\275K}#\275\000\021\237;\200o\324;l\357\236\275`\005S\2730o\023=\263!\235\275\342\026 =\233\301\233=\002\246\'\275>\225t=d\354\300\274x\206@\274\230?z\274\373Av\275I\370\237=\374\373\365<f\035;=\362\006i=\335\200\240=R=^\275\260\020\002=\002bD=\230\267_\274\214!\363<*$&=\024I\365<G\2448\275\005\365\245\275\350\007\253\274\340\203h\275\256\371T=P\033\341\273\374*I\275\254%:\275\031\261\245\275v/k\275\330\277\037\275\036X\212\275\312H+\275(\241\231\274\340\246\347\274\000o\303<\232[k=CA\024\275p\247\257<\n,l=\202}|\275\355#\222=\000\022\257<8UL<\255\t\201=\305\030\205=\374,=\275\024X\337<\260A\215<bS\242\275D\234\326<\340\014\305\274\205\373\210=f;==@\275k<\273\314%\275\361,\251=\342\261\030=\305J\220=\3665p=\264N\251<Tb:\275\r\276\240\275\264\014\250\275\304q\235\274+\214\014\275\240\277\260\273\340\270h\273&\351w\275@\224\215\272\0004L<\010:\206\275M\330\234=0\350\222<Pe\330;\026r\007=`^H<\336C$=\300O\342\272\267\304\231\275\310\t\006<8\346\356\274\260\3762\275\252B#=\203\r\017\275\257\312\233\275\370\357[\274\367\325\035\275\2026C\275A9[\275\217\'\234\275\342\365W\275\244\034\014\275v\325\346\274\301I+\275\266\245]=\300\340\324:H\024\217\275qP\242=\320\372\342<\000z\223\272\272\370q\275\177\372\203\275H\377!=$\250\204\274\007\271\222=\261\361\202=B.P=I\002\220=T#\356<HM\001\274\200J\266<\237<p\275\265\325\242=\332\336l=^fh\275\024L\277<\214T\226<\234\331\270<\220\"\261\273\366\036\n=l\327\273<p,\265<2\245k=\240\270<<`q\216\274\345\205N\275\207\304\224=m%\211\275\220\033\260<0\0203\274\242!K=`\311\017\275\210s><\363\363\201=*\256P\275 9\007;ZuI=B\014\207\275\200\214W:&\233F=p\007=\275\226JQ=P\266\266;mx\231=\270\324\004\275\324\326\260\274\3420R=D\222^\275*7#\275\353\224\200\275\000k\355;\344\013\201<\246\217\230\275\255\335\216\275\220\346\204<f\017\241\275\302m5=\214\332\365\274\322U3=\030eI<\276\n\024=\\\014\365<\350(5\275\251\323\227=\002\233J\275\375=\226=\000\331\353:\325\220\216=`%\206\275B\3741=\345\275\234=\000$B\275\330RQ\274\236YW\275\300\244\250<\"\337\243\275\244:I\275\220\n\002\274J\247\016\275\236\332\234\275\272\004l=\326\360^\275v\006z=^\220\201\275(5\255\274@\302\214<z\010\230\275y\204\235=w\213\240\275\272\310\022\275E\336\232=\374t\300<\253\263\206=k_\222=`\027\356<(\026\177<\300\260\326\274\006\317\037=\234;\237\275\034\365\242\274\330K?<B\332R\275\000\210\t:\\)\211\274\240L\331<p\214\327\273\204\354\246<F\233\235\275\000\340\002=\243\247\226\275Z\351@=\317H\013\275\310\026p\275v`E=\220_\327;\256!\004=\226\246\201\27580w\274\324\222\237\274\010\375\030=\350\254\217\274<\370\204<&\375\302\274\000\251\267\271\277t\237\275\240\363\200<\000\215\020\275\0239\026\275Q\336\227=\210A]<\010\356><y\250\204=\272\204y=N\004Q=\000S\035<6\306\206\275\341\367\222=\325j\244=0\006\352<\000e\\\272\230s\017\274\004k\311<\303\033:\275\322\247O\275\222y\037=\327\213\213=U\210\251=B\331\233\275Xik<<*/\275\274\026\263\274\230\226#\275\372\210L=\274\346\303<@T\261;Zp\030=\200\023\t<\032\251\241\275V\246h=\320\275\020=\340\256\023\274\357\221B\275J\311G=\303\321\245=\304:k\275;\254\013\275N\375\034=\265g\243=M\000\233=\362\001Y= \275<\273\016V*=\340\275M<\332\267o=\005r\216=\320\335\326<D\357\004\275\266+m=,K\253\274Fx\003=\256}\264\274nHB=\356\036?\275\326\370.\275q\244O\275p\223\251<x\014\t\274\210}n<\2151\216=\234\255\230<X\255&<\360\264\245\274\202\337\234\275\332@\231\275\321\332\222\275\303\024G\275\230\277]<Z\200U=\362Z[=a\323\246=\240\206\026<\000\016\010\271j\330Z=\336\031\201\2753\350\201=\364\261\261\274p\3655\274P\215\227<\0300*\274\206\335\035=\025c\234\275\340@<<j\2452=\200)~;\342\003e=\270`@<\323\250w\275\320\320\271<X=R\274\266T6=\002\025z\275\342U\023\275\314\225\233\274P\226\311<iO\246=\000j\302<)\204\232=\275\352\211\275\370\201\360\2745\240\214=Xs\217\275\272\214]=@^\340\273\241\227\213=\271\n\217=\335\244\234=j\r\251\275\314*\234\274\350\242t\274Z\177X=\354kf\275\'x\223=\315\226\240\275\362\tD=\321\035\226\275\356\016!=\317=\252=\357^\245=\241\267\222=wx\211\275\246\236\373\274\374W\277\274|g=\275wh\232=\211r\250=\002\3268= \203W\274\304g\211<h\220\017\274\212\215(\275NBN\275x\233v\274\272\0357=\360\025@\275\200\341W;\251jP\275\362\3762=\021\302O\275\312\200.=|80\275H\231(=\\\242\247\274\350\356!=\221i\232=\324\244\221\274XFn\274,\305\301<\272\r/\275\036:~=\202+|\275R\272S=\\\270\026\275p\324\212<\220\377\372\273::@=&\341T=g\325\247\275\350\245\035=\215\242\224=fd\307\274\000\033x<\374\200\343\274\272\364\246\275\035a\245=\200\370\001<\334\004\270\274\2378O\275\230\026P\274N\365\331\274:fS=\326\'\020\275\000\221\010;\250&\252\2740K\356\273\240\251\020<\n\254\020=\364\331\367<j\001~=\023\247\205\275\217\371\243={\020\246=\214\rj\275\2736\234=\232\356\022=\324\350Y\275\372\304/=ln\211\275\261\247\220=\010,\035<c\t\035\275\332\213\232\275\312\346$=\016\352\'=\004%\035\275\322nO=\340zP<\314\265\244\274\331=\250=\3103*<\372t\206\275\352JC=\210`*<r\250H=\346\335\035\275\356-?\275 \345\004=M\216\214\2752\257L=G\377\221=g\221\227=\246{{=\206yn=\324\312?\2754\010\223\275\210\353\036< \223W\274\224v\225<\350\345\004\275\330\221\000\275\030./\275~\2321\275\200\005_\273\036C&=\316\334\013=;P\223=\000\323\035\274Q\017p\275\223jA\275 \376f\273p\357\203\273p\222\035=\373\277\004\275zX^\275\"\233u=\220BD\275X*M\274\314,\337<\370/\\\274\365\222\202=\224\320U\275V\2753\275\346\246M=\211\206\221=\372\372s=l\334\334<\272\220\177=\322\r!=\250\034u<:\0335=8\3128\275p\370\357<\215\323\236=\\/\277<Jj:=\024m\202<\2176%\275\210\037]\274\216\227I=\000\310]:t \210<T\342\223\274RT\025\275A\226\246=4\177\254<p\212\223;\314\204\313\274\301\226\236= \205K<d|\357\274d\231\200\274\034\207\244\274\300t\260;d\237\261<\244G\332\274\3724,=m\243\233=k\236\033\275@\254w<\010\004@\274&N\370\274\210\355C\275\300\n4\275\321\227\250=\245\210\246\275\2202\375<\310\3228\275\321\020\210=D\356\201<,u\277<\360\207\347\274\316\346+=\331/\236=\312\236V=\202\277A=\350\333\034<\332\226*=\034\356\251\275\355S\212\275=s\206=PD\234\273\246J\227\275\210@\\<\020\320\307\274\253\232Z\275\017e\235\275\340\014\205\275\225\231e\275\335E\206=\034\204\235<PO@\274\243\242H\275\216\260#\275@\357\201\275P\270\232;\274~1\275\352\355\242\275\334\360Y\275\230qG<\316\250\n\275j\365e=\241\262\236\275(\235\266\274\374\201\264<\2663\027=pT\321;\350\370I\274\210\212\000=\271\210\212=\340\223}<6\220\272\274D\315\231\274\232n==.\306*\275s\203\225=\200h\277\272\236s\351\274\344\001\245<J\371T=\230\3727\275\214\337\245\275\242\272\177=\260\243\244\273N\t\'\275\000\261\201\271\004\357\340<\310\177\002=`\002\021=a\260j\275b\333\034=\021\241\221=\260\374\355\273u\340\243=\004\225\244\274\335\034x\275Z\317w=\253M\231=4\376\334<\250&\241\275\031\211\241=\332\002|=VQ\247\275\264$\275<l8 \275\215`\244=\267\266\207=\000\274\211\273\200\222,\272\016\\p=X\001\026=Q\035\242\275\002\003(=B\327*=\200`f<\312O\001=\200~\231\275\252\215\037=%R\221=\010\004\'<e*\231=\373\206\221\275\376\014\003=w\360\237=\300\367\374;\r\030\213\275\374m\317\274\211\315\232=Zqs\275y\016\223=J}(=\362X\027=G\\\037\275\213\2574\275\220J\210;0\317\212\275?\221B\275E:\252\275\210\250\027\274\235\212\240\275\266\316\215\275\000KM\275\024T\310<\0024F=:\345K=\300\256/\274\014\251\220<\340w.\274\322\224-=\005\316\217=P\365\230\2753\000\232=\034u\307<\'\371\247=\270\254*<\320\240\355\274\276(\304\274-\322\207=\"5\034\275\340\205F\273\215\276Q\275\316\010\005=\205\334\237=\375\031\235\275\300\252\334\273\306\025\\=\300&\316;@\226\242\275|\025J\275G\004\236\275\212\216y=\232\302r=\312z2=\240\3764;\036\003f\275\332!r\275\020D\023\274\222\1777=p1\301<\360\345\374\273\300\n\326\274Q8\220=\314L\354\274\350DY\274\034^\227<\025\264r\275\020v\313<\001!\235=\372|\005=\261h\241=\016\232\010\275v5s=\004\342\272<\346\373\262\274\t\214\206=\020\027\371\2744v\315<\232W4=\260\342\257<\363\364)\275\031z{\275\210\334N<\340d\006\274\242wx=\"z(=\240\271\006=DH\035\275.\311*=\363\210*\275\252\237y=6\336\036=Ih\252\275X\363\033=HQ\234\274\234\211\347<\222\037B=\301\200\221=\340\261)=.=\360\274g\t\234\275\177\214\222=>\260b=\"\205u=\360G\330\274\314\365\216<\230\177\220\274\324\035A\2752q@=@D\220\275\020\001z\275\342\263n=}\030^\2756\036\025=\220Xs\274Z\305t=\024D\201\275V\227?\275\252\250,=\n]k=\340\3250<M(\236=\"lX=\312\240\202\275\360g\207<m\374\211=N\260h\275(\275:\274\202\220R\275p\257\260<\214\317\201\274\356v2=\220\370\303\273\250\227\027\274p\343\212\273TCf\275`\rd\275\300\353\303<\024\276\325<$\344\305\274\347\215\203\275\214k\321<\356\r\013\275\200\332\204;6=\"=\270\177^\274\202)U=\344\227\352<\235\202\203=\260E\346;\271\325\235=\374\245\263\274\300\212\237;\271\270\220=\301\251\220=\352\346g=Z\352\037=-\377\221=\342fW=X\377$\274\243\306\242=\276!V=p`A\275 k\233\275@; \273Z\264~=\356\307<=L\222\365<\274\346\201<\334L\323<\033\202\226\275\020eY\275\304<Q\275/\331\016\275\333\226l\275(\005\245\275\320\221\361\273Eg\205=(\275\'=\356\3551=\235\277_\275x\013\010<\0040\240\274\240\245\222<\320\277\212\2735\025z\275\016\353&=\302H&=\377H!\275\232\254+=\"LK=\210\252%\274p-\232;\330\221}<x\200\234\275\246\325@=Zl\035\275\200\224\265;\024u\235\275\336nD=\362I6=\301\204\213=\205\222\203=\336(x\275B\370i=Xo(=\262\303\030= \232p<\200\263\177\272\323r\242=\2105\005\274z\236\036=\026\330\333\274<\n\350<\264\005\025\275\022\360\021=\371f3\275\200\030G\272\364\020\242\274l\350\267<\313\']\275\2423T=H\211S\274\024f\216\275\232\216.=JNa=`\333\004\273|e\212\274\260C\243;\000fw;\000\236\002:\350j\210\275\"\275\007\275v\260\033\275\224\030\210\274\220l\250\273\306kD\275\331\345T\275T\243\016\275\033\201\236=\300\370#<\255\322\200=@\266\247:\307\r\245\275\200\201\211<\303\034\250\275\177\356f\275]n\213=*\357`=\327\256\210\275B\':\275\260`\377;\333\236*\275z\306`=\000\374\005;\001\273\247\275f\213|\275\002\232\035=F\271)\275\3058\204\275\300{\306\272\324\346\226<@\216\220\272\366$0=\rc\222\275\000\350h\272\005\346\250=m\250\224=\304\224\233<%\\\217=\370S}<\363\372I\275\260\361\360\273BSL=5\317\240=\020\205\306;\014I\234<\200\245K<x\276\313\274\300\023\203\274\307\314\250=\310@+\274\320#\351\273\"\340.=\030\353{<\374\363\201\275\244\250\357\274\034X \275\226\"\025=*\345\177=\264v\211<\020=\251<\020\022\226<\267<\242\275N\024\215\275m\356s\275\336\212S\275@\265\253<\242Dr=\234;\225<\331\021\222\275\350*\320\274P\\\212\274@G\025\273\264\334\270\274Z\227Y=\314\376\246\274b\ng\275\226#d\275\321X\235\275\323\025G\275p\271\300<\337\230\013\275H\204W<\351\001\203=\357\272\250=\354u\324<6g\364\2748)N<\252\301E\275~w\251\275\0303\346\274\317\'\214\275\202\310>= \377\014=\006$\200\275\332\377@=l\322\277<\000\221\265\271k\267\025\275\n\214V=\020\001\255;\362\200B=j%y=\377k\204=\346\227\304\274\225K\220=\220\036\001=\345\322\244\275W4\240=T\255\214\275l\373\317<n\272\360\274\363\354|\275\322V6=\240\377\336<z\022T=\260\226\352<\336V\033=oo\230=\376\334\365\274\217\271\246\275\340\201\007<Q\027\202=\205%\241\275\301w\227\275\020\334\377\274\200\317.;\005\"\231=\000\266&=D\023H\275v\202\235\275w\255\241=\312Bv=\3240\245\274\222H\037=x\365}<\216\036\263\274\240\226\204\274@\031(=b\n\025=\240\020y<\177\226=\275u\262\204=\034\270L\275\300\341\376;\3655\211=\006\025\025\275p\231\362\273\270\007%<\260\374\360<\254Z\253\274\210Wi\274\022\203^=\330^y<\337\220s\275N\333>=\000$\010;OIW\275\255%\213\275\201!\221=\234\032\367<\364\\\355<P;\204\275\275\351\230=V\224\037\275\300r\277\274\326J7\275\320\337\r=fA\260\274\022\001f=L\037A\275\300\005l\274\306\240\210\275\310g>\275\374\206\204\275\000^K\272\244\207k\275z\330y\275\272g\003=n \352\274\242I\007\275\316\221\003\275\354\373\204<\200\302*\272\324\014\235\274\300FW<\251\251\203=X\275\006<l<\231<\300\366\202\275 \304\037\275\200\351\014;M!\242=p\272\255;\353\177\247=\264.\207\275\242\322G=?d\234=\214\363\322\274\240&\226<0\356\314<\210%B\274\370\361\307\274\315\351\202\275\220V =\336\021\200\275\000\333\272:\n\340\022=@s\271\272\3625\002\275\226\371\224\275\000^<\2740\371:\275\301S\225=\004p\266\274/\363D\275\300c\372:p\346!\274#m\222\275\220!4\274Vxy=\334\247\200\274\212)y=\006r5=\031C\237=\270E\255\274\027\2460\275\200\016g<\322\333]=\266\233e=\032\017\036=\334\001\362<@\205 =\210\0231<\024\357\221<\246\362\234\275`\320\361\274\262r\213\275h\360-\275\276s\033=\264\254\350\274j\016M=yY{\275\267`\251\275\307#\240\275$\214u\275p\005\024=@^m\275\215H\216=\312\036\014=\2441\250\275\374\326\221\274\004Y\244\275\354\354x\275\272\316\204\275\232?k=\342\250`=\266Ud=gj\034\275Jk\031\275\327\236\027\275$\255\222<\300!1\274Tq\221\275z\302u=\360c\214\273\344\3607\275\324P\200\275\360\200\273;\364\t\330<\245\227\237\275@\017\004=\305\325\207=\256\372 =`!\205\275\t\364\225\275f\311&=\370\315:< n\302\274\204\331\236\275\206Y;=V\343Q=\310\0307\274\265\305\232=\347\345\203=\343\277\220\275\\\017\345<\311;\247\275\014\200\323<\307\375+\275\210\345*\275\2123K=r\230?=\332\020h=\244\221\365<\260\317\245<\200\3257<\351J\227=\315}b\275\253A\214\275\263$\020\275`:(\273\020\300\272;\231\240\235=\253F\210\275\035\200X\275\256\312S\275\260\222\322;(&\272\274\330\327\372\274\315`\245=\320\003&=\210\204C\274xB\022=\306\0242=\307\273`\275\274\033\223\274?\026\252=bQb=DM\210\274\244\253\345\274\300Ti<h\272\224\275\t;\215=\320\377s\274\030\233\r<\211\320\206=\032g7=`V\023<\032\254T=\204\327\235\274\342aS=\257\222\247\275\357\231\207=\360[\213<\275F\236\275\251\216\245=\372)\207\275xP;\274<P\244\274\033\203\217=X30\275\354\347\213<\345\\\246=\336>\223\275\031#\200=\322\3054=\350\376\377\274\034\262\220<\n\276J=\202\303u=\334n\213\275\036\225F\275rW%=S\207\227\275\234,\214\275t\245\237\274\325\324\230\275\300\354\235<\262J\016\275\034\030\235\275\000\237\311;\030}5\275X\332\000<\034&Z\275h\"f<\246\021\235\2758\271\036\274\332\276C=P\255\232<"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
