ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "input"
    input: "weight"
    input: "bias"
    output: "3"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 5
    dims: 4
    data_type: 1
    name: "weight"
    raw_data: "\312w\220\276p)\300=\030\326\245\275\010\036\210>~8\305>\3301\310\276\302\241\330\276$\357\362>\210\245i\275\270\336g\276\334\347#\276t\367\007\276P\006\301=\304\235x\276\306J\256\276\022\"\305\276*|\310>P#;>*\221\306>\364t\343>"
  }
  initializer {
    dims: 5
    data_type: 1
    name: "bias"
    raw_data: "\244\'\345>\210\313\234=\324hK>(\212\344=\225\362\372\276"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
