ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "0"
    output: "1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    input: "1"
    output: "2"
    name: "ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
