ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "x"
    output: "1"
    op_type: "ArgMax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
