ir_version: 6
producer_name: "pytorch"
producer_version: "1.4"
graph {
  node {
    input: "input"
    input: "target"
    output: "2"
    name: "SoftmaxCrossEntropyLoss_0"
    op_type: "SoftmaxCrossEntropyLoss"
    attribute {
      name: "reduction"
      s: "none"
      type: STRING
    }
  }
  node {
    input: "2"
    output: "3"
    name: "Shape_1"
    op_type: "Shape"
  }
  node {
    input: "3"
    output: "4"
    name: "ConstantOfShape_2"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "5"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "target"
    input: "5"
    output: "6"
    name: "Equal_4"
    op_type: "Equal"
  }
  node {
    input: "6"
    input: "4"
    input: "2"
    output: "7"
    name: "Where_5"
    op_type: "Where"
  }
  node {
    input: "7"
    output: "8"
    name: "ReduceSum_6"
    op_type: "ReduceSum"
  }
  node {
    input: "target"
    output: "9"
    name: "Shape_7"
    op_type: "Shape"
  }
  node {
    input: "9"
    output: "10"
    name: "ConstantOfShape_8"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "target"
    output: "11"
    name: "Shape_9"
    op_type: "Shape"
  }
  node {
    input: "11"
    output: "12"
    name: "ConstantOfShape_10"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "6"
    input: "10"
    input: "12"
    output: "13"
    name: "Where_11"
    op_type: "Where"
  }
  node {
    input: "13"
    output: "14"
    name: "ReduceSum_12"
    op_type: "ReduceSum"
  }
  node {
    input: "8"
    input: "14"
    output: "15"
    name: "Div_13"
    op_type: "Div"
  }
  name: "torch-jit-export"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "target"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "15"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 12
}
