ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    output: "1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "1"
    output: "2"
    op_type: "Reshape"
  }
  node {
    output: "3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 1
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "2"
    input: "3"
    input: "4"
    output: "5"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 0.002
      type: FLOAT
    }
  }
  node {
    input: "input"
    output: "6"
    op_type: "Shape"
  }
  node {
    input: "5"
    input: "6"
    output: "7"
    op_type: "Reshape"
  }
  node {
    output: "8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "8"
    output: "10"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "7"
    input: "10"
    output: "11"
    op_type: "Mul"
  }
  node {
    input: "9"
    output: "12"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "11"
    input: "12"
    output: "13"
    op_type: "Add"
  }
  name: "torch-jit-export"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "13"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
