ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "weight"
    input: "input"
    input: "offsets"
    output: "3"
    output: "4"
    output: "5"
    output: "6"
    op_type: "ATen"
    attribute {
      name: "mode"
      i: 1
      type: INT
    }
    attribute {
      name: "operator"
      s: "embedding_bag"
      type: STRING
    }
    attribute {
      name: "scale_grad_by_freq"
      i: 0
      type: INT
    }
    attribute {
      name: "sparse"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 10
    dims: 8
    data_type: 1
    name: "weight"
    raw_data: "\037\324\004\275\213\247\231?Xup<F\020\007?\265\303\212>]\302\207\277\271 \353\277S]\n>\333\0173\277\351\315P\277\261t\177\300?\376h\277\032Q\251?3\2365\277\357$\203?\324\014\255\277\367\370\334\277u?\262\274~b\\>7\r\002@9\035W?\221\334\247\2768\2771?\315\nf?\361\247\224\277\340\271\365>\000\244\254>\325<\345?Fh.\277d\254:\277[.\027\277\227\026\250\276\357\273\031\300\016\256\210\277U\004\210\277\334i\014>\231\346k=\304\214\254=\263*\362\275\256i >\177\n\266\276\250\264B\277\256;\220?\241(\257?Z\232\003\276\0366\372>\3230\324\276:71?Y\rM\277|\213\231>#D\314\277\\\227(\276\326\264\032@\323\330<?\217\357\224?\246U\223?\213\277\346\275\301\374\240\277$\302\r@\"\334\257\276\366T\001\300\242(\335>\310G\341\276:{\021\277\t\204\220=T\352\270?\242\327&<Q\177\300?\332\210;>v\3008?\026\315\230\276\2265??r[J\276\026jk?Y\312y?\264\'Z>[\330~\277!Y\030\3002\376\014?\220\376\020?"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
