ir_version: 3
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "1"
    output: "10"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "1"
    output: "11"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "1"
    output: "12"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "10"
    input: "11"
    input: "12"
    output: "13"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "2"
    output: "14"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "2"
    output: "15"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "2"
    output: "16"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "14"
    input: "15"
    input: "16"
    output: "17"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "3"
    output: "18"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "3"
    output: "19"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "3"
    output: "20"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "18"
    input: "19"
    input: "20"
    output: "21"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "4"
    output: "22"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "4"
    output: "23"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "4"
    output: "24"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "22"
    input: "23"
    input: "24"
    output: "25"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "21"
    input: "25"
    output: "26"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    output: "27"
    op_type: "Shape"
  }
  node {
    output: "28"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "27"
    input: "28"
    output: "29"
    op_type: "Gather"
  }
  node {
    input: "29"
    output: "30"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "31"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: INT64
        raw_data: "\024\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "32"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "32"
    output: "33"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "33"
    input: "30"
    input: "31"
    output: "34"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "34"
    output: "35"
    op_type: "ConstantFill"
    attribute {
      name: "input_as_shape"
      i: 1
      type: INT
    }
  }
  node {
    input: "0"
    output: "36"
    op_type: "Shape"
  }
  node {
    output: "37"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "36"
    input: "37"
    output: "38"
    op_type: "Gather"
  }
  node {
    input: "38"
    output: "39"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "40"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: INT64
        raw_data: "\024\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "41"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "41"
    output: "42"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "42"
    input: "39"
    input: "40"
    output: "43"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "43"
    output: "44"
    op_type: "ConstantFill"
    attribute {
      name: "input_as_shape"
      i: 1
      type: INT
    }
  }
  node {
    input: "0"
    input: "13"
    input: "17"
    input: "26"
    input: ""
    input: "35"
    input: "44"
    output: "45"
    output: "46"
    output: "47"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 20
      type: INT
    }
  }
  node {
    input: "5"
    output: "48"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "5"
    output: "49"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "5"
    output: "50"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "48"
    input: "49"
    input: "50"
    output: "51"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "6"
    output: "52"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "6"
    output: "53"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "6"
    output: "54"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "52"
    input: "53"
    input: "54"
    output: "55"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "7"
    output: "56"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "7"
    output: "57"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "7"
    output: "58"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "56"
    input: "57"
    input: "58"
    output: "59"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "8"
    output: "60"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 20
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "8"
    output: "61"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 80
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 60
      type: INTS
    }
  }
  node {
    input: "8"
    output: "62"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 60
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 20
      type: INTS
    }
  }
  node {
    input: "60"
    input: "61"
    input: "62"
    output: "63"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "59"
    input: "63"
    output: "64"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "45"
    output: "65"
    op_type: "Shape"
  }
  node {
    output: "66"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "65"
    input: "66"
    output: "67"
    op_type: "Gather"
  }
  node {
    input: "67"
    output: "68"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: INT64
        raw_data: "\024\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "70"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "70"
    output: "71"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "71"
    input: "68"
    input: "69"
    output: "72"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "72"
    output: "73"
    op_type: "ConstantFill"
    attribute {
      name: "input_as_shape"
      i: 1
      type: INT
    }
  }
  node {
    input: "45"
    output: "74"
    op_type: "Shape"
  }
  node {
    output: "75"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "74"
    input: "75"
    output: "76"
    op_type: "Gather"
  }
  node {
    input: "76"
    output: "77"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    output: "78"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: INT64
        raw_data: "\024\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "79"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: INT64
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "79"
    output: "80"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "80"
    input: "77"
    input: "78"
    output: "81"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "81"
    output: "82"
    op_type: "ConstantFill"
    attribute {
      name: "input_as_shape"
      i: 1
      type: INT
    }
  }
  node {
    input: "45"
    input: "51"
    input: "55"
    input: "64"
    input: ""
    input: "73"
    input: "82"
    output: "83"
    output: "84"
    output: "85"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 20
      type: INT
    }
  }
  node {
    input: "46"
    input: "84"
    output: "86"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "47"
    input: "85"
    output: "87"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 80
    dims: 10
    data_type: FLOAT
    name: "1"
    raw_data: "\321\263W\276p\2633\275\007\365\333\275\334Ht\275UFJ\276\350\304\267=\277@M\276\320ri\274\0300\237=\346\\\232\275T\354\001>`\t\347<\330\273\373=\026\351\022>\277(\312\275\220m\246=t!\306\275`\214\217=\226E\357\275\374\324\323=\030k9=\3346\263\275\362\236\340\275\240\366l= \243U>\230\304\333=\220\342\260\274\340\3221\274X%\002>b#\037\276l>\230=\020\276\227\275\310z\004>\350[\243\275\240\'5<\334\243\232=r[\035>\000\237\006\275\370\343P>\326\270A\276\034`#\275\242Sd\276\300\276\227<\314\364\201=Ba\271\275(2\276=\200y\024\275\235\371F\276X\312/>4-\r>\230\212\347=\264\2446>le\250=X|\363=|\002>>`\2118\275\335\2232\276\3656\341\275\310\206\364\274\370I\311\274\000\244\306\272\3327\003>\274\347\222=\020M)\276\326\221\211\275\260vW\2756[\013>.\"\246\275\014\231\277\275\374A\023\275\014\372h\275\374\201a\275u\t`\276*\003L>\334\272\363=\273\261\330\275-\335\016\276\200\350\376;\210v\002>\034R$\276\030\365\254\275L\214\277=\360\260\023\2768\370\313\274\030\253,\276\202`T>\014\332\366=S\245S\276\264\326\374\275|U\242=@\310H<`\270r=~Q;\276\0014\365\275\240\311\317=\270\227.\276x\035@\275\\b\311=\234\256\355=\200\312c<0\301\204=\220\266\313=p\377\325\274(@z\275n\333.>@5_> \037\324=>/\310\275\315+G\276\030\000b\276\200\300\312:\210\264\257\275\240zf\275\344\313\000\275\000\213X>\330\tY>\320C\253\2746\203\211\275Te\336=\300+\222\274\326\336Y\276\230F\225=j5[>@\2005\276\024\317E\275 \240F=\203t:\276\271\tD\276\260\357*>((\242\275\002\221\005>\350\301\243<`w_=*\232\030\276D\234C\275\342\n\027>\024\013\322=lg\204\275 X\341<bN/>8\240H\276\244\024\023>\240\241\211\275TS:\275 \353\331=\2728>\276\034]\n\275\342\317Z>\214\321\244=\242U\251\2750\200G\275\370\2224>\014\004\255=\0067\033>\230r\023\276\010\007\204=0\271#=p\247\037=\026\235T>\224\201\375=\374\324\035>p\024\311=\300w\300=\374O\037\275\231\026J\276\257kA\276H\234\016\276I?\024\276\274\224\327=\250\303\215=6\224\202\275.l.\276\214ja>\006\020,>\210\312\331=T\245b>\177\320\363\275Oe\002\276\034\007\006\276\200^1\274\247\037J\276\312C5>\000}\274;(\016\344=\271}\373\275\320\266\274\274\000\356\360<X\257z\275\302 X>`9\321\275\3300\216=D\\\033\276\370\320\330\274t\374r\275\254\225\305=\226\362\037>\220\300^=0Q\246\274 \210j\275\226\2053>DjX\275\272L%>\\\301\313\275^\266<>\202\016d>N\365\034>\230S\003>\310r\252=\325+\341\275@\345.;\204\257\235=xRo\275\2400$=\262\032\006>\274&T\276}iP\276b\002\t\276\220s\337<\244\304)\275 ^E=\000\315Y\275\010\345\025\276\3204\363<\250\024\033>\337{\t\276h\266H>\340ia=x\306a>\320\337Q\276\003-[\276h]\233=j\233U\276\221\244;\276\274\333\350=\020M\336=1\245P\276\252\303$>\224\0272\275\210\376)>G_\006\276L\271Y\2768\312\027\2760\375\r\275i\256d\276p\235y\274\275\215\344\275\020-U\275\000`\005\270\020\236M<H\372_\276\224\216\353=NV\014\276\330\212\013>F\320Q>\240\270\230\275\270\226\315<\300\200\374=P \221\274\211\226?\276T\266\315=t\335\331=\376\343\372\275\320+\032\276d\326\037\275\000\2233=k\230\347\275@ \260\273\216\344\305\275\200h\262\275\200\260\372\274\n\213\256\275z\342/>H\251p=|\352L>\022\276N>\010\262\025=\200\204\276\275\364<\013>\240\374\376\273F\201)>\274\221C\275B|J>@\367\361<`~K\2758a\025\276Vu)>pD\356<\310h\236= \033\271=p1=\2749:\346\275\202\256\210\275P\030#\274\220.\016>H\342\205\274\\1h\275\260\362\370\274H^\026=>\3016>\004\313,>pFV\274\320\317\362<\306\247O>\\1\311=\000I\301\274\346\274\007>\234\226\320=D\372u\275\034A\271=\2300\221<>\005\252\275@\253\217\274\330\202W><\217\211=\266\n=\276F\353\021> \313D=\314E\341=\000Ov:0\"\266=\334\342\210=\314\nI>`\255\361=xh\310\275t\374\357=PJY\274\356e\027>\332\257\240\275\026i\206\275\330\275S> a!=\300i\000=\030\331\273<p\320n<@(\032<\303\370F\276\370\005]><\231Z>n\241\035\276Xzb=\002E=>`[1=h\373\304=h\211*>\310c\302=P\215%\275\033X>\276\251\367\327\275GR\010\276`7\224;\217 \"\276te\021>Ph4=.Z\306\275\310\256\004\276$\003\226=\020?[\275\210\374.=\300\032\254<\340\331\343<X\177\375\274\020{3\275\014\303V\275\250\225\260=X\236\023\276\240\266\253;v\025\272\275~\231Y\276P\335\200=@\033\215=\204\300K>\030r\026>\016\034`>T\3563\276\357NG\276\354n\216=\250n\340=<\300\311=\356\307\026\276B03>\021\007G\276\230\017t=0V\257\275\372\315\244\275\360\3574>\024\014F>p\320\261=\254=\315= \020\017<Rb\014\276\370\316n=\374\354D>\260\342\277=\331aM\276\254\321@\275\320\024\222=\024\351(\275\\s\216\275\021\300H\2760\215\273<\360Xu=\002\034P\276P\332.=\014\316\211=H\341\252=\204(\025>\246L\007\276x/\225=\260[\251<\230\376\204\275\3202_\274>\356a>@\032\354;\320>w\275\200\367V;x\017\335\275\344\335\004\276pyN\275\270/\355=x\322\215\274lyV\275x8\276=\010\r\376=\314\376(\275pEg\2750\347\032=\371\376\370\275\340\273(>h\212\177\275\212%\232\275\234gQ>lB1\276\270iv\275\2142O>\353\301\324\275\320\211?\275\004\221[>\354\216\227\275Dk\323=@\201\304=\350\2650=\261\032B\276\000J\024\276Q\3206\276\275\246a\276\024m\177\275\010\365\326<\324\202H\276F]O\276@\0278<4I\252\275`\003)=\200\365==\374\321c>`\227\004\274PQ9\276.@\027\276\\\364R\276t\353\'\275\220\334\321<\200#\227=\200\310.=\030KR=PU\375<\230w\242\274\227q\315\275\230\375W=\000+\361<\310\266\200\275\316\334&>\032\330^\276t\226\206=2B\001\276\364`\362=\350\0223>\3767\">\000\231\257=\n\255\332\2754\353I\275\320x\200\275\000\240\335<\223J\336\275\004\250\336=\030[\005>\236g\271\275(\354\203\275F\336 \276?T\376\2759h\341\275\204z\037>^\256C\276\264\032\211=\nRM>\201#\030\276\t\341I\276P)\370=<9\014>L\241\277=Xn4>\026\300\020>8I\016\275\354w)>\232J\346\275\200\357\303=\254\032\n\276\350\177M=dQ\367=\200O\253=,a\371=\010U\n\275\244-\235=\220\374\351<h\227>>\0266\005>y\031&\276\354\252\263=0\257\363=\220a|=fz\347\275\314\337^>X[ \276z<:\2768w\224=ho\301=\250\365\212<\000k\n<\220\344\277=\020\030\">\177o\335\275\010\237\217=\322\271\250\275\"\331\354\275\n\316\355\275 k*\276\026.A>\350\030\233\275\376\264\200\275 >\261\273\025(\025\276\244b\024>\246\250\216\275\014H\363=\340\007\205=xKc\276Z\207R\2769,_\276\264zM>\364\331P>h\236\234=\022S\276\275t\235\226=\311\000-\276\360\245\024=@Q\372\274T\341\034>\240\023f<\200\370\213\272\260>\242\274\020\313[>c! \276\340\257\317=s\006N\276p5(=\213\353?\276\264{\336=\000\344L>\265\257\333\275\336^M>\264\007M\276\020\212\332=x\335\033=,\261Q\275\270\372\374\2748\003\267=\220\342&\275\014z]\276\300l\245\275.;B>],E\276\316_\232\275\010\377\274=\010j\'>\342+,\276fr\036\276@\"\n>0\277\033>\240\360\024>\252p\003>R;C\276@\371\226=P\260\004\274\210\241\014=X\021\257\275t\212]>\320\207F\274\033\266\034\276\340D\355=\000\300\231\273\300\275\016\276)c\312\275\316e\020\276\300\0204=h\207D=\014\214}\275`D\226<\247\231\370\275\036#c\276\000\236\260\273\306\rY>\204\220*\276\300\2555=\232$\346\275t\r\020\275p\341U=\325\266\341\275\235WD\276@vc\273\010v\210\274\200\273%>(\277\266=\242\234\003>\323\332\017\276\010\215V\276:`\n\276J\3767\276\240f\377\273r\000\210\275\2201\250\274\266F\201\275\224G\027\275\260\177K=\230d`>\314$=\275.\364;>,\253M>\204\"\333=\360\337q\275\310ks=/\034\026\276`\027\234\2740)\326\275PV/\276\364\347A\276\256E\245\275\010\202d=@\204\232\273\240v\374;\2148\300=\350\341\202=p\354\031>\330p[\275`\026R=@\302\021\273T1\235\275\310\264\031\276\300\335}\275\252\263X\276p+\331<l\3735\276\000A\237\275\024\357\262\275\356?D>4\244:\276|\267Z\275P\371\243=dw\201=\274\344;>`E^=\350\231\006>\006s\t\276d#\016>@\002\237;\240w\313\274\004\203\315\275\\\263\251=\350\021\355=\371\240\'\276\273\0171\276\020\263\266=\337\240J\276\017cW\276\256\245%>P\300\221=\220\356\214<\000H\251\272<A\276=\246\214#\276\256b>>\3501\377\274\320\277\263<\014\302X\276p\031_<$\347\013\276>\327\000>\264\201Y\276\250aN>\354\270V\275@7\234\275\200b\274\272A*;\276\324\261\223=\020\304:>\264_\300\275\272\265\224\275\200\314>\276\330 _=\344\247(>\200g:>\214\367\222=(j\315=*\017(\276\004&\270\275\330o_>\0009X;\210O\272=<\246)\276\332\365<\276\274\3034>VK\313\275Ai\367\275\340\347\036\274\350\001\205\274\034\022\310=\352\341\016>\010-K>4\224\207\275$|m\275\344\2023\276\277\222\350\275\3142+\275_r\352\275\200\000\264;\244}D\275V\250\003>p\376G\276\300\364\223\273D,\255\275\020\324v<\334Z\367\275\237\177a\276`\002\253\273\020\345\243<>\313F>\324\361\033\276\330~\010\275Xk9>\250\210\\>\260\277\013=\312X\337\275\332\r\007>y\320%\276\007\347?\276\2200\235<\324\263\005\276\0104\222=\324T\306\275|}%\276\370R\247\275\2046\025\276\3446!\276\304\371\360=\370\305\267\274\206Y\304\275O}`\276JR/>\373w\007\276\362x:>\234kB\276G\016\323\275\222\375[>\350\001\300=e\334\022\276\326(\026\276C\333\346\275,\355\256=\244\320\356=|\377\251\275*!@\276<\374\030\276\272\320\016>0\343\037=\310?\273=\234\273\353=\356}\023\276k\213,\276\2249#\276\266!a>`[\331;\020\313P<os_\276\350\312\026=\343\367T\276f\000\026\276`\201j<p4L\276T\315\314=2\201\">8\016\300\275\360e&>\032N2>"
  }
  initializer {
    dims: 80
    dims: 20
    data_type: FLOAT
    name: "2"
    raw_data: "O_S\276\220y:<0\334r\275\254\010\016\275\224\302\000>\324\355\352\275\257\367\027\276\310\350\321<`m?=\254\246\366\275\n<\310\275\307\006N\276z\261\001>w\237\351\275$\374\334=d\216=\2769\n\031\276\000\322\360\273|\232c>0\365\355\274 \314\257\274\330dI\275\030\000\004=\002V\215\275\304\0171>p\335\272<d\253\353=\340:\362;4\336+>K\256\020\276\326\343\351\275\252\017\265\275\274\023\276\275\220\260\202<(\361\323=0\246(\276n\036!\276\320\260\n>\2608\322=\010\276@=H\327\301=@/\326<\022\300\234\275 \337\022\275\304Ap\275\310R\301\275\262X\013\276L\327\t\275\316\253\023\276\007c\004\276LU\017\276\236\207T>*\364a>XL\373=\204d:\275\020\246p=\360l\275=H\001\017=\220\327\354=X\245\254=\020\363\223=\262\300Y>\356\030>\276\310\206\257<\230M7>\036P;>\372~\201\275\316\271\030>_j\010\276\000zf\274\nHO>\274\312\033\275\0307\356=\316\205d>\222H\303\275T?\303=\370\375\263\275\000&|\275\206\302)>\304\014\221=\320\017G\276\374\234V>l\350!>\2647\376= \315\317<\340\275\322=\010)\217\275`\323\237\275\200 \361=h\020\017=2g[>`\201\203;\200\355P\274|\374\004>C\331\336\275\237iK\276\240\241\365;\342Ga>\022\364.\276\220\311\017=\016\330\025\276\324\276D\276\200\030\330\272\212\361\242\275LqZ\275x\356\226=\010\301V\275\260H\315<\300\317\256\273\340y.>\260\022\236=\314\346\245\275l;,\276\224\363\027>8\346\302\274\334-\270=\264\034\306\275\320B\">\2361\033>\320m.<p\225m=\000\0078=|\213\255=\000\347\344\274\312HE\276xX \276H\344\r=)\017d\2766fZ\276\352T\374\275L\352\354= \000\211\274\372\254\"\276\223\332\030\276\254\373\261\275\336\272(\2762\250U>\326\274\022\276\215\274\362\275<\365 \276\002\263\245\275\374\0146>\\\252\247=\310q\210<\r\354a\276(\032\271=`CV>\300Qj\273X\260\033>R\300\223\275|\264V\276 \n\267\273,\216\266=\256-\311\275\220MT<\020\'\031=\306\304[>\030\346\356\275\004\357F\276\360D\325\275\336\002%>{\221\324\275\260`p\274&\245$\276U\303\353\275\350\200D\276\030\377\210=V\211\032>0\347\363\274\260\307\204\274H\321j=4\325\006\275 \337\231<$!\274=\236:0>\014\305\351=X.`=J,D>O\034L\276\354\302\026\276\030$:>\004\341T>9y\325\275\270\3073>0&\322\274\310\352\177\2750p\r\274\240\032n\27505|=\360\000\213<\200\205\222\272\352\211\300\275\366\024\013>\004\344\r\276@5I\273\004\315\026>\023 \364\275\212\340\030\2760}s=\277Y=\276\370\366\276\275.\323G>8\006\004>x\021O>%\352Z\276)WW\276\200\001d=t;\242=\236\264\004\276\224\334\244=\020?\036=f\272\302\275\310\306U>\312\332/>\272\255=>\236W\225\275\000\374\255:J\020\332\275\334d;>$\001P>\237\032\343\275`\030\205=$\201B>\000\005\351<\374\"\232\275,\016\014\275U4\026\276\260;`>K\215\345\275hJH=\223qH\276\030|\260<t\241!>&?<\276\360\204\242=@,\227;\024\352\367=\256f\327\275\310\t\t\276\203\314\314\275\310)\005\275\202\341@>\300\014a\274O\006(\276\251\"\002\276\034yX\275\n6\206\275\230%\237\274\306]\270\275\343^\332\275(\300\177=\204\010\211=~M\300\275\\\355\254=2Q\265\275@E+<X\322<\275\240x\271;F\320:>\364:\271\275&\313N>PK\'\2742\240\033\276\020\212\240=\250&\316<@\243`>v]/>/\272T\276\236\327D>\332\352Q>\304\254\356=\020\352:\274t\362]>\320Ql<P!V<@{+\274l\247\366=P\311\236\274\200\267\262<$\254\262\275\340\325\350<\344\033\353=8\303\363=\234\271V>\300\241\244<^9T\276\004\213\013\276S\034\334\275\020u\217\274\025\334>\276bB7>\356\314?>\376}%\276\204\377m\275\004\313\013\276|8\372\275\342\024R>\031h\332\275\224\241\316=\024\335\364=\220I\364<Z\250\017\276\020;\203\274\204F4\275\244\037d>\000\022\036>8f\320<\2105\364=\027T3\276\222\231\003>\320\007\327=\266/b>J\004\202\275\"\370\027\276\240x>>\316c_>(\000\220<\310\006I=\324\231^>*\013B\276\2368\214\275p\250(\2760\241\332=\270\350\030>\2077E\276\214\246\023\275\207\234O\276b\367(>H\2656>,P\225=\000\327\340\272\000c\034\273r%\031>\254\253\235=\376\332.\276\260\2506=\202\2666>\\\355\024>\000\323!\276\374\3552\276P\222\017>JV9>\234K\346\275\0068\017\276 RT=\300\234\347\275@\206\354=\034\031\254=\360\3314>p\'8\275\366\314\206\275\217\0333\276\234\306K>\220o\352=8:\314<\332\237\013\276\3049?>0\003R>\334\304b\275N\202\004\276J\331\306\275\230\003\026>\001\273E\276wH\317\275\2004\302\273X\275\024>8\326\366\274\356\232(\276|\366\032\276\274\261\224=\000\323\002\2734\376b\275.\357\017>\274=\256=0zx<\324\234\206\275\007\205\026\276o\335a\276\350q\334=@\355L;<%=>\024\022\244\275\355\360\\\276\202\023\373\275\224R\034\276\240j6\275\347\341I\276\374\206\270=\334\356$>\300M\321;1\356c\276|>\237=\230\377A\275\330qo=,\027\211\275S\251.\276h29\276\210e\207=\370\243\220\275h\240M>0\344\354\274\360\334\357<\350\314\026>@\336U>\330m\246=\032\331@>\250\2657>\034\340b>\016\324>\276|\026\272= \265\321\275\0209%\276\300\376\322<\210\250\'>\260AF>\200\233`\273p\322\275=\250_\204\274x\211\005=4\276f\275\302\201\323\275\252\036\020\276\370%Q\276\320\222\326\274pVW>\024\002\246=\360\331=<\360kB\276\320\025\324\274J!V\276\030p\022=\240\035\247\275\230T6>\256\004\021>\347\213C\276p(\001>T\222k\275 \353_\276\360\306\235\275 ?\340<4\270\373=\3400R<V\274->\332\321L\276\014T\307\275\371Nc\276\220\260\315\274u\272#\276<O\004>\020v\n>\252\316\276\275\254_T>\266\271\036\276hN-\276x\3772\275\310\364H=\254\305M>\376\257\033\276\352D3>t.\270=\000\272\337\275F\353\025\276\220~\230=\000\246\221\2744R7>\360\246\333<\2205S\276\330\267\217\2750\\\261\275\360g\003\276\230:\364\274\230.\302=?\270\016\276\004\017*\275tj\306\275,p\017>\010\2010>\322\277<>\364A`>\3450\332\275\"7 \2762D$>\344Q\306=\030\230\026=l2\000\276\354\2536\2768\t\230\275\000\023=>\020 \347\275\336\356\021\276\274\361\250=\000\215B>\020\354\201<\330Cr=\244o\024>\252\016\206\275y\nN\276\010\273\231<\376\264\000\276L\004\266=\025\324\360\275j?V>\250?\262\274j\3025>\336y\"\276\034\320C\276\345\260\331\275\010\276b\275\366\035.>N\3561\276\300\333\260\275\200\230\210=\270\241\217<\260\237\310\275R=\027>\310\255\001\276L|\331=\240\236[=\330\302\000\276\030\206\006=\274\330\216=X\276\266\274\344\225\215\275\334h\336=\300\314\304\275@dN\275\260g\373\274`\371\203<\200u\n=X3:=,TB\276\215%\020\276\200\321l=^i=>\344\215\025\276\264D\202\275\361\341\021\276\261u2\276T\222J\276\244I\207=\250u\207\274\030\202\353\275x\222_>\340-\333\2748B\000=\272\333d>\354(#\276\322\300\230\275\352\2226\276\224\027\223=\240\372R\275s\004a\276@\367\214;@\313.;\014dQ>\260\001;=Z~\'\276\222@\003>\324;\003>\200$\271=\232(\273\2750\262\007>V\374\226\275\340#-<D\333\234=\272\334\277\275\364KJ>\252,M>pu\207<xk\013\275\273\021\363\275\304N\034>\2668\261\275\372`F>(-\026=\002\0314>0;\353=\316D&>\020\334t\275Xl\377\274u\270K\276\200\000\005>\300\346\016\275\370\270\027\276\356H\207\275\230\"I\276\200B9>\370\347\346\274HaJ\275(\257\307<\300\035\200<\212\353\r>\370\346\005\276\006P7>1\365\350\275\030\276\277<\210m1\275\330\367\310<\200\343%\274ls\272=\374n\010\276\303\255\014\276Pc\023>\007-;\276*\333+>\262\331^\276\264\251\021\275\2045\272=\354\357\314=\370\024\020=\240\263\270\273\\j\\>\010L3\276X_=\275\0042\020>f?T>\274yK\275\010\021N>\034\177\265=P\266,=\372p,>X\242\373=,\200L\276 ~\331\273xiT\276.\305\024\276\030\010\013=\330\266F=D\301_>\340\033z\275j\2257>:rW>\220\027\352\274\244\252T>p\2751<\230\326\246=\220\3263=\252-\010>\010a\251=\274\2324\275ik%\276\272\365\014>P@)<x`\\>t\332\031\276\303\271\035\276J\034\242\275\302\343\">\370\030\247\275\030\371\000=\300\321\010;\320$\223\275\320\261\322<lS\037\276\212\221\344\275t\262\326=nN\034\276\202\230/>\036\235[>\\K\222=\232\303N\276\360\376\220=01\016=\322\352&\276P,\273\275\234\241]>l\322\350=*\0141>\310jv\275\370\247\027=\244$\353\275\220!\023=\372\334N>\232\\a>\3445\031>b\037\025\276\340y\373<@W\021=\310\0105=\004\024c\275\260\250\203\2752,(\276X\275\234\274:;.\276X\367?\275\220\006O\276\252\2240>_\0341\276\300&\241=:\022c>|]\034>\202kd>\216\356\264\275\245\1777\276\361\226C\276\320D$\275\210\331 \276\020o\256\275\177\362\332\275B\222_>l&\225=89\036=\002\204\333\275\270\ru\275\260\303M>\304\027\300=\344\214\316=\3604\264\274\204\374Y\276\340\3768=(\2260>\330@#>\014U\213=\030\0100\276\2107\334=\367T\026\276\276P1>\240\331\010>ff)>m,/\2760\2268=-\336\352\275\242a2>\270A\013>\214\270`>\360\2627<~G\234\275\306\3069>X\227\036>\2003\274;LN\303=\\\252\307\275^R\003>\022&\024>\376\t\025>p\362\360\275$f\250=4E2\275\032\"_>\320}u\275.\320\014\276\313\017C\276\016\nL>r\tR\276\020\345J\275\370\374\270\275?\267\002\276\3745L\275\264\255_\275P\361E\276\336b\310\275H2\313=\350p\262=\024\262L>t\217?\275\274\rB\276\344\344\365=\302\261\234\275\310\221\204\275$S\330=nEd>z\326C>x\3445=\314\2560\275\270\261D=d2\177\275\336\034#> 4W=F\325\021>\240\303\366\2730\307\345<@\320\030>\316\313\316\275VuI>x\211\005\276\240\231*>\244\347\030\276\314-:\276Q\351=\2760\322,\274\324\211\261=\350g%=|Z\'\276h\360\241\275X\026\033\276Lp\231=@\204V=\030I\275=rf<>v\211\275\275\206\371\023\276\250\244\025\276\007\236\352\275\324\014%>@K/>\274\213\236\275h\330\251\274o\"\363\275\034,V\275w@M\276\200*\324=\314\030\330=j\207%\276P\334=\274\034Zu\275\354\025\365=\246\330!>\320\313\370<OT<\276\377\3314\276pRO>\270\223F\275\310v\230\274p\313\315\275y$\000\276\214\375\343=\000P\300\273\270\355\034=\246I;\276TX:>\300\366\024>(\215c>\236\2121>\340\036\305=8\357\326<\361,A\276\'4&\276\200\2024;j\274\006>\200\010\256;L\303\342=0\274a<x\244\035\275\030\302-=\000.\254\271\211R\362\275\022]\244\275\016\2763>\230\262\037>4\236\007\275\204\207\'\2768Q7>\030\240\005\276@\300 <H\234\222=\300.\211\273~S\203\275J\244;>dh\004>v\305\\\276\271\013\372\275\340@\313;4[\273=@\310\272= \202l\275\212\304%\276xfW>,6)\276\271\246*\276.\222`>DU\253=pF\313=\013\005\010\276k)\016\276\314\227\205=\320\231\032\275B$4>6\341\231\275\256\233^>\0000\255=,}\311\275\303Z6\276\014G\n>\r\255\331\275\253`7\276\010\260\000=\320~\351=\010\207K\275X\341\274<\336A\311\275\206\0060>\n\207Q>*w\025>\312c]\276\243)Q\276\334E\376=\304rF>\214\211\364=h\244\266<\264\2036\275T\337+\276\330\246\377\274N.X>`2\276\274\337\300[\276\350\222\004=N\nP\276R\213\">@\264T\274\260\323\336<\000e&=\270\230\371\274\320\326>=B\267\'\276P\210\017=d\223\257=C\257\"\2763\305Z\276`\203\203;\250\207w=\360\352\200\275`N\020\276\320\010k\274\030e\337=\177m\005\276y\223U\276\320/]>\025\376W\276\210-\r\275x\001\327=\0029\016\276\250*\243\274 \345\020\274@N\376<\320\301V=\'a\333\275\356\037\034>p\271\346<\206+b>p\336y<Z\230\341\275\200\331\364;\356YX>\002\335\026\276\370\026\237\274\231d\003\276\005\365\347\275Z\275,>\032\205I>\370\257\002>t\341\031\276d\204\355\275\214\240@\2762\274\231\275\360\346\210=\010\235 >\273\037\312\275\225,\002\2764\277\230=XJ:>\030\316\231<\310=%>\254\232B>\014@\037\275x\250T>\272\017\'>(\231u=\246{F\276\264^\215\275\030\036D\275\000 K9B1H\276X\354->8\275\034>\020\240\007=\372\2309\276F\335\025\276rGc\276n\204\241\275\226\320\013>\302`.\276\324\267\031>\210\030!\275\350\021\261\274f\000\234\275(\030G=FD\242\275G\024\344\275\340\022\020=C\014:\276@\370\242=\004\\(\276\002\027/>\332\244\037>\200\337\177\274\360\3745<\200\274\236<TO\234=\264\235\r\275\3209\021=\350:\247\274\"\365\024\276\250e\260=%\0109\276l\021\036\275\324\301W>\000\220M\273\200?m\274\300\020\322=\"FS>\220\202\265=\372W\214\275\204\217\032>0\304l\274\200\334\343<\256\327\007>\320`\003\275\200\n\261= \001Z\274\250Z\353=8K$>\370\333C=XT\207\274\345Q6\276\363j\371\275\360\314D\275\030\242K>p\343\024<\254\016\241=\231w\000\276PoQ=\212N\036\276!a\344\275p\240Q\276\220\253\032>\202\360\026\276J\327\004\276\336\332\022>,\020+>X\333\363=\016WD>\nP\025\276\300:i=\\A\343\275\252\007N\276\331\240\376\275b\017\254\275\010\355\374\2740=9\275\220\325#\274\370\365P\276\216\304.>\256\241X>d\221\373=\336\235`>\334Dz\275\310F\251\274\006\005C\276\360\366\313<\262(\'\276\267/T\276\360\330\002\274 \245\322\275\322Q5\276\020\271\030<pc\347\274dQP> \225K\274@+Q=\262\007:>P@c\275\n\251!>\246\203V>x\304\300\275d\2539\276\350\034\375=;\020\340\275\212\233@\2764XP\2764\247W>\236 Z>\325\264.\276\344X\311\275\360Ds=p\007\262<P\334r\274\034g\t\275xJ[\275\315\213#\276\000\204\0039\030n\312<0\346T>(\3673\275$o\300=\314\003\031>\374\177[\276`U\255\274\276ac>\362\036\242\275\3748\203=\360\235\265\2740M\277\274\334\353\r>HE\261\274\242\354\024\276\010\215\335=\212\t\224\275\000\035\303;`A\340=jy\245\275y\374/\276$\362\026\276\310\243U>\344\216\234\275\236\334\004>b\211\030\276\274\213!>z\200?>\300;\211<Rw\227\275\272\360\023>T\\\260=\300\027\243\275\177\001<\276\352<\016>\231\031\322\275\000?\267=\224`Z\276\347\352Q\276~\307\005>\024 \223\275\210\236F>\250\277\201\2742Y\036>\344\206E\275\224`M>(?4\276*\231\236\275\360\231\271\274\230\027A\276\320\267\302\274\370\355%\276\230\333e=\210\235 =g\266S\276\325\002L\276fR`\276X\033\307<`\334<=T\253=\275\230\272#>P\236Q\276\004\037\253=z\231)>\020\357J\276x&\351\274\230\253;><\346\314=\030\322\206\274X\315\340\2746\220\033>\000n\267\274\2248E\276\030\223}\275\312g\013>\254\333\320=\300\315\340\274\014\317\222=\352\031\303\275|\277\005\276\326\203\017>\362\255/\276\020i*\276\214\232\030>:\326\014\276\275\364\025\276\030\004<>R=\014>\247\224I\2764\252\"\275\377\005a\276\361&\367\275d\242\026\276 \033\005\2754\264\244\275<\033\362\275\266\036\t>c\351\020\276\226n\275\275\200J\306;\330\274m=\266\341>>n\276\201\275\230\236y\275\330\206\033=\350\322\247\2748~\231=\300\276y<>\215^>\214/\n\276\226\004G>\264L\010\276\030,\306=\010\320\351=\020\206\005=0\266\321\275`*\266=Fq\035>\336\352\024\276\020\235{\275\004\324\247=t\303\263\275 \236\360\275\240\351\273=\020\034C>\350\270\364=B:\342\275\370\235\371\274\030\t\326=\340\211\036<\365m\353\275\224\261\210=\234`3>\000\370\212=D\347A>\224\3109\275\330\034\277\274$\346%>\004\250\214\275 \260:\275\264\236C\275\366\3571> \255\266\274\300\324\t>\020/\252=T\214\321=@\016\'\275#4_\276do\\>|\035X\275\360\247\203=\216\261U\276\020#\304<\220\0276<\330\214@>:.\030>\223C\032\276\260Zw=\254\317,>B&\022>*\3761\276P\367[>\030\314\022=n\362\017>\030{\213<\2203n=\326,*>@\300\352<0\t\t>\276d >`\025\007>\3049\357=\350\365\232\274\360\354\"=pPb=\034\353%\275\265\2578\276h*\247=\004\252\207=\340\331\225\274\257\330V\276\370*D>l\214\215=\236>\341\275R*U>\302\032\014\276`\221\353\2730\360\024=\314\365B\275P\301\260\275\364\340\331\275\210\315\003>\000\256\342\273\270\006(=j\375A>\'^\035\276\300O\373\274\214\022&\276\254kd\275I\315\002\276@\263O=\000\242\276;\254{\346=\242\356\r>\022\341\022\276\210\332.>\300\246H=h[\267=\360\352\341=\312\262\021>\352\326\027>;\215O\276\010\201b\276\346\365.>\374\341G\275\322\2077\276\206\361\034>i\363%\276\254\206@>\340\343\371\273:`\031\276\370r\202=pn\360<v6 \276yW<\276\355\350\024\276!\212\362\275\000\377\232\273\320\207:>x\302\231=\020\003m<\031u\001\276Q.[\2768\337i=\\\001Y\276\020\325.>\353\277\342\275 ?W=\340\022\336;~\331>\276F\341\n\276\310\371E=\360\301\032=\032Q\337\275\320\231g<\027~1\276\020\253\361=\367t\357\275(\252\343=\020\325,\276t\377\354=\312\362(>\250\334\350=,`0>V\332K>\362k > (d<\3160.>L\2015\275\250aK=\234\205\227=\030\346\267=\030/\022\276\010\346/=\252\211\244\275\\z\355=\260N\271\274\350\001\204\2740V\002>0\n\017>Z\216\255\275v\321\006>\340\004\254;DJ\024\276\200\263{\273F\316J>r\t\027>\270\363:>\224\206\t\275\254\3331>\372\2423>8\217\375=\300\033\315\274\344\340\031\276\244\250,\275\000[\342<p!\333\275\024R\020>\030\301\\\276\201c\316\275\225\014\000\276\250\037\272\275 \335\374<,\3210\275\030\020\221=\354\211\300=\202\'\037>\240\363M\276\355\243\341\275\370\342:>Z\023_>\252\022\014>\036\363^\276 \257\361\273\254/\377=\204z\016\275\270\\3>\004$D>\300\307<\275\214!\233=\000gA\273@\356\220<DmG>\3708L=z\215=>d)\243=x{!\275\324\352J>\354\313\027\276\226\274-\276d\322\276=\300\277#> \253\036\276\370\362\304<\"#\t\2760\350\324=\"@\035\276\024\344>\276\010\024\367\274\022\331S>p\241\244\275k\000E\276|5z\275\224\222\246=\264\221\334=\352\313M>\330g^=v\222\002>\200\375\223\273\222o\204\275`V\r\274N\340H>x\300J=\254\252\223=X\371\300<\341\013\373\275\340f\302\274\304\253\233\275\\\000\\>8\330\224\274\010\332B=\000hG>\324\177\220\275\030v\352=M\322\345\275\373\037\350\275\240\342\341=\230\225\262<n\r\037>Pq\350<\340\227\014<\024v&>\360\264\256\274\363\n\005\276@\244A>\220\255\242\275\214pE\276\244~O>\376\010;\276\214Ns\275\350\3755>\031x\031\276J\357+>~\263T>\254\021\356=\300\261\210\274P\341h\275X\270 >\324\276$\276\320\223%\274Q\311G\276TD\261\275\020\350~<\272(\201\275\310?\262=\236\205\256\275.\317/\276\346\2678>`\362\202=\030\000;\275`\005\314;\226\225\"\276\270\262\343\274(\2305>\255a\355\275V\250=\276lb\302=\224W\n\276l\177\323\275\242Y_>S\277O\276\210-\005\276\274\217\373=H\270\204<X\213\220=\320+F>\340\305\216<(\177-\276\320\373\256<8\004X\276P@\022=`\033\305\273!r\r\276\274x\007>`\201\204=\270\260\213<\030\212\014>\354\332\006>\004\r\245=\210{L=\310\377\006=\020\215\357<`b\373=V\274\030\276x\253{=\324\263E>\200\017f=|\266\227\275\210\246\002>\240G\317\274\323\266\315\275\206\004&\276\240\223\240=\000E\334\272O\253`\276\246T\014>\020O;>6@\303\275\000\255+\276\350\301\250\274\302\320\216\275\020\0279=D\3549\276\216\202>\276\250\313\322\275\220\377/\2768V\215=\316\336:>\320\324=<\360>\330=hva=\232\345\231\275D\222\021\276Dy\216=\370U\341\274\365yN\276\026q^>\226\014$\276L\315\343=\0101$=\254\257E>\336[\265\275\210\032v=L\235-\276K\3040\276 \356\225\273`\311T>\300_\354\2730\217I\274\244]\375=\220\274\321\274\240\202\342;\351\374\353\275P\t\004\276z\265_>\252E\013\276\326\306B\276\300O\226=\000|\0219\270\310t=\007C%\276\356\212\000>\274\326\362=\364o\215\275\030\343\351\275\214R\261=\250w\212=A\366\360\27500h\274 \345:=^\256\342\275\230\002\217< \312O=\246T\001>\030p/\276\022k+>\000\020\031\270`\360e\274Tf\265=\2206\226<\371ML\276\363\262H\276\014\370,\275\310\354]>\362*2\276\006\010X>\361f\315\275\\\247\377=h\352\000=\322V>\276\346\234->\2521%\276\204\356\\\275<\371g\275H\3659>|\2227\276\316\254T\276H\341\320<.^\210\275\224\266\014\276"
  }
  initializer {
    dims: 80
    data_type: FLOAT
    name: "3"
    raw_data: "\326\323\023\276z\\P\276\362\334=>\265\2673\276\374\031\223=`\371\370=\300\026\247<\300\035\213=\014\254\275=dXQ\276$\375#>\320\203Y=\"\340W>9\306\353\275>\010\343\275\3666L>\252zc\276\004o\t\276<\021\036>\214f\274=\217\206&\276\004\324\006\276\254V\'>\034\350\253=\204\354V\275\323M8\276\251\313M\276\310\360->\320\320\374<\314i\360=\220\213\277<\336\210[>ty\224=\030\320Z=\270\356\001>S\352\364\275zLd\276X\366\036>H|l=\020\002\226<p#\337<\004\2512\275\004\253y\275#\277-\276\010\274$=pr\244\2740;,>\2500\003\276\320\220\257=\336?]\276a#U\276\264\347\372=\272\377\021>@\014E;\340\033\030=@*Z>\323V8\276\3207F\275\345?,\276\334\3438\275Y&\336\275h\314\246=\360T\255=\200\254 <\3103\270<\340#B\274\200\002\222\274\264\231\210=\254MI>\224\242\345=\0202\022=6_\303\275 ( >\214@\033\276.tT>\256}\000\276\034\371\356=<s\346=\010\376\355=\323\210M\276"
  }
  initializer {
    dims: 80
    data_type: FLOAT
    name: "4"
    raw_data: "\346\222\224\275\260\204u\275\360\257\371<f*b>\234\022b\275\254d&\275\020\265X\274\306\035P>\020\233\237<\354\363\267=\200\365\307=\270\023O>\314\342\030>\010\265Z>\"7W>n\321\370\275r\315:>J(\240\275\026\361a>\023\365\016\276\"\221\037>\270\327~=\270X\222\274\252fd>\022\307c\276x\346\357=\300\213\022;Z\307\022\276h\225X>\260g)>\304?T\276\000E\035>\204\256!>\202\353\r>\331Y+\276\334\255/\276B\215\272\275P\353\267<t\273`>(\254&=\312\027S>\224\357\020\276\000\3627<p\321)\275\254[\t\275T\206\242=\213\031c\276l+\316\275\230\225\270=\352\3610\276\034~Z\276\237v\004\276\320a`\275\215s\336\275\200\377\032>\360Cz\274\230\356\245<|\003\024\275>\300\010\276\330\035\221=.!\223\275\340*?\276@\272:;\360\240\305=\251\364J\276\014<\t\276KT\360\275V\307\035>\206\2302\276\324X\007\275X\375\201<\310,\224\275\224`\372=\273\232\313\275\370\032,>\330\330f\275\rq\320\275DJs\2758Xp=.\315L>"
  }
  initializer {
    dims: 80
    dims: 20
    data_type: FLOAT
    name: "5"
