ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Cast_0"
    output: "onnx::BitwiseAnd_2"
    name: "Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 5
      type: INT
    }
  }
  node {
    input: "onnx::Cast_1"
    output: "onnx::BitwiseAnd_3"
    name: "Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 5
      type: INT
    }
  }
  node {
    input: "onnx::BitwiseAnd_2"
    input: "onnx::BitwiseAnd_3"
    output: "4"
    name: "BitwiseAnd_3"
    op_type: "BitwiseAnd"
  }
  node {
    output: "onnx::BitwiseAnd_8"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 2
        raw_data: "\002"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Cast_0"
    input: "onnx::BitwiseAnd_8"
    output: "7"
    name: "BitwiseAnd_5"
    op_type: "BitwiseAnd"
  }
  name: "main_graph"
  input {
    name: "onnx::Cast_0"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::Cast_1"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: 5
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "7"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 18
}
