ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "weight"
    input: "input"
    input: "offsets"
    output: "3"
    output: "4"
    output: "5"
    output: "6"
    op_type: "ATen"
    attribute {
      name: "mode"
      i: 1
      type: INT
    }
    attribute {
      name: "operator"
      s: "embedding_bag"
      type: STRING
    }
    attribute {
      name: "scale_grad_by_freq"
      i: 0
      type: INT
    }
    attribute {
      name: "sparse"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 10
    dims: 8
    data_type: 1
    name: "weight"
    raw_data: "\265\314\344\275\017A\376\276\313\374&>L\266a\277r\306\\=\212\032+?\210[t\275\344[\357\276Ek\\\276OKb?\233\'B\277:\334\274\2766N\257\276\320s\263\277\371+\244>:\314\202\277K\200L?@\001\275\275\235u4\2773\032\315\277\214\004\224>Y\320\372>\301B\305\276\342G6\277M\265.\276\343\316\272\277\177\364a>\201)|>p\223\251\277Pm2?\343\275)\277\355\235\233?\026X\277\277\252\206a?\354\335\226\277L\032o\277\251J\021\277\312\360\215\276\311\274\013\300\252\320\273>\226\"p?\266\020\000<R\262\240\276\343\016\224\2779\241\353?9;\202\277\027\020\234?E\370#>\222\233\314?\242\360?\275zt\303\277\214\351\000\300\3065\302\277\032\206\306>X\251\227\277x\2160?U^\251?d\221\350?\246F.?\rp9?9X\004=1c\324\277SL\360\277\'\274<?t\375l?\342\270l?\240\352:>\332\356\226\275\210\035\241>*\271\204\277\037\025W>\036K\035?\035\233\200=\035\313\250\276\017\003\346\277\374p_?\313WD? \006\351\275\234\\q\277\230\007A?"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
