ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    output: "1"
    name: "ReduceMean_0"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "main_graph"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "input_dim_1"
          }
          dim {
            dim_param: "input_dim_2"
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "input_dim_2"
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}
