ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    input: "weight"
    output: "2"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch_jit"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "V\215#\272(\0337=dw\214\275V3{\275Nw\003\275\346\017\267<\253i\330\272\337Q\207=\226T\362\273f\244\264<\220O\316\274K0\206\274\320\013\243\275\030\017b\275\233\264\014\275\253NJ;\353\360\006=\313\316L=fgg\275S\243\024\275\313\364\367<4\270\215=0~\214\274{l\177=\253\021\\\274\266x\020<\334\210\232=\212R\236\275\336\341V\275\326\323\254\274>\r\005\275\306t\223=\316>]\275\200 \035\275#xn\275\372\326\237\275\006@G\275j\264\222=(O\030=Vo%=+\234\217;\370\376.\275V\376f<\277Y\237\275\316\242v\275\263\367/\2753\\W=\210!H=0a\027\275\326\016E\273\253MZ=W\252\251=\030x\007=`r8<\376\333d=V\372H\275\366k~<\236Q\204\275\313\222l\275\303S0\275\263q\032=PE\t=\2160J\275\013=\316<\350a;=+T,\274\253\205P;V-\236<V\301S=\206\337\243=\017\205\203\275;-\372\274\273%\006=\340g\215=\360\203\224=\302\226\226=P\334\207<\246h\224\275k3\373;;\212U\275\263\r\237\275\324\242\227=\240\304\201=\252>\252\275`\215\177<\013\001f\274K\256`\274h?\034\275\010C\003=F,J\275{B\372<s\235,=\320Yt=\266A\377<2\352\250\275\000l]\275\320n*=\020\342\216<d\"\205\275\340\213D\275\367\215\240=\033\377e=v\324\024\275\033\321\253\274\246\223\242\275VS\304\272\246\205\200\275\027\245\203\275ku\226\273\200\377L<N\311\013\275 \212J=\366\266O\275\233\333\232=k\352i=\230\353\217\275\260\347\251\274\000nv; 4G<6\351\241<\350\362\005=@\221\243;\336\213&\275\343\203!=:\266\243\275\200OJ\275P\344\252\274\236D&\275\320\321\356\274\322\341\213\275\2536\221\274\246\354\221<\363]^\275\326\"\214\273\000Xt=K[\014\274V\310\027;V\222\353\273\266(\212<\200\010Y=\322\251\241=\010\304X=\203\010\242=\200|\305\273DP\231\275\200\321!\275hjh=\253\234\r\272\223\250)\275\254\310\202\275\000\270\237\275H\013\220\275Kx\212\274s0;=\360\2118=\254\230\244\275\350\352T=\\\214\205\275\240R\220\274\276f\n\275\366}\203\274`\t\206\274\322%\231\275.\\\223\275\213\245U\274\000A\215:&\017\033\275{\224\000=\'\234\231\275\000I\270\273l\026\226=&:\013\275\317\034\232=\366:\367<\037\005\232\275\360\365W=K\215\035\274\240_\030\275cy\210=8\352\211\275\313\201\022<\326\355\216\274\036\300s=\013\220\276<3\003$=\000\027\361<\000*\244\274\213\221\217\274\253\244\214\275\020\3638=o\201\207={\214i=\346\304p\275+\223s;\026\236p\275\013\346;\275\226\345F\275FL\351<\260gK\275VM\356\272\200\277e;\006\010\\=\247\002\201\275[Tj\275\3732F\275\036\351n=\020e\365\274\226\364\217=\200\333\366<\000\343,<\000\236\"\272[\363\206\274\253M+< \342\233\274\253~\031\272\0005.<\020\177\205\275N\3472\275\346\317\211=\004\201\212\275+\024\304\273\200\324\250=\300\232\366<\200\240\032;\304\346\223\275\310\026)=\013 s\275\340\310\301\274\273\013\345\274K0J\274V\363n:d\304\214=Vr*<k\335\230=@\314P=\263\313W\275\343\026\031=\206Iq\275h\252\020\275\253\311\310<@i\341<\367\t\200=\340\302\333\274\253\342\0139\370\271/=\347\014\245\275\003\307v=\313 \215\275\253\212\226:+!h\274c\3053\275 u4<\242 \215=\213\216\307\274\310\245J\275\006z\374\274\357\'\251\275h\023\032=\026\356#\275\026\311c\275\203\244D\275n@D=\333\3024=\213\375\202=v\236\367<\260\373\343\274\033\305\276\274 \256\311<?K\214=\233\234\271<\023\200!\275\376s \275,\\\241\275 }\223<\340\214?\275\213)\230\275R\247\225=k\252]\275\213R\033\274`\224\303<+\375-;N\255e\275\036\364\211\275\020\t\210=@T^<\332\226\215=\213\333\344\274K\025\311<\020\034\234\274+\337r\273\030\343O\275\346\340\346<\000\326\327<\253Q\341\272\200\210\231\274vhR\275\033\014l=\306\030~\275\036\325\013=\220\214\345\274\263\256$\275\200Fu<\330N1\275+J\235<\013\020\206<\270o}\275vSc<Cb\021=>\034\007=\313\335+\274\022\351\213\275\300xR\274k\030\355<\346\026\371\274N\220\001=\263Pc=N:2\275VoW:\030$\r=\026\006\326;\300\030\344;\240{*<R+\206\275+\231\326;\360\\l=C\312\231=v\236H=v\3656<Sh\037=>\r&\275\363m\215\275\207\302\222\275<B\252=\276\254X=\356\360k\275N\213\005=\307\341\200=\327\231\252=\346:\225=\2039\204=\366\201\234\274\200\223\357\274, \214=\270F?=@hM\275\252n\231=\013\353$=\253\022:=\216\360U\275`\333\303<;Q\357\274\376Y\205=\313\255u\274\246\342\004=V\203r<\3739\021=+\375\347\274\243l&=Sin\275\006/\232<\200\361f\275|^\250\275\013\016\211\275z\274\206=k\2548=F\037\240=\206\271\210=\300i\230\275\276\357h\2756\235\\\274C\254]\275K\005m=|\006\201\275{\211&\275.\341\244\275^\312A\275\227^\214=,\274\213=\333Vt=\302\306\203=\'\301\227=@\316\256\274\370/\026=X\r\230=\306\326\341<\207\234\252=v\t1=v0T=\220\355\356\274\370\307#=\300\342\034<[\010\243\274\270i@\275\036\207?\275\"S\203\275\276%e=\036\252r=kd\033\274[\206E\275\302\350\203=fGZ=@\373\312;\320\'!\275\320\331\234=\310\225\013=\222\217\201\275\227W\243=\214\231\201=f\323\370\274\320\341?=\036\361A\275\240\367U\274\314\351\220=V\250a;\253eq\275p+\344\274{N\271\274\300\264\203\274\313\251\002<l\326\235=k3\222;\273\300R\275V\365\213;;\252#=\250P)=\226\372\233\275\353Pt\274\366\250}\275[\244\021\275\326\365\365< dr\275\373\303\375<\257\333\220=\226\031\263;\226~c\275\326\226\364\274\346\021\225</\032\202\275\363\223)=n\361\232\275\214\017\244\275\200\324\245\275\360|\212\274\026\206e=L\210\241\275\037\333\215=\210\212\010\2756\361\307<\200\ry;\266\344\231\275\360\211\215=\350\3117=V\244\251=\036r,=\266Ma\275\206o\216=\026\302\222;\253\335!=s\330\210\275`Z\304\274\343\222\247\275`\362\004\275\300E\223<>\000\206\275\026\234\331<\346:7= 4><fad\275<R\204\2750\235\322\274\300\324\025=RX\250=\316FD=\313\277\031\274\253Z\357<Ko\247\275B\304\221\275\323D\037=\036VA\275\3106$=K\365p\275\356\020)\275\206\223\214\275#\0372=\353\036\013\274cX\203=\340=S=\320\337<=\200\235/;\306\020\323\274\360n\224\274 t5<\3033)={\"o\275\234<\217=\353s\024\274g\002\217\275[\2568\275G\002\227=N\024\234=\307\025\236\275\350\275p=\366\017+=\240\nJ=ny\220=3\3667\275\320\221\327<X\257\013=6\271\311\274\340t\344<\220i\304\274\200\010S=\266h\275\274\306~\376\274V\334\253<6#\362<\013\304&\275\353b\361;\233\320E=\240\330\007\2746\302\317<{\246\244\274@F\357<\210Bw\275\276\266H\275\360A-\2753\330\234=\333\261\267\274V\225n\271\336_%\275\366_\252=_\257\246=\353\266\200\275\266Z\212\2758]\201\275V\265\322\271\260\003\256\274\023k_\275\200\332\364\274\020\372\200<\360W2\275[D\227<\333\213\234\274\313e%\275\266\223;<\003U\214=\266\304f\275\000\230};\326\276\373\274\356y\247=\032\354\241\275\214\234\243\275 ,\250=K\365W\275\026\342\202<V\254\353\273\373\316\217\274\333x\230\274\246\345X=\200\204\202;\337)\246\275v\202I\275\246\270\350\274\270\303+=h\343\\\275\312\354\240=\306\014\230\274v)u\274,\272\205=\210\216+=\362\276\220=>qE=\360\026\317\274\033wb\275\200+\313\273\n@\215=\320\035\345\274jE\236\275\030\354\013=\236#\246=\000X\302\274\347P\215\275\013\316\232\275k\023\253<\353\303\316\273v^,\275\033\375\211<\326\237\001=\004\274\207=\250\200\204=@^L\274\377|\226\275\3467\232\275\206Y\237=`\343\026=+\312\024=\026\252\223\275?\n\236=\016\256\241=\222\026\232=\313\370\217\275\006\313\000\275\270\301j\275\217\235\241=\003\252\022\275X\326\033\2756\3242=\360\345\035\275>\035(\275\000\333\356\2736<\003\274\027\362\204\275\204G\216=\316\221\026\275\353&\362<nq\224=\330#,=\300MA<\2036\221=`\2117<\216\353\035\275Zs\241=\353\222\241<&\204\246\275vY\302\274S\201h\275\354\241\225=\253za\274\"\221\233\275\253\250\253\273\233\\V=k[\261<\273\334\327<\026\233\375;\313\202\376<FU\246\274P\310\007\275\n\206\237\275\313\221\200\275K\357\023=\250\033J\275+\341C<\300\346\331<\200W\301;\253M]\275\2406\243=3|F\275\232_\214=J\304\207\275\3466\244\274\270\2549=Sv\013\275\n^\217=\010\344j\275.R\217\275\353\351\031\275\353\264\\<p$\235=\356\363\"\275\020$\364<;&\253\274p\013\224\274\313\373z=\247C\204\275@\004\021<\033\177\240=\013\235;\274\032\203\204=[;\322\274Va\211=O\027\245\275\340\306D\274\340\320o\274\366=\335<\030\352\005=o\n\203=`jK\274\326\221X\273\270\277i=\026\266\270\274\266\234\225=\216Cc\275\026\276\023\274\253\252\222\273kN\030=\210\\i=\026iX\274\337d\215\275\306 )=\0205\314<\006\035\t=\270\216R\275>\256[=\326\245\241=\226\361\354;3i\237\275\320\234o=\000\025}\275\020\355\234<@hF<\250\301\037\275\226\263\355<\\\246\230\275\333{\233<{cX\275v\243\023\274\013\237/<\006f\221=h\333\"\275\243\253Z=\213q-\274\323\033\"\275\322\235\224\275\376\226\234\275\306\254\246=\273A\252\274\300d\210;P\024\271<\350\003h=\333\250\221=\342i\212=[\343|\275\326\277Z\274\323\372I\275{\005C\275\360\356\241<(2\240=\304\270\210\275\223\223N=P\3700\275F\367\204\274bx\207= f\232\274\226\244\370;f\232n\275HG\221=\026\1770\274\340\245y\275P\344\307<\246\261r\275\336l\207\275\226Y\246;\336O\207=\013/\301\274\200\247 =R\250\222=\240db=\330\0143\275\353\252\025\274+\323\326\274\253<\211\275\253j\0208dj\200=\022\312\217=\353\305\376;\240\014\233<F\305\023\275\222\323\200=\036\010\016\275\260\033m\275\240@R<\030\227L=#\337\231\275\362F\232=\220\223\365<{$o\2750\r\223\274&\021\224=\377\360\202\275&\207\307\274\266\346\337<\276\204\225\275K\036;=&\2561=c\262S=\270\235Y\275\363\373\251=KTJ\275*b\252=\204\311\243\275\023\017\230\275K\245Q=\353\261\016<\300\207\235;&\004=\275S.\017\275k\232\307\274\200A\246\275\300\350\215;\253xq<V\365\223\270+t\334<\357\357\241=\233\202\265<\313\347\371\274\200y\014\275\020cZ\275c\236l\275\000\343[\274\000{q\274\256\330\027=\000\346\021\275\\\016\210=\300\201o\275\253Zx9jj\231=Z\265\251=\266\270E\275\2264s<\340F!<\343\010 \275\233\333\353\274+\347\270<\360Ym\275+Fa<\020\264\023=`\202\006\275D\303\215=\326\264\263\273\006\336\032=&\003\251=k\253\320\274\273{9=;C\303\2746pG\274vbg\274V\267\007\272\350\361\000\275\026\002\240<\000\311M;#^X=\346,\212\274v\352\010<\006\362\375\274\352\354\216\275^ \n=\213\264.<\316\262\010\275 \320\346\274+\210\262<\026\340v\274\230\r_=k\254\232;#\357\000=\270\267\024=\340\200\247\274\326\256\023=\230\341{=VR{;\320\227\205<\326pF;\376Sl=\376\033\020\275Hq5\275\273\274\024=\233\210\224\275\000\036\257:\346\371\034\275\236Ja=\270\345\236\275&\366N=\250\331\250=\200!\212<k\357\265\273\347\376\247=\236\336\021\275k\321\332\273\270x\025\275\353x<\274\273^\224<\026[6<K\360\200\274\264\243\252\275@\322\213;\200\306!\273veM<\374\305\202=\276\343\245=\320\201J\275\353D\252\273f\303\010\275PK\235\275\323_x\275\\.\240=\250\004G=\373X7=\226\261==R\227\207\275\340b\017<\213\327\236=K~>\275\370\322\227=[n\263<\223$p=\0269\022\275X\\\035=>K\227\275\226b\255\273K\264\343<[\272\314<\264\320\216=\362\264\247=\344C\233=&+e=\200\372o=++0\274\002r\204\275\246l\375\274KG\031\274\263s8\275\313z.=v\242\357<\226L\\<\313\347\244<+\354\225=\013\246\370<\022\252\225\275n\304w\275Kq\026=\013\021:<&w&=\276r\252\275\307\200\235\275\213PQ=\030UZ=ng\232\275\253\220\001=\233C\205\275H?\201=\3336\326<\303\300\250=\246F\250\275\367K\244\275\263\306f=\226\205\227=\313 Q=\270\355b=f\277\217\275\316\017w=k\"\241\275F\202\230<\320\225_\275x\223\007\275\013\302q<\2304\006\275\353\006X\274\024\303\241\275\303\352\240\275N8\004=\243z\020\275\346\251O\275 \257\006\275\036\210\213\275Tn\210\275\223>L=\340z-=\000\3365<\346t:\275\266\037\343<\000Zu;\020\361s\275&\347\222<Ff\233=k\336\247\275\250\265\251\275\353\356.<\014\204\200=\246\262O\275\300G\226<\313\363o=0z\322<\206\274\223<PG\252=\216^^=\240\371?\275\200\007\354;\266`.=7\203\226=H\315\251\275v\3258=+3\306\274\324\036\247\275\306\210\227<\230\3239\275\000|A<\020\234]\275\177n\200\275+\263\347\273FS\345\274C\242G=\326n\353; 7\205=\026\336\177<\353\204\333\274P2g=\2537\225;\200!\200<\240\217\333\274\000\314\2349+B\203\274k\'\350\273s\031\205\275\253X\006\2720\251\215\275\326\334\222\274\206\321E=\243Xm\275\213\023f\275\360\260\246\274f$\273\274@\"g<\253\252b<\306\026-=N#k\275\326\264\300\273\236\347>=/\237\223=\2260\307\273\233\200E\275\273=\304<\260aB={?U\275\320\022F\275f\336\026=\253S\277\273\3071\241\275\306\316D\275\000l\n=@\213\347\274#\231k=7\353\206=k\235F<@\355\327\273k\262\330\274\026\024\212\273\353\204x<*]\202\275\206\'\243\274\360\365\215\275\270~Q=\233_Y\275W\351\233=v\372\257\274\233\212C\275\243\376#=\353\212K<\273[l=\020\177\016=\362h\244\275\333\343W=;\216\200\274\006\334\026\275\333\303X=\333\361x=\022\001\226\275\200\352\366\273\020\'\214=\2431\004=\014\310\217=\360\362\351\274@K<\275\007\302\222=\213F\016=G\326\243=\343\222\016\275\250([\275\340\010 \274B\262\240\275P\313\005=v\303{=\373\340\243<\200\347\006\2748<)=k\251X\275\030\364\246=\212\263\251\275D}\243\275\266P\241\274{h\213=\200\264\010<n\026\003=\0363z\275v\365\370<+\221\030\274\200\320\010=k\020q=\360^\024=+H\350\273\3534\250\273\330\023V\275\006\354\366\274\270\317]=\236\337\010\275H\373S=~Y\007\275\006\376\236\274Vu\350:k\235\234\275\000 Z\272\253\236\t\274+P\365\273\313w\210\274\273\214\206=N\346{=VWg\275\370\216\036=3\336\205\275\314J\221\275\313\255\320<V\206\240:\363;\037\275\320\233\244\275x$\004\275\246\002\344<&\370\235\275\372\313\245\275+9-<\340\345u\275\210\204\225\275\323\202\003\275\340\321[\274\360\025\233\275\360\352c\275@\013\263;\020\357\240\275V\347?\274^f\\\275\000\240l\275\223\'\006=B\\\203\275HV\201\275\366\247B=vE\177<\247m\233=Fy\266\274\200\336$\275\253\266\374\273\000\014\3359p(\202=f\377\251\275\353l\302\273S\375\026=k\367;\275\006r-\275\226\364$=\300\207\243\275\006\303\241<\272 \204\275\356\251)=J\355\221\275v\332Q=\003\217\241\275\354t\217\275V\367\240:\276{\206=\177(\222\275KA\030\275\300\344\225=\200\366d\274\276h\r=X.\244\275\206\257\326\274\016W-\275\350\341\217=\276\252\r=\010\020y\275\353 \\<\000\024{\272[>\014\275p\355B\275\000\211\342\274$\206\206=\203\257t\275\203%s\275\240\235\322\274\253\003\276:{\324\271<V\342#;\333U\244\274\260\367N\275@\374t\274\246g\t\275\363\342\211=\352 \246\275\370\270Y\275L\332\212\275 \206y\274\372\376\204=\226\230\225=$\223\224\275V\237l\273\343YH=xu\026=2\313\213=\326|\027\273\343Ve\275k\315a=\253\030\352\274\330\2740=\346;\250\274K\031\021=\206\200\231=\002\262\236=ZQ\233\275\010\311a\275H!\r\275+\253Y\2753\301\243=V+\361\273\226kb\275\306\343\027\275[\212<\275\250B\013=<\335\224\275P!\237\275\220<\250\275\306\363\022=\033\306(=\270\376S\275fI\251<\220\367{=\200bF<\220p\220\274\200\277\311;\313f\022\274n\334+=\353\304g\275K\027-=.b@=#\316N\2756\\\213=O\240\247=;\220\006\275\0136\277\274\370\032*=*\264\205\275\246\373\006=\366D\237<\016\'W=\003>\224\275\213\311\215\275\200M\031=f\347\365<\314\331\236\275\010Y>\275\006(\234\275\376\211t\275n\002\032\275\266;\215=\253\342\207\274\223\013D=2\024\242=~\216\033=W\310\230\275F\304+=C2\002=\"G\204=\370Y\250\275\353\354Q=\237\262\213=B\310\236\275\213\331\016<\214\261\221=(Ax\275\000\377\337<\326\323\026=\220\353\262<\223\260\251=\007\275\213=\236l\222=6/*\274\352#\217=\343\013\237\275\21018\275p\002\222\274p\312\312\274\327\244\235=\276\376 =>\301[=\233-h=+\372~\275`\"\036\274K_G<v\216\261<V\206/=\240\321\007\275\366\330\315\274\312\315\216=\2207\267\274\260\032m\275\006pg=\300\"g=\313\017\326\274\220z\210\274\360\334{\275\316\205\216\275\266[\000=\250\320\021\275\362\335\207=\262\247\210\275+\271<\274\000\327\353:cm/=3 \212=\010\'g=\353@\026=~\253\034\275.\303s\275;\256\230\275+t\207;\267\206\245=\333\252\201\274\000\352e\273~\013x\275\326\225\321<PfX=SC\250\275#Wp\275\010\324|=\233\241\241<\026?\252\273\213\020t<\200\226O\274~\224n\275\336y\237\275f\177`=`c\"\274\240\210\375\274\3464\260\274\313+:\275\3131\312\274\263\200\222\275Co\177=\203a\013=H$,\275\320\000\351\274\213\"\031=\220\313\374\274\320\003\264<k\367\273<\366\335V\275P\002\253<\326\022\247;\272\016\225=\240\000\367\274\373}\257\274\350\013\223=\347]\213\275VI\305;\017p\244=\376\n\031\275w\235\243=\202p\227=*\307\236=\313H\002\274\010d\232=\276\271\024\275+\256\351\274x\032\001= 6\220<3+<=\0260\242=\303\253U\275\233\'5=fe\344<\233\0234=\320\331!=v]\377\274/\343\206\275X\231\210=\363\243B\275C9Z=\242\225\242\275\2664l\274V\211g: <l<\253\271\334;\320\034\327<\300\005\030\274&0\247<\232\343\250=F\334\\\275\353\025\225\273xK\002\275|\277\225=\364\030\222=+\355\024\273p\242\354\274\370\345R\275\316<t=+\013\274\273J\274\240=@\246B=\244b\225=\373\373\206=\026\320]\275k\321\307<s\211\r\275\336C+=\200\203\365\273\300d\354;\263\021l\275x\207\230\275s\211\000=K\244\236<\2001\355;\356\324g=6\210\016\275fU\362<H\376;\275\320r\215<\020\332\233\274{\013o=\272>\225=b:\224=\200\254u;+HI=\006\205\252\275c9H\275K\004t<V\251\3639\\\374\205\275\376\023\027\275\320k\037\275\017\027\251\275\2006\002<V\257h=\343\210\n=\300-\"\275\237\267\234\275\240\260\211\275V\233\312:\310\316j=\013;\n\275\036\2749\275#\0266\275\353c\354\273\014\023\242\275\227\232\226\275\257\000\250=\220\311\"\275\253Av\274;\246\266\274\206\356\225\275\353\262p\274\306\371\320<\333\231\n\275\326\302h\273\253\376\320\271F\346\251\275s\rx=\"\334\211=\023\271h=\306/\340\274F^2=\304\346\237\275\366\341\250\274\373\327\212\274`\025\361\274+\\\017=\376\207\033\275V?\036\274P\037\305\274*E\240\275\326xa\274\316\242\220\275k\010G=\026n6=\022\341\237=\313=\345\274@\334\212;`\272\205<\326\\\252=to\234=K\2470\275\2028\221\275\343\321\231\275V_$\275\207~\217=\373E\345<\024\253\244=\336\000}=VZ\236:\316\214S\275\367\247\246=f\347\210=#\307\023=;u:\275\233r\206=\300\210\370;\200\263a=\020v\016=8@5=\203\301\225\275NC=\275\326\270L=V9\216\274\377y\224\275C4\233=V5\354\272\217\254\211=\\e\205\275\266\t\353<\320\221\000\275h\243\017\2756b\216\274\260\257\374\274~\t;=\300\264\201\274\ng\201=\346\305\233<\000\367R\274h\'E\275^F\234\275+&\307\274\360\n\236\275\313\364|\274\000\206\262:\200\371\257\2730\253\'\2756\350l=h;@=\2061\250\274\340\334\006\275\310\227V=\362{\224=\334D\234\275\026\177\223\274ki\375\273\273*\367\274\037\263\221=\340\254I\274\022\263\220=V\375\3279v\031\024\274\256\031G\275\266\375\342\274\266\371\333<\013\374\026=\253PB\273W\236\242=~?l\275.\337\002=\037\267\231=Khm\274k~\207=\253\r\264:\020\233\177\275\326B;\275`\031\376<.\266\023\275[0\244<\306\372\247=v\343\347<\000\220\377\273\313\242\252<6\250D\2758g\217\275BJ\200\275\3634\217\275\266\030\214<\326\370\204<F\016\021\275\016\360\246\275\343\3468=\373\254A\275v\360c\274\326\031\217\275\346\220@\275\376c\016=\306\003\237\275N\244B\275n\350\177=h\r/\275C\014\016\275\306\254\277\274\363\347\021=\200\347_\275K\345\010<\306f\013=V:\306\273\266\340v<R1\202\275\016Q\032=\366!\377<\266A+\274\204\036\215\275f\206\010=\363\273^=\300\316n\274\036\342 =`\t\375<\263\205\010\275V\220\275\273_\343\251=\000D\3169\273\336\207\275\226$\307\273\223\317)=\253\326\336\274+\3002\275l\227\214=\300\2214=\340\365g\274\300\201\213;\300f\020\274\340}\236<\326\027B;\200\215N\275\013\366|<\000\327\016;\026\214\260;\370\023\002\275&\352\256<J\002\212\275\233\020\314<^\3678=`B\026\274\353\222\204\275\253\322\236\271V\025\3708\257}\223\275flq\2750\333\235=fA\177=\000+==.vl=\223f\003=;\031@=\216\022b=\346y\237\274`\220-\274\363bs=\000\300\373\267\333\031^\275\262U\204\275;\346>=\324]\215=\266\212\204=\2537c<\243\235k=\333\261\234\275\003\353u\275~8\244\275\370\200\211=V\253E\272\006,\035\275\006\377\346<k\213\377\274\203\351Z\275\326\246\003=\253\375y<cot\275\303\322`\275v\n =_\305\201=\253K\336;Vr+\2756\322$= \037n<Gj\225\275\0103]\275\200k\225<V5S=\353P\333\274\316\013%=`dS\275\022Q\243=\0167s=\240\274\177<N\333\027=\320\254\355<{kI\275V}>\272K\n\266<k\026\232\274\367\250\243=n\241\003\275\317j\230\275+\200\"\275\246d\236\2757\243\214=K:\031\275+\'p\275@\227\023\274H\376e\275\260M2\275\343\003.=\303\"\200\275^\370 =\326\351x=\000\000D\271\203\220\027=h3?\275\267\026\205=\356\312\245=\006:\242<@\206\233=\024\200\251\275+\352\025\274 \244\207<[W\224\275\210\032&=K\026\002\275\233\350\366\274\316h\207\275\013\213\013=\006]x\275\240\335\220\274\210\241\027=3\222\200=@^\232<\360\251\376\274\333w\024\275\243\225?= R}<\373\252\217=\226\212\000=l|\211=R\206\211\275\'4\211=\270\323\034\275F\275\266\274\253\300\002:\220\005\200\274\020\t\207<\236\024\230=\016\361K\275k\357\322<`*\211\275\340`V<\337\230\214=\306\'f=\016\'\222=\243\3058=\353\353\341\273\360=\262<\263\240\016\275\243\335\220=@\350*=&\324y\275k\221\223=V\025\242\272\253\304r\273\366\325\272\274p\035\264\274\300\253\210;\250\242&\275\\\301\236\275\246\322/\275K\331\207\274\304\340\200=\213\032{=\273\202L\275V\263Q\273`\007\305\274C\2326\275 \027p\274f\336\354\274\330\311>=\273G)\275v\017R<\213\236@\275P\020\325\274VZ\206=\250\222\'\275V2\244\273\270\376\242=\213\247\351<\000\275-\275\006\360L\275\300d\357\274\313\306\325\274\260\234\024=\026\306\227\274W\360\217=\210H;\275\360x\325\274\246\213\370<\302M\210=0B\243=K\210Z<\2003f;\360\355\030\275\030\334@=\203\332E\275\240o\263\274\204\244\216\275\272\021\244\275\366\311>=\200\203\271;\030\r\210=\003\316\207=\243\0353=\203\231\010=\360)\261\274@I5=\336\"$=\000S\354<\326\246\035\273\200\360K<V\331\3019\336\266w\275+y\236<\373\355z\275\213\235%=\243^K\275P\376\336\274\340\340!\275\210\265\206=\220_p\275\033J.=c0+=\033Yq=\200\013\253<\323\023:=z\351\206=\026x\206<f\036\350<8s\205\275\220\034\267\274@\230\367;\353k%<\333/\361\27460\251\275\326\210\261\274(\255\002=\277\364\222=\363\035\232\275\336\366\"=\357\360\241\275w5\243\275\026\302U\275vV4\274&\252\276<>\313\201\275\n}\203=\246U\232=\000\002\250;\200\353\212=\340\206\032\275\230\007\007\275\20000\274\000/\025<\006\034n\275\302\250\210\275\213\326\006=\300\324\304<8\365\246=\200*\013\275\300\023\361<\273\275\t\275\300\177(=\000D\227\273{\010}=V\242==\323\r\216=\340h/=\200.M;j\023\223=6~H\275o\370\240=\364\305\246=J\010\243=\246q\037\275\270\3334\275\300\303\254;\266\224\324<\3308+=>\322\n=$R\221=\020\t\253\274"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
