ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "x.1"
    input: "x.1"
    output: "1"
    name: "ATen_0"
    op_type: "ATen"
    attribute {
      name: "operator"
      s: "add"
      type: STRING
    }
    attribute {
      name: "overload_name"
      s: ""
      type: STRING
    }
    domain: "org.pytorch.aten"
  }
  name: "main_graph"
  input {
    name: "x.1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
opset_import {
  domain: "org.pytorch.aten"
  version: 1
}
