ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "2"
    input: "input"
    input: "offsets"
    output: "3"
    output: "4"
    output: "5"
    output: "6"
    op_type: "ATen"
    attribute {
      name: "mode"
      i: 1
      type: INT
    }
    attribute {
      name: "operator"
      s: "embedding_bag"
      type: STRING
    }
    attribute {
      name: "scale_grad_by_freq"
      i: 0
      type: INT
    }
    attribute {
      name: "sparse"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 10
    dims: 8
    data_type: FLOAT
    name: "2"
    raw_data: "\353\205\253\277\257\213\200\277W\327\004\276@\026\020?\373\214\350=\336\220\n?\'\323\234?\304/\"?\334\250\241\277\364\233\204?8\270l?\331\003\353>\372\330\214?\205>\216?\257\336\312\277(\345\240\277\033\013\266?B{A>R\260\335?\246\037\005\300Y\374\232\276 Wj>Ut\314>P\364\321\276u\310\303\277#=8?\2278\322>6\236\254>\303s\247?\370\216l\277\032\030\204\277\207\245\267?C\236\017\276\006\310\022\277\335\305/@\r\347s\277\375\372&\274\3270\"?a^\217\276\022Y\240?t\030\344\277\264b\323<\275\251\276\277Z(\377\276\007\3131\277\205\356\"\277\377\374\357>\030\355.>\207\326\340\277pP\365\276\264)\252\276e;.?\371\373S\277b!\205?\322\201$\277\336\307\337?\231\321\302\277g\312\310\277\222;d=g\352\230\275\016\340\303>\264\002\260\277\241 \033\277\374SV\274\001\r<\277\223\322\265\277\324\031\213?G\352\030\276A\306x>\266%\240?\023\017$\277\371\274=\277\220\333\202\277J\307l?\020\347\260?{\272\315\276\2713v\277\356\204\322\275\246r\177?\243wP\276"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
