ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::ConstantOfShape_27"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Concat_28"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::ConstantOfShape_27"
    output: "onnx::Concat_10"
    name: "ConstantOfShape_2"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Concat_28"
    input: "onnx::Concat_10"
    output: "onnx::Reshape_11"
    name: "Concat_3"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Reshape_12"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Reshape_11"
    input: "onnx::Reshape_12"
    output: "onnx::Slice_13"
    name: "Reshape_5"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Slice_14"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_15"
    name: "Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_16"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\200"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_17"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_13"
    input: "onnx::Slice_15"
    input: "onnx::Slice_16"
    input: "onnx::Slice_14"
    input: "onnx::Slice_17"
    output: "onnx::Transpose_18"
    name: "Slice_10"
    op_type: "Slice"
  }
  node {
    input: "onnx::Transpose_18"
    output: "onnx::Reshape_19"
    name: "Transpose_11"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "onnx::Reshape_20"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Reshape_19"
    input: "onnx::Reshape_20"
    output: "onnx::Cast_21"
    name: "Reshape_13"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Cast_21"
    output: "onnx::Pad_22"
    name: "Cast_14"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "onnx::Pad_0"
    input: "onnx::Pad_22"
    output: "23"
    name: "Pad_15"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  name: "main_graph"
  input {
    name: "onnx::Pad_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "23"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "Pad23_dim_0"
          }
          dim {
            dim_param: "Pad23_dim_1"
          }
          dim {
            dim_param: "Pad23_dim_2"
          }
          dim {
            dim_param: "Pad23_dim_3"
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
