ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
graph {
  node {
    input: "input"
    input: "9"
    output: "6"
    name: "Upsample_0"
    op_type: "Upsample"
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    data_type: 1
    name: "9"
    raw_data: "\000\000\200?\000\000\200?\000\000\000@"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
