ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "0"
    output: "1"
    op_type: "Shape"
  }
  node {
    input: "1"
    output: "2"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "2"
    output: "3"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "0"
    output: "4"
    op_type: "Shape"
  }
  node {
    input: "4"
    output: "5"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "5"
    output: "6"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "6"
    output: "7"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 11
      type: INT
    }
  }
  node {
    output: "8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: DOUBLE
        raw_data: "\000\000\000\000\000\000\360?"
      }
      type: TENSOR
    }
  }
  node {
    input: "8"
    input: "7"
    output: "9"
    op_type: "Div"
  }
  node {
    output: "10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: DOUBLE
        raw_data: "\000\000\000\000\000\0008@"
      }
      type: TENSOR
    }
  }
  node {
    input: "9"
    input: "10"
    output: "11"
    op_type: "Mul"
  }
  node {
    input: "11"
    output: "12"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "3"
    output: "13"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "12"
    output: "14"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "13"
    input: "14"
    output: "15"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "0"
    input: "15"
    output: "16"
    op_type: "Reshape"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
