ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::MatMul_1"
    input: "onnx::MatMul_2"
    output: "onnx::Mul_4"
    name: "MatMul_0"
    op_type: "MatMul"
  }
  node {
    output: "onnx::Mul_10"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_4"
    input: "onnx::Mul_10"
    output: "onnx::Add_6"
    name: "Mul_2"
    op_type: "Mul"
  }
  node {
    output: "onnx::Mul_11"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_0"
    input: "onnx::Mul_11"
    output: "onnx::Add_8"
    name: "Mul_4"
    op_type: "Mul"
  }
  node {
    input: "onnx::Add_6"
    input: "onnx::Add_8"
    output: "9"
    name: "Add_5"
    op_type: "Add"
  }
  name: "torch_jit"
  input {
    name: "onnx::Mul_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "onnx::MatMul_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::MatMul_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "9"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
