ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "input"
    input: "weight"
    input: "bias"
    output: "3"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 5
    dims: 4
    data_type: 1
    name: "weight"
    raw_data: "z(\334>Z\272\263\276\204#\226>\230\340\177\275\036\235\234>0\021E>\016\255\312\276\24080\275dj\201>@\244\366\2754\373\001>0\355r\276\340w\206\276\370\214\330>\020\355\177=0\032\233\275:\255H\276X~0\276N\022\357>\303v\324\276"
  }
  initializer {
    dims: 5
    data_type: 1
    name: "bias"
    raw_data: "0l\326=Z\277\360><\017\275>\320\3473\275\t#\202\276"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
