ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "1"
    raw_data: "w\243\202=\240^\031;\034y\245<v\t$=(Q\222\275\006s\240\275\306\347.=@\\\242:\214m\372\274\000\357\347\271;~\026\275\242\307M=\212+*=\010{\n=\246\310\260\274\202E\021=f;6\275\356\"\016=\226 F\275A*\221=\336\344d=\352\n>=i\226\215=\330\tY\274\366\256\217\275\360wx\275\307\375\222\275\224\014\250\275\320\327\003\275s5\037\275P/\335<\235\362\245=\262\333\r=(ka\275\000\244L\272`\037\036\275\216\2005=\260^\031\275\t\027\251=\3005\231<R\331a=\021\215\200=P<\303;\352\3736=\032\272N=<g\254\274\020|\242;B\263.=oO\223=@k <\036\266@\275\350\227\246\275 \356+;\2004D;d8\223\275D\322\216\2740\231\270\273tz\251\275\200\260\356\273Zoe=\2258\207=(k`\275Q6\244=r\373z=b\337\007=\000\307\242\275\223\361\205=\210h&\274\331\313\227=\313H\001\275[yR\275:\210(=\300S\334\274\270/9<\243d\002\275\363\036\\\275,\025\311\2740k\215;8h~\2756\037\320\274\300\301\305;.ti\275\220\371\207;\273C\207=\264?\357<s\253{\275\024\221\206\274\000\366\347\273\031>\210=`AV\273\266rx=X\242V\274\350j\036\275\020N\237\274\250\364\016<\261Y\204=4\r\220\274n\215V=@I\010<\304\200\312<i\270\246=&\200\377\274>\247 =\030\331\207\275\360\326|\275\240\3656\274 \243\"\274\340\273\250\274%\203\220=\223,<\275\0309\022\274\350\221c\275\'=\215=H\216\024=\000&\261\274[\332Q\275\000RG9\360\017\357;\220^\321<\370\340?\274\266\303K=\034\346\267<\267\227\223\275\014\335\205<\334b\255<\026\\u=@\375\024\274\311\255\225=\300_\255<\234\315\322\2746[B\275$\262\225\274\300\334\377\272uH\224=@*\302<\251\203\246=\312}K=7\307\201=\317\325\251\275\300\000\215\27285\241\275@\002\225\274&m\035\275\300@\232\273\260c\244;\000\276&<\no\\=`\210H<\000\216\203\274\030\315\020\274CQ\207\275\316\004g=\240\024\371<\262Zh=\222\212\224\275\006\337\023\275v\222?=\256\256B\275\325\236\235=z\037\r=\260\261\326;\000\005t;\006$\242\275\300\206\204\273@<\321:\222\324j=\303\224b\275\376\210{=\240\265\010=\352\365r=HDd\274\027d\213=\000\314\370<\000\360\215\272\035\373\245=\322B:=P(\017\275@\231\301\274\000\270C;\356\215k\275zAp=3t\240\275\246\014\366\274<\340\246<\320\343\230\274Xr\031\275t\371\247< \226\033<\215o\227=+\274\246=\230;\021\275,f\355<2\267Q=\372MO=B\276\222\275D\352\233<\205\302\245=\263\315.\275c\034\245\275\330\325v<\202\265\023=K\342}\275\306\271\032=RhE=\346\307^=J{F=\350&+\275(\254\'\274\034\270\231\274\026Ur\275\200\331\204\274\233\034\204=\324\307\244<Af\240=Xe\024=\331R\237=\300\202\320;\020\225\334;\001y\210=\"_\210\275\374H\205<\000\352d\275v\377\246\275\030\361U\275\013\332\241=`c\213\274{LK\275\301W\200=\371U\200=h\316E\274\002\267\030=\020\240\001=\003P\217=\023\373\245=\356\213<=\300\236\370\272H\020\000\274\354\355\220\275\322\2470=\220kD\275\210A/\274nBE\275\231w\234=0\327\310<x!+\274 \0366<\220yE\275\347\021\252=4?\212<\346D\273\274&$,\275\206\306\002\275\214\221\275\274\003L7\275s\260>\275#\310O\275\246\257\002=5\270\203=\200\245m<\226\031S=\004o\350<\302\264^=\"\370?=P\205\341\274\226}\205\275B\263\002=\257\267\214=\206\235\234\275`\377\257\274\344\254\342<\216\264K\275b\327f=\240\330y\273\240\t\000=\004\272\216\275%B\227=\266\322e\275\002\200\033=L\030\204\275\240\240Z<\230][<\010|\026<\3532\247\275\240\266\034=\345\347\220=\000\377\224\2736Y\314\274\226\377U=\200\323\221\274\266G\302\274\200\272\001\274\013\264\240\275\223\037w\275S\366\245=\254\332\202<\320\356\245\275\3475\237=\273e\216=\216\247Q\275\310\222\252\275\200\207-:\036\242v\275`X\t;\236eD=\354p\220<g\357\222=q\227\231= \376p\274y\245\215=\254\211\311<8\221\177<\254\216\217<\244\033\213\274\300\252e\274v\327\020=\314)\226\274`@\227\275\260\224\271<\033\017\031\275\212$M=\345)\247=H\217-\274\342 q=j\341\240\275\311q\223=Kz\200\275\020@\204\274\345\374\251=\203\313D\275\300d\341;{\234\017\275\333r|\275>lL=\346Ai=k\361p\275\000\245\013\274@\264\213\275\006I\027\275`p\206<\223?S\275w\240\245\275\226\315\341\274)\247\245=\314\320\271<i]\227=+o\'\275\240\033\020\275\200\237\t<\342\255\231\275HD$\274H>[\275\0209\271;\260\374\005= \234\241<N\262$\275P\313\244<h\365g<>\333\014\275(\326\'<p\274\351\274\207\375\205\275\220\361\303<i\022\220=\230\034C\274\314\340\365\274@AQ\274\314d\300<\330\351\t<~\260\237\275@\000\301\274\000\274\231<\370\342U\274\030\271\223\275|`\355<@Z\226\2726;\356\274\250Un\275`\035#\274V\320\234\275F\246\010\275`i\217\274\310s\016\275\320\214\271;\020$\236\275\263\257o\275\016&P\275h\246\245\275~\\T\275\242\0372=\357Z\246=G\314\206\275\360\327\021\275&\347\031\275c\317h\275p3\232\275aX\207=\360\356\277;\2216\204= I.\275\271s\250=l\035\322\274.\340N=\034\233\375\274S\017\226\275\300\270\006\275S\312$\275\210\350V<@\001\245\274\336\027\252\275\222Bi=\263\362\217\275\227\373\236=\342\211P=y]\202=\323\341U\275\343\317\222\275\363\"\243=\3111\217=:$I=\272\231|=@1u< \201!<p\022\222<Z\372x=\216dZ=\2502\031<\242;b=H\227d\275\200\213\033:V\243\310\274\035\326\236=\275\023\205=sNL\275\206E9=\013\037\251\2751\020\246=\270-I<.\'\240\275\236f-=\214\210\254<\252\227v=:\356\221\275\220\226\261;S\0036\275\\\354\245\274\352b\212\275\010\357i\274q\345\224=\350S\246\275^EQ\275\240\274\307<\203\350h\2750y\004\275\371\336\237=@Q\236\273\360\242\341\274\346I\274\274\317\301\243\275\304\272\242\274\240\233g<dO\216<0\254\246;\004a\332<\310-\034\275\022\266[=\231\211\226=`\317\025\275\303\265R\275\340\023\031=\373\331p\275\254\221\374\274\266U\260\274\000\027\311:\030\215N\275\016\300+\275\201\307\233=\376\002\013=\350\255)<f{\275\274\013\rV\2758(U<l/\336<\242\366l=\247\267\241=V\034\226\275<\355\213\275\215Z\246=\203\352H\275\200\030Q:\332\2042=\200\010\374;l\016\203\275\023\275\212\275x\350]\274\034\033\330\274\002\306p=\305\271\224=\275Q\226=`G\022\2750d\241\273.\034\177=\247\023\215\275\212x{=(\224N<\260\255\336<\017h\226\275k\'E\275\201\344\232=\2762\033\275\240\277\372<\024.\202\274\006\204\030\275\036\252T=|K\300< \341\372\274&\263\204\275\200K\'\274\021}\203=\320\261\350\274s1\245\275rR:=KTW\275ly\204\274vaf\275\352\026H=\360,t\275\2768v=vW^=v|Y=\306\227\360\274\230,d\274\246\251\037=\344g\243<\212\373A=>n!=\233\352\235\275\242\322x=\202\307\222\275c\027x\275\212;l=3\022C\275AT\243=\240o\021\273j\215\245\275r\236x=\335\337\215=\r\267\204=l\022\224\274\024\246\305<\n&n=\310\367\022<X\264*<\000ne:\352KC=\333\300\t\275\220\005\030=\000$\3519\006m\010\275\243X9\275\006\342\n=x\272\001<\367s\250\275\0000\350\270C\025\215=\034C\342\274\205\312\247=\330D\034\274\200\257\032\272CB\200\275\246\\#=\350\035W<\370\002\001=@h\264:\245\023\231=\300WQ<\246\274n\275\340 !<\304\201\273<\210-!=\243\352\230=\010\250]<\376\370t=\371\260\242=&\203)=<\277\352\274\032\n/=\360D\244\2740\312\245;\266d\010\275|\217\210<\220\026\227\274]\234\223=\336H,=\0007\022=V\025\212\275\200\233\261;\034\240\225\274\030\322I\274\022\375F=Ly\212\274\212I\220\275\336e?=lt\220\274\240\304L<\226m\027\275\014\331\324<6S\230\2758\373G<C\340K\275\020\252\206;:\356W=~\354\243\275\200\"\023;\306\331\000\275\200\244\022\272\020\374\260\274@\214\225\275\2067.=\300)M\275\212]\023=\000\245}\275\231T\250=\366\244Z\275\2373\213\275\300@\225;#\203\014\275\262\206(=\366z\235\275+!\204\275nG1\275\014v\261\274\364\035\214\274\002\310\005=\220\251\253<B\0366=\320\325\363;,\027\351<Hl\030<\320\217J\275\376\226\021=\362\261I=^\323f= /F\275O\341\242=0\264\251\274\024\312\325<\223\220e\275\270\330\233\275\360\251\256\274 B\021;k~\246\275 \203K\275I\200\223=#\343\234\275\250\330E\275@\021\326:\026\265\002=\200\007\357\273\377M\234=b\324K=\236+\230\275\343\317\020\275N\020n\275\3468\237\275\222\213X=XV{\275\370<\025=\226#_=\031\334\231=\260+\326;\024`\321<E\363\242=H\001\201\275\343\233b\275p\314\234\274\2748\247\274<\262\332<nY;=\324\007\304<l\235\241\275\230\301m<\326\200\006\275\341\232\247=\232\0161=p\273\257;\027[\223=\032uQ=~\256y=@\243\r\274\330f)<\236VP\275~\316\035=\"\212P=\227\226\212\275\356:0\275\23267=\030\224P\2758?2<\224T\304<\340g$\275\014\205\202\274\341\206\224= \0340<\346\003\373\274\000\265\217<rU^=\346\262j\275\022\004>=\0323\\=\353}\226\2759\260\200=\240\036\035\273f\304&\275+\3361\275\230\215\230\275\246\264!=U\262\235=,X\210\2752\360]=qF\202=\376s#\275c\313?\2758\260\217\275\306[\'=x\177\206\275\300\017\033\274\r\367\235=`{c\273\010+\014\275*\266\022=\320\342\370;\310=\237\275FB\331\274\333\377r\275L\036\350\274\224\207\266<\260\020\366;\223Us\275biG=\322BB=\274\274\207<|\244\317\274\204$\355<`q4<\353pH\275\377\247\200=\226T=\275\326\257\305\274&\263j\275\\\245\242\274j\263T=\016~I=\216\277F=\343\033\203=S\233\245\275P!\345\273\300D\025=\242?6=8{\202\275\000<i\272\250\032\002=\250\340 =\030M <\336\317\033\275\313c#\275\214)\245\275`\362)=\326\273~\275\013N\234\275{IG\275\276\210\223\275lb\250\275`\001\316<\303\001\201=\000\301Z\275A[\214=\336C\177\275\022\330^=\356\367n=\262^{=\270\273U\275\254\231\331<\250W\006=\326\236I=\016\364>\275\365p\240=\226\235\265\274\010|\003=\376\004\016\275\270\026\023<\200\335N<>\204u\275\227\306\243\275#\014D\275\340\\^\275\374Z\217\275\2666r=\200\323\300\273\252+\'=N\303a\275\000\024\000<\010\'\022=\036\315!\275\240Ox\273\010\270\203\275 \020,\273@\2010<\034\223\207\275\006\270T\275\276\353i=R\213[=\200:\303;\262\326H=\270\001.<>K}\275\333cO\275\330$X<bQo=\021\371\216=\240vI\275\227u\236\275\023]\211=\213,*\2755\370\201=\000\322+;!l\230=\020t\224\275*\246|=\377\325\242\275\014\367\367<f\0364=\201\323\220=T\177\225\2742\354&=(\320\031<\353\252N\275`l\251\274f\363.\275\324\300\244<\200\314\211\275\300\221\325;.\261R=\200zX:F\314\277\274\300\025\227:\300V\214\274\256 1=\252D_=\320\260\200;l\025\223\274\0051\242=x\016w\275 \240y<\243\243\233=\256#n\275,l\215\275\013\252\241\275\206\325>= \014\302<\215o\215=6\240\'=--\222=\010\313M<@\345\024\274S%\224=\177\337\222=\372\313P=\250\256\024\275\256O&=\2059\207=K\275\t\275JtI=\233\000\220\275\033\243\247\275\260\367\327\274Z17=\035G\237=\220\032\245\275L\007\212\275@\264\006<\272\3242=\256\235^=J`\217\275&\230\260\274p\344\225\275Gd\223=\310\365$\274\020\350\317\273\370H{\274\016\204[\275NUH=\0340\343<s\373\210=\362\267%=\315k\210=\000W\214\272\210\214=<|\017\242\274:\024*=7\037\217=p\351:\275\\[\377\274\357\213\201=pk\016=\350j\014<\222\2015=\240mF\275^&}\275\212\350N=l\005\332<PWo\275\322\354\203\275\232\325\222\275`!\377\274h\037X\274\020\317\322<\312\373\010=>\010\036=\326\"\000\275\206\371d\275r\212o=>\314-=\353\000/\275\210\206\027\275V\267k\275\254L\236\275%O\217=\374\364\270\274\326;E=\300\211\247<*N}=\230\374\022<\000\020*\275,\312\246\274\230\265P<\305[\200=N\207\020\275/\227\206=\322\010d=\356\030\021\275\236Co\275\307\332\225=]\212\202=\313\271\007\275\036\201i\275R\030s=V\206\350\274\334V\234\274\023\306y\275\306\270I=#\311m\275 8\301\274\000/\306<\014\234\255<l\002\254<\325\303\222=\226\\\323\274r/\226\275\236\010u=V0\324\274\232;E=K(\225\275.\014%\275\213\363\201\275\357\201\204\275\322FM=\000\312\223\275sf^\275\210j>\274\340\266\370<\217\247\226=H_e\274\013X\233\275\223&M\275\326,\017=P\034\313<-\n\250=E\367\233=\361\357\201=\257\223\236\275\343\'~\275Vhh=\253V\017\275p\354\253\274\370\254?\275\250\036*=r\304_=\016\'K=B\320\036=\350R\001\274\243)\204=\240\030*<\255,\212=\300K\247\2738\017p\274\326\371\216\275\000\205<\273\372\225\004=\223:\025\275 \2779\273\366~E\275\346C\025=Z]\224\275\330\373U\275\330\374z<lG\213<h\361\036<\340\374\036;\240\204n\274\204\322\214\274\3648\367<;\021\241\275\240\265\235\275\377\210\207=^X[=\226\251\200\275\227\227\241=\312\355P=&\206\340\274\034\253\376\274\212\342I=r\3423=\220\'\337;\016\314G= \273\320<\301\345\201=L \346<\265\262\237=\007I\226\275n\254j=\310\206\200\275$\263\213\275\300\204\'\274\261l\216=\273\r<\275\310G;<v\223\031=\202\037S=\010\353\002=\354\324\334<F\200\345\274\314\036\306\274\226\032\341\274\210\007.\274\\]\213\274\240\017[\273P9\240\275\310F5\275\273\214\215\275r&a=\214\021\200\275\260a\202\275\320\364\201\273\224\232\233<(\353#\275 O\326\274j7A=\014\344\236\275\2134W\275\200-\033\272\363\363\r\275@\226\264\272\003\247z\275\306\305\031\275Q\300\226=\353DL\275\360\251\211\275\222Ca=8\234)<`I)\275\220(\230\273P?)\275\032\3331=\2059\244=(\322\003<\26358\275\376\340g\275X\262\210\275\313~\023\275G(\215=\001\224\221=\300\304\276\272\336X = \261\204\275\007\332\213\275\222\312f=\327\261\237=\313\201\222\275\022(D=p\273\365;\337\310\202\275\260\243Y\275g\316\233=\346\363i\275\340\0255\275yf\241=+\342,\275\226\305L=nB\003\275\312\036e=\230\360b<>2/=\000\214\271\271\354E\360<\226Y\004\275\350\220D\274S\024\220\275>D\032=m\033\210=Z\342E=#[\242\275\236\350e\275\322}C=\310l\003\275\004P\212\274FR:=\014\035\317\2748\310\014\274\000N#\273\376\025J\2753\002\243=@\350\251\273\000 k<.gW=&\035\214\275\000\373?\275\354b\244<\266\305\207\275\014\036\205\274\376h5=\226\272k=\354\246\302\274\331\365\222=:\027Z=tT\205<\264\342\201\2753\357r\275@\347\240\272\010\321q\274\n\014f=\324\006\217\274\251\225\243=5\235\215=0\035\013=-\307\250=\244\310\201\275\252\002m=\223y\212=\200^\366\273#G\233\275\2167\035\275\304n\204<\316\336\010\275\220\317\201;\346\324\033\275\204(\252\275\361?\226=\254\036\326\274i\374\215=>Eh=\335\300\226=\252\\\217\275t\303\211\275\327Q\204=\2268n\2756\023\034\275\030\243\005\275\266\350\221\275\250\335S<V,\034=\240+\303<\256\233?\275\235)\252=xK\034\274\220\302\223;\240\372+\273x\326\026\274\274\244\210\275\260\027\213\273\206\215\002=:\332\231\275\266f\274\274\241\365\207=\350\037p<\020\235\311\273lc\277<\340\377=\273\234[\324<8O\014=\035\303\240=h$\017<\253\331\'\275\332xf=\300\354\356<\200\370\252;@\356\312<@\276\277;\254\252\242\275M\361\232=\220jD\275#\213\210=\302\272\013=\020\014\273;\203\300\240=\376\2622=4\346\236<\230\000\006<\036\364(\275\210\230%\274r\327N=\356\206\033\275Z\020\007=\326\273\251\275SA5\275\361\264\242=\246k1=\252\250k=J\n\t=\3328U=\343r\224\275\036\314J\275\275\267\210=\222N:=\032\r\244\275`\241f\275\360\t\236\275q\351\234=\363\032y\275\226f/=\020\3169\2759\317\225=\232Iy=\317\366\247\275\360\322\201<\231\373\207=\256v\024\275\246E\275\274,\351\243<\373\323]\275/9\225=\364\352\245\274\315\317\247=\026b[=6\334=\275\272\024k=\t\036\213=x-u\275a<\234=\331V\222=\317\377\242=@D.\274F\372w\275\033\314m\275\000\3025:\000\362\377:\000\210\302\273\275t\216=\203;\024\275:\303B=\000\260\356;\201\332\246=\306Fy\275\010R)\275\000\203j\274\270(\251\275$^\224\275\264\226\205<\300>\261\272\267\177\201=\266\377b=\375y\247=\320X\327<\022u\177=:\013r=V\003s\2753!\233=\302Lt=P$\365<|)\206\275\314\313\207\275\270\246\016=\033\267\r\275\016\013X\275\232H.=\003\2341\275\346\212/\275\344\007\230\274\301%\206=\277\364\235\275l\024\351\274\372\210@=@8\200<\034*\305<\276\177\245\275\350*(<\234U\355\274@&\326\273\300{\242;^g\200\275@\020\304<\204\353\212\275f^q=#K\025\275\000L\3158\234\346\212\274\355\320\243=\360i\252\275\210\364\026\274p\t?\275\202\254y=X\207T\2740\276\320\274pn\322\274!g\204=M0\207=\323\244^\275\274P\325<P#\256;@\005\337<o?\226\275p&@\275 \332\010\273\200\307d<\346\263\236\275M\271\222=\350\0250\275\366\214\'=\206\204L\275\360\003Q\275\n\346T=s\235<\275`\024r\275b\237z=F\264d\275XE\004=\320\342\262< \344\241\274\275\365\245=\346\242o\275*\255l=\222\327\226\275vO\227\275\202H;=s\212J\275d\323\234\275\230s\"\274-\t\214=H\210\013\275\000\203\203;\274-\257<\353V\243=\260\234\037\275\032\347\005=,\270\221\274,\305\207\274\253\265]\275\0032[\275 ao;\302!\244\275\217i\233\275\202\316\231\275\314\247\224<x-N<C\222P\275\340\211J\273f\006\002=8\314l\274\202<J=\233~~\275\300\026\271<\t_\233=\315C\241=%\177\214=\366\341\247\275\253\304\222\275\350\341\017\274\002:P=\315\304\212=\200\005^<C$d\275.\325L=\370\271+\275\240C\023;\330-\022=I\033\217=\330#V\275bWE=2i\231\275(\253l\275\030\252(=\316\364\"\275H\341U<\3443\241<k5i\275\204\311\240\275$\017\230\274\000(\345\272`\007%=\300\354\223\272\n\226\235\275v\234}\275\\\037\333<\205\314\220=\206CV=\356\277D=@\026\343\272\014\257\316<\200\372U\273j\212 =\033{\220\2755\367\206=\314E\342\274\023\217\037\275\276\022r=\353\005:\275:\340g=\013Cu\275\357\300\224=\371\371\245=\300\034\265<>\266H=\254\036\251\274,Q\373\274\240yj\273p\356\340;\000\373\350\271\301\036\236=\235\327\237=\000\240\323\271\3227<=@\376\253;\250\262\216\275.\354\010\275\340\2321\273\000T.\274\300^.\275 \366\032;f\356G=\347l\233\275\260\357\303\274\244.\242<\227\032\202\275 \244{\273p\217\304;\350\016:\274h\332\026\275\223\3714\275\020\340\360<\303\272\230\275\223>\211=\332\227\030=\032y\212\275\256\206-=\263\251\236=\000\000!\272\200\375(\272\250\337?\275\274\307\200<,\317\303\274\340sE;\320\321\246\274K\3363\2750i\252\273\370S:\275n\3139=l\315\250<\320_\377\274\355(\237=\300\212\374:\301\354\212=@\272\335<\354v\301\274\\\256\275<l\272\364<%<\226=\210\354\"=K\375e\275S\242\021\275\270#\032<\000o\2319\n\245e=@\221\376:\000\014C\273b\240>=\000\265\243:\010\332\202\275\352\275\032=\242\007\031=\316\235c= \271\231<`\253<\273H\345\223\275\250~N<\343Pb\275f\'L\275\360v\340\273@\205\341\272\247\317\203=\273^\231\275\204\353\320<&\264K=\352\"5=$\n\377<H;\211\275\334\025\237<\340\262D\273T\311\206\275\026\212\327\274\240\330e\275\300\342\352:1\032\201=\300I\256\274p\014\240<\221\331\236=\2108F\275\"\277@=7\350\215=\244\247\207\274\270?H<\020[\314\274\240\212\005\273\256\354Q\2759\265\240=\326\302\244\2753\333\016\275\036\224u\275\216VK\275ke\013\275\342S\210\275p\340\307\274~\313c=|\232\355<\036\225\014\275\330p\004\275/0\230\275\266\030F\275\014\300\270<\314c\355<\300p\217\272\013I`\275\000\355Y;\330S*=0\235%\275\320t\014=\034\203\246<4,\222<\303\262\004\275\020$\006\275dO\213\275\202nK=\210)R\274\254n\210<W\346\227=D=\222\275\010\327U<\0145\240<\020L\300;\014\323\224\275\3329}=aJ\221=S@\235=\022Z;=\336\210\036=f\370v\2756\334\362\274\273FS\2750\231\214;\254D\352<\000\013P\275jNo=\225;\244=\200\307\016\274\265\360\237=\312\023\227\275\000\022a9\200\261\334\274t\005\204<\020\232\000=\214m\277\274\000T\016\274W/\247=\200P\326\274\026\234x\275<B\316<\310\230I\275\320\326&\275@$\002<v\237e=@E^\275\360d\353\274.\001i=E\202\210=zsf=\321\333\202=\320\251\356;\222\037\177=\271\244\206=v\367\252\274\361D\237=\020d\256\273\336?s=0\374\364\273\236D\205\275\003\315\225=\010\265?\2740\257\372\274\226\235v\275\320->\275\370\031[\274@\347\240\274>\251l\275\000]\252\272k\205\251=\"\037x=\330\362l\275|\266\247\274r%U=\020\332\223;\251\253\245=\313#)\275L\362\354\274Y\300\210=\253\306\233=\260\"\013=\200\217:<\216\264u\275\344\256\211\274x\256\241\275o\204\211\275\342\264n=\200h5;\333\010\241=\276\023{=\300\022%\275\200\307\317\274\373\211\241\275\310\346\035=\232\261R=\330\303g\274\356\372u\275\230\n\236\275A1\205=\340\006\315\274%\026\212=\200\034y;\333\0338\275-\307\230=\023K\213=\307\202\212\275\344\370\256<@8\233\273`\376V\275jU}=\337F\200\275 ^\036\274\344\354\245\274\334B\336<\030\212B<\036\025S\275\300\243\036\275L\242\276<^\253m=\306f\345\274\200Mt:\226\266^=\320K\374<6\252i\275\317Z\207\275\356* \275\030\332J\275\215Q\232=N\227)\275\270(X<\252\217~=\200T\236;\260\306\205<\034\272\216<\262\207R=p\270\360<\353$\003\275\210E\030\275#\033\210\275\320\366\036\275\304e\334<\253P\224=\375z\252=\210\000\021<~\372X\2756\246(=\204\376\263<&5\036=\026*==\260\272\214\275k\274\006\275\\.\205<\010]s\275\260S\252<\314\207\232<\261\372\223=+\331\014\275h\301\021\274\346\257l\275@IN\274:\363K=\000\214\340::\021W=\256\304~\275O\314\230=\343\321S\275X\372\217\275\256\017_=x\234`\275\340\324\035\275\026\253\331\274oh\203=\017\026\251=\036\376G=\260.s\275}9\224=:\271[=\323DZ\275\2741\204\275\330\372\013<G\263\200=(//\274\237R\234\2758\353\021\274@\342\371:\306>/=<\225\334<\213\332N\275_z\207\275x\220\033\275`\317\250\274\366\024P\275\374\307\211<p\224\273\274;\365\017\275DK\332<\330\344j\274\222C:=3C\014\275\326\263\254\274?4\207=R\207&=\231I\237=\361\343\206=;C\217=@\357\255:a5\246=\000\031\021=@U\366;&\016r=\314\255\323<ZN#=T\324\320<<<\220\274\010e@\275\306t,\275\354h\253<\000\315\324\274p\236\257\273n,t\275\000\025\2379\000\341\220\274\241\254\216=\3132h\275x\243\\\274\206\034\243\275\362\2543=\nsE=@l\237:H\237\004\275\000\023t;Yn\200=\346P\265\274Vim\275\020x\277;\260\321\365; 6\r;\020)\362;\276\243w=#{&\275>\377\r=\366yd=8\241\217\275s\221\220=\230\275)\274u,\231=\310cL<\244b\325<\200B\016:%<\215=\010vL\275\032\307m=X>\242\2753\227\233\275\200\023\214\275\343J5\2750\267\246\273\260;\224\275\302\377Q=\215Q\230=S(\227\275VW-=\333\320>\275f\000H=\2228U=\330KU<\006\000}=\004\212\211\275\033_\237=\3662\237\275~\331&\275\254d\350<\212\"m=\362n?=\342\216\031=@$b\274\210\3721<b\013|=(\206\032\274\037\027\225=\362\333\177=\220\317\373\273\261]\220=^\364\177\275\3109\031\275\200\314\204\275vn<=\212\230U=N\032,=\3640\202\274x\034\036\275\260f\365\274\3762\t=\240\261|\275\376x\r\275\313\254b\275\244l\255<\240\321%\274\270\307R\2754\026\267<\375\376\220=8\2656\275\312\3129=\230\2753<\212\222\207\275\312\321E=\242d\252\275\253G|\275\004\372\240\275\276)g\275\3300L\274\320k\254;\224\233\251\275@\364\307\274\352\034|=\344\007\224\275\254\250\250\274,h\227<`\363\277<\013\341Z\275\330\327\005\274\271\311\226=\347_\217\2758\306P\275\340\026M<\003\365M\275 \321\201\275\014H\202\274\314\000\252\275"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
