ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::ScatterElements_0"
    input: "onnx::ScatterElements_1"
    input: "onnx::ScatterElements_2"
    output: "3"
    name: "ScatterElements_0"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "reduction"
      s: "add"
      type: STRING
    }
  }
  name: "main_graph"
  input {
    name: "onnx::ScatterElements_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "onnx::ScatterElements_1"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "onnx::ScatterElements_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 16
}
