ir_version: 6
producer_name: "pytorch"
producer_version: "1.6"
graph {
  node {
    output: "1"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000?"
      }
      type: TENSOR
    }
  }
  node {
    input: "x"
    input: "1"
    output: "2"
    output: "3"
    name: "Dropout_1"
    op_type: "Dropout"
  }
  node {
    input: "2"
    output: "4"
    name: "ReduceMax_2"
    op_type: "ReduceMax"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 12
}
