ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Gather_1"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Shape_0"
    output: "onnx::Gather_2"
    name: "Shape_1"
    op_type: "Shape"
  }
  node {
    input: "onnx::Gather_2"
    input: "onnx::Gather_1"
    output: "onnx::Concat_3"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Gather_4"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Shape_0"
    output: "onnx::Gather_5"
    name: "Shape_4"
    op_type: "Shape"
  }
  node {
    input: "onnx::Gather_5"
    input: "onnx::Gather_4"
    output: "onnx::Concat_6"
    name: "Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Concat_3"
    input: "onnx::Concat_6"
    output: "onnx::ConstantOfShape_7"
    name: "Concat_6"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::ConstantOfShape_7"
    output: "onnx::EyeLike_8"
    name: "ConstantOfShape_7"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::EyeLike_8"
    output: "onnx::Mul_9"
    name: "EyeLike_8"
    op_type: "EyeLike"
    attribute {
      name: "k"
      i: -1
      type: INT
    }
  }
  node {
    input: "onnx::Shape_0"
    input: "onnx::Mul_9"
    output: "onnx::ReduceSum_10"
    name: "Mul_9"
    op_type: "Mul"
  }
  node {
    output: "onnx::ReduceSum_11"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::ReduceSum_10"
    input: "onnx::ReduceSum_11"
    output: "onnx::Shape_12"
    name: "ReduceSum_11"
    op_type: "ReduceSum"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
    attribute {
      name: "noop_with_empty_axes"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Add_13"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Concat_3"
    input: "onnx::Add_13"
    output: "onnx::Min_14"
    name: "Add_13"
    op_type: "Add"
  }
  node {
    input: "onnx::Min_14"
    input: "onnx::Concat_6"
    output: "onnx::Max_15"
    name: "Min_14"
    op_type: "Min"
  }
  node {
    output: "onnx::Max_16"
    name: "Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Max_15"
    input: "onnx::Max_16"
    output: "onnx::Concat_17"
    name: "Max_16"
    op_type: "Max"
  }
  node {
    input: "onnx::Concat_17"
    output: "onnx::ConstantOfShape_18"
    name: "Concat_17"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::ConstantOfShape_18"
    output: "onnx::CumSum_19"
    name: "ConstantOfShape_18"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::CumSum_20"
    name: "Constant_19"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::CumSum_19"
    input: "onnx::CumSum_20"
    output: "onnx::Add_21"
    name: "CumSum_20"
    op_type: "CumSum"
  }
  node {
    output: "onnx::Add_22"
    name: "Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Add_21"
    input: "onnx::Add_22"
    output: "23"
    name: "Add_22"
    op_type: "Add"
  }
  node {
    output: "onnx::Gather_24"
    name: "Constant_23"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Shape_12"
    output: "onnx::Gather_25"
    name: "Shape_24"
    op_type: "Shape"
  }
  node {
    input: "onnx::Gather_25"
    input: "onnx::Gather_24"
    output: "onnx::Concat_26"
    name: "Gather_25"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Gather_27"
    name: "Constant_26"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Shape_12"
    output: "onnx::Gather_28"
    name: "Shape_27"
    op_type: "Shape"
  }
  node {
    input: "onnx::Gather_28"
    input: "onnx::Gather_27"
    output: "onnx::Concat_29"
    name: "Gather_28"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Concat_26"
    input: "onnx::Concat_29"
    input: "onnx::ConstantOfShape_18"
    output: "onnx::ConstantOfShape_30"
    name: "Concat_29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::ConstantOfShape_30"
    output: "31"
    name: "ConstantOfShape_30"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Equal_32"
    name: "Constant_31"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::ConstantOfShape_18"
    input: "onnx::Equal_32"
    output: "onnx::Not_33"
    name: "Equal_32"
    op_type: "Equal"
  }
  node {
    input: "onnx::Not_33"
    output: "onnx::If_34"
    name: "Not_33"
    op_type: "Not"
  }
  node {
    input: "onnx::If_34"
    output: "35"
    name: "If_34"
    op_type: "If"
    attribute {
      name: "then_branch"
      g {
        node {
          input: "31"
          input: "23"
          output: "36"
          name: "Add_35"
          op_type: "Add"
        }
        node {
          output: "37"
          name: "Constant_36"
          op_type: "Constant"
          attribute {
            name: "value"
            t {
              dims: 1
              data_type: 7
              raw_data: "\003\000\000\000\000\000\000\000"
            }
            type: TENSOR
          }
        }
        node {
          input: "36"
          input: "37"
          output: "38"
          name: "Unsqueeze_37"
          op_type: "Unsqueeze"
        }
        node {
          input: "onnx::Shape_12"
          input: "38"
          output: "39"
          name: "GatherND_38"
          op_type: "GatherND"
          attribute {
            name: "batch_dims"
            i: 2
            type: INT
          }
        }
        name: "sub_graph"
        output {
          name: "39"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_param: "GatherND39_dim_0"
                }
                dim {
                  dim_param: "GatherND39_dim_1"
                }
                dim {
                  dim_param: "GatherND39_dim_2"
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
    attribute {
      name: "else_branch"
      g {
        node {
          input: "onnx::ConstantOfShape_30"
          output: "40"
          name: "ConstantOfShape_39"
          op_type: "ConstantOfShape"
          attribute {
            name: "value"
            t {
              dims: 1
              data_type: 1
              raw_data: "\000\000\000\000"
            }
            type: TENSOR
          }
        }
        name: "sub_graph1"
        output {
          name: "40"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_param: "ConstantOfShape40_dim_0"
                }
                dim {
                  dim_param: "ConstantOfShape40_dim_1"
                }
                dim {
                  dim_param: "ConstantOfShape40_dim_2"
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
  }
  name: "main_graph"
  input {
    name: "onnx::Shape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "35"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "If35_dim_0"
          }
          dim {
            dim_param: "If35_dim_1"
          }
          dim {
            dim_param: "If35_dim_2"
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
