ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
