ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "weight"
    output: "2"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "\360\016w\275\244\367\026=\326D\253=\260\342\005=}\026#\276%K\321\275\210\306$=\364\360\017\276\271\nC\276\242\034\214\275\234\377\'=\257\020=>2\356\334=\362O\312=\233\213.>&\336\267=]=\027>\003^\'>@\275Y;\036<\324=P I\274\224\227L\275\267\303*>2\317\260=Qz)>\311Z\n\276Z\'\347=x\371\304\274f\037\361=\316\263\227=\"\005\034\276\270\247\207\274\222?\307=d\335=\275\210\036H=B\001\273\275\005\007\317\275g\263&>\020\003\305<\260\313\356\274!{\232\275b\335\207\275\217\t8>\007\216#\276\010\020%=\327S9>\277\211\021>\310}\212\274\332[\310\275Q\037\023>\034\236\'=t$E=\212.\264=q\261+>v\374\242\275\251\353B\276@Q\010\274\022m\371=~<\275=b6\032\276\260B`\274@\351\225<\365\350\026\276$\376p\2752\246\221\275\323\346\002>\002]#\276\303\';\276\360(\302\275>\321\344=\016\304\250\275@\212\321\273\237c>\276P\373\n=y25\276\240\354\"\276x\271\300\274\330\307f\275\270;\222\2742+\356=Uw9\276"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
