ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "2"
    input: "input"
    input: "offsets"
    output: "3"
    output: "4"
    output: "5"
    output: "6"
    op_type: "ATen"
    attribute {
      name: "mode"
      i: 1
      type: INT
    }
    attribute {
      name: "operator"
      s: "embedding_bag"
      type: STRING
    }
    attribute {
      name: "scale_grad_by_freq"
      i: 0
      type: INT
    }
    attribute {
      name: "sparse"
      i: 0
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 10
    dims: 8
    data_type: 1
    name: "2"
    raw_data: "8\246j?T\033\027\277 \210\237\277\355\\\250?}i\244=\3748\372<\237:\243?V\200g\275\253\270\362<f\323\232?\213\212|\277\360\312,\276>\177\325\276\036\374:\277d\017\365\276g\377\010\277\005C\360?\306\233\254?\303\312\243>\215\210\312\277\205\344\305>\2650\256\276\326M\354?\"\003\306\277t!b\277\365]\352?7\376\222\277\337\261\'?\201\r\207\277\300Cf\277\214G\265?\221z\333>\205\201\016\277c|\352\276\024\342\257?k\t,?\320!\025\277\301`\016@\2314`?Qj\201\277\242\306\311?\370\363\\?JK\224\276\206\223\313>0t\346\276B\271\327\276\364\377p\277\273\231\222>\267\207>\2773\350R?\355x\256\275\034\014\213?\016\224\311\277\302B\017\300^\031\036?\220su\275\373M\320=)\330\355\277\234o\256\2776\\b?69\267>\356v0\277\271(\017?\013w\257=\024\206]?\360\250\315\277\320\231\321>F\273E>C\2235\2772\032\211\277I;I\277WX\275>\014n\275=\261d~\277\204\307\330=Oa\357=n\300\222>\222\365\263?Wmq>\314I\213\277"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
