ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::ConvTranspose_0"
    input: "weight"
    output: "2"
    name: "ConvTranspose_0"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch_jit"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "\213\332\274\272\305n\323=T2\"\276\333\007\021\276\314\315\227\275\304aS=V\344y\273\374@\034>\327\350\213\274n\226P=):n\275\234\362\032\275\374D<\276\344\203\002\276\003y\242\275\266\232\351;\t\321\233=\335}\354=\342\231\005\276\342\241\253\275X(\217=\305\244#>-:\"\275\016x\023>\"\035\376\274C\322\246<\362p2>\242\3206\276\354\037\370\275a\220G\275\210\242\231\275\207D*>\333x\377\275Ao\265\275(\256\t\276)\2218\276\375\022\346\275if)>\034\337\257=\034\007\277=\232\323%<e\021\312\2759]\005=\217\0008\2764e\016\276\2320\313\275.\255\370=c\027\347=T\314\256\275\374\212\343\2736\023\374=\250\351C> m\234=\025\373\324<\313!\004>\272\021\350\275\364\343\022=\342\311\030\276\362\225\010\276\350\232\313\2754V\262=\261\201\236=\360w\351\275\306$n=\341^\330=\366\374\306\274\327\307\360;\255\2456=\214\203\364=r9=>\256\335\027\276\210p\220\275j\346\232=\004H#>\245}+>\224\342->\331\340\034=!^+\276\350\007\221< \223\366\275\300\2507\276"
  }
  input {
    name: "onnx::ConvTranspose_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
