ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 11
        raw_data: "\000\000\000\000\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    output: "2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 11
        raw_data: "\000\000\000\000\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "0"
    input: "1"
    input: "2"
    input: ""
    output: "4"
    op_type: "ATen"
    attribute {
      name: "operator"
      s: "uniform"
      type: STRING
    }
    domain: "org.pytorch.aten"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "ATen4_dim_0"
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
opset_import {
  domain: "org.pytorch.aten"
  version: 1
}
