ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "weight"
    output: "2"
    op_type: "ConvTranspose"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "output_padding"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 3
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "\354\301\336\275dPn=\237\356D>x\216\354\274`\262\032=\370\237\263<g\353\031>4\342!=\252A\277=\271\241\037>\272\207\305=;}\003>Fl\336\275 \355\023=XR\377\274\372\220\321=\017\322\027>&\034\032\276g\303&\276\303\002;>x\334\263\274]~\262\275pY|\275\224UQ\275(\227\024=\211b\277\275\214+\006\276\315\300\027\276]U\032>\022\017\220=c\333\030>\253\030/>Kg0>\330f\361<\256\225\234=\020\356/=\367-A\276xw\027\276&\035\"\276K\237\332\275\320|\023<\204K\033=LlL\2758\231\321\275\212\354\371=\340|\332\27563\242=@\375\340\275\2432\256\275x\267\321<\007\224;>w})\276\177PB>\177\337\230\275\240#t<(G\301<`B\014<^o\342=|{m\275\352\375\214=\005d\031>\365\326#\276\371c.>\031M(>\223|<\276\002:\324=\020\027?\275\212k\221=tJ\034\275O33>\305\264\375\275\344\301c\275\332\030\360=\251\202!\276\321`\306\275\313=<\276\342\344\333=\332\377\351=\276\304\206\275\352^\034\276\2207\205<"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
