ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Gemm_0"
    input: "weight"
    input: "bias"
    output: "3"
    name: "Gemm_0"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  name: "torch_jit"
  initializer {
    dims: 5
    dims: 4
    data_type: 1
    name: "weight"
    raw_data: "@\r\245\275\020\265X=J\315\347>\316{\355\276f)\241\276\340\236\001\276\334\223G\276(/\335>\032\357\245\276\300\260k\276\032\332\262\276v\302\357\276\004p\225\276\236\016\334>\274vd>\000\'x>@j\327<:?\203\276\300>\255=\236\006\357\276"
  }
  initializer {
    dims: 5
    data_type: 1
    name: "bias"
    raw_data: "\032\372\270\276\306\371\203\276&\205\241>&\031\226>\310\021c\276"
  }
  input {
    name: "onnx::Gemm_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
