ir_version: 3
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Shape_0"
    output: "onnx::ConstantFill_1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    input: "onnx::ConstantFill_1"
    output: "2"
    name: "ConstantFill_1"
    op_type: "ConstantFill"
    attribute {
      name: "dtype"
      i: 1
      type: INT
    }
    attribute {
      name: "input_as_shape"
      i: 1
      type: INT
    }
    attribute {
      name: "value"
      f: 0
      type: FLOAT
    }
  }
  name: "torch_jit"
  input {
    name: "onnx::Shape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
