ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Unsqueeze_0"
    output: "1"
    name: "Unsqueeze_0"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "onnx::Unsqueeze_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
