ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::Shape_0"
    output: "onnx::Gather_1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "onnx::Gather_2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Gather_1"
    input: "onnx::Gather_2"
    output: "onnx::Add_3"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Slice_4"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Add_5"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Add_3"
    input: "onnx::Add_5"
    output: "onnx::Div_6"
    name: "Add_5"
    op_type: "Add"
  }
  node {
    output: "onnx::Div_7"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Div_6"
    input: "onnx::Div_7"
    output: "onnx::Mul_8"
    name: "Div_7"
    op_type: "Div"
  }
  node {
    output: "onnx::Mul_9"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_8"
    input: "onnx::Mul_9"
    output: "onnx::Slice_10"
    name: "Mul_9"
    op_type: "Mul"
  }
  node {
    input: "onnx::Shape_0"
    input: "onnx::Slice_4"
    input: "onnx::Slice_10"
    input: "onnx::Gather_2"
    output: "11"
    name: "Slice_10"
    op_type: "Slice"
  }
  node {
    output: "onnx::Mul_12"
    name: "Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_8"
    input: "onnx::Mul_12"
    output: "onnx::Slice_13"
    name: "Mul_12"
    op_type: "Mul"
  }
  node {
    input: "onnx::Shape_0"
    input: "onnx::Slice_10"
    input: "onnx::Slice_13"
    input: "onnx::Gather_2"
    output: "14"
    name: "Slice_13"
    op_type: "Slice"
  }
  name: "main_graph"
  input {
    name: "onnx::Shape_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "11"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "14"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
