ir_version: 4
producer_name: "pytorch"
producer_version: "1.1"
graph {
  node {
    input: "0"
    input: "weight"
    output: "2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "\346\351@\275\320b\316<Y\214\252=(\335L\274\254\370\205<H\217\033<YL\205=\0002\214<\n\242%=\301>\212=\362\020+=\366\276c=\271\237@\275\240\033\200<x\035]\274b}5=\377z\203=\220v\205\275\327k\220\275\303\364\241=\260\303\033\274{\224\032\275|\212\332\274\360I\265\274\340\256\200<\203\276%\275\262ch\275\014l\203\275\035\250\205=l\204\371<\307`\204=M\243\227=\031\305\230=`\017Q<8\233\007=\034\\\230<dL\247\275\212,\203\275\re\214\275\031U=\275\240t\177;L}\206<\030\t\261\274\204\2045\275\306pX=K7=\275(x\014=\257\330B\275\027\334\026\275\270\2365<\221r\242=a\310\222\275\377G\250=Vd\004\275@n\323;8b\'<\240\357r;6\031D=n\252\315\274\2004\364<\033\327\204=\253\343\215\275\321\006\227=\311\300\221=\365;\243\275*\3137=$}\245\274\374\337\373<\020Z\207\274/1\233=I\267[\275d>\305\274\"\356O=B\337\213\275\361\314+\275\226\005\243\275\022o>=B\246J=\010m\351\274\312k\207\275\020\275\346;\302\343)=\362\263\177\275\261\037\211=\310#\177<\2300\013<OQQ\275\"-Q=V\2658\275\316\344v=\300@\270:\240T\014;\034\210\341<B\233l\275\024\226\375\274VK\026\275\363\364\215=*<\235\275]SI\275\224\245\257\274\275\307\247=\022CJ\275\326\240\036\275\237\336#\275\"\000I=\325\275\237\275\000\224[\274\316\025\004=\320\360\333\273\321s\250=\036\021j=\267\\\003\275\345\250\227=\216m\226\275\236\000D\275\361\305\216=\342\2148=M?\216=\352f4\275\277b\250=\340\274+\275P\347$\274\2103\316\274\354\324B\275\320\003\217\275\031}N\275`\330\002=\240DT<\376hn=\226R\354\274)\237\242=\000\204\201\275\3308N<\0167@\275\"qa\275Vb\205\275:\367E=\000j^\271*\247@=\240\325F<\021\247~\275\375\341\237=`A\';=N\235=\000\350\215:p\215\277;>\373\215\275\261\231\230=\240\220\003\274N\027\002=\310NF\274\276GX\275\256\203\026=\036\3205\275m1\221=@\254\341\274\376:\002\275&\206\224\2752t}\275\016\345n=B3Z=40\323\274\362\214\246\275\256\362z=\0002\n<zY^\275@u\354<\240\001\357\273\030\250}\274\301\203\220\275\334\317\316<\010r\032=\364R\241\274\242%9=p\343\235;\203\316\225=\320\275\340\273\276\231T=\340\305\022<\232\251f=8\027=\274\200\362\373\272q\212\211\275\224\360:\275\260\377\212\274\274\010\337<\021$\250=..^=\370y+\274\024\243\001\275\200\017\003\273\266#\031\275\376\327\033\275S\"%\275\220}\351\274\000}J<\000d\372\274\226\335|\275\027\362\250=^\0265=\320K\263<.\234_\275\250\314J\274\301\250\212=f\311==L\026\266\274\325\005B\275\313\320.\275\200\003\202;\264\230\200\274\002\\l=\313G\246=\000X\241<\260[\237\274+ez\275j\037\t=Hsc\274\302\321?\275,\321\255\274\361\030\251\275\272\0342=\305\r\235\275\256An=d8\354<<g\350\274\365\265w\275 \026\362<\"IR=\277\250\023\2758X\331\274l\363\371<`\266\035\275,\377\224<\263\306\246\275\033\277\000\2750\331\250;7\013\233=\030\260X\274 B\341<\222\001t=4\351\223\274\240\247\242<\370t\013\274c\t\246=Z\222\013=\226\252O\275\357\2304\275\240\205\014<P1\252\273\202\2672=\204\315\274<\311\334\233=\000(9\270o\200\020\275\316\217\r\275\274 \306<\200Cu\272\026k\255\274\022j7\275M\355\203=Xr\021\274\354\211\365<\356\255\"=O\243\220\275n\007\001\275>\201\037=\372\253l=<\256\366<\222\236t=\230\007M\274\265X\241=(\254a\275\214\265?\275\301y{\2758\021\333\274\"@\224\275@\306\362\272Gx\236=J\341>=o\315\243=\350\313\006<\300\211\206<\0306?\274/\264\215=\270\223\\\274\234\304\237<\244Q\202\275\204\327\255<6\232q\275:bi=\235;\220\275\300^4<\216ly\275\264V\360\274\210\214\r=6\340\234\275\020FS\275\2304\252\274\\\261\366<\020 \007=D\342\365<\300U&=fba=\234\026\204\275n\254\372\274`\270}<\3148\241\275\340\266\254\274A\034\214\275\322\235_=\260\260\235<\346\235\203\275\220\245\374<\314\256N\275x\321h<61\027=.\035\363\274\314@\320\274@\275\031<e\326\240=\312\335r=!\360\222\275 \316\202\274\342\375\014=\220\217\324<R\312z\275\324\263\340<\241m\202=2\364\026\275n~8=\344\t\354< W\262\273<\345\224\275\276\333\255\274N\257}=\003\226\242=\240\345\r;}\206\220=`\325\261\274x%\317\274\271_\237\275t\034X\275\313\227\223=;\344\233=\324\340G\275`\232$\274\227g\216=\360\2311\275\"\037\222\275\005\227U\275~\225\226\275\004`\205<\360&\243<\226\3519=@\377\304\274\276uW=<T\365<\364E\376<\n\'^=\232@\020=\022d>=\301\324\221=\372\2579=\302]\005\275W>:\275\344\270\211\274\253\230\022\275T\223\230<\032\031Q=\006\350k=\031\304\225=~\002/=f\271\367\274\267y\205\275@^\316;\265\313\224=\014\220\217\275l\363\247\274V\310L\275\320\267\204<\264O\230\275F\234u=\342\313\177=\324\330\226\275\244o\\\275\252\036d\275\0307)<o&\213=2\007\215\275\214\264\222\275<\270\307<\310\300\037\275\276\215v\275\002\261\004=\026c4=\200\204@\272\020\311\360<\260\213w\274,\256\366<\000\244,<^\216\224\275\340\322\263<\224\307\017\275\274\360\213\275\002\td\275$\335\237\274\336\031f=\264#\313<\327J\226\275\n\215\215\275\326\377q\275v\351a\275\014\374\350<t\023\361<ts\353\274\200\341\027=hN\315\274^\317\362\274%\020\247=\235\2307\275\264C\212\274`\020\025<\310S,\274\302\341j=H\374{\274\240\352M\274\347$\207=F\332N\275\234\235\361<\0007\260:D\367\257< \320\345\274\242\315!=\365\261@\275\0030\234=\031\231\233=@\350\325;V\022\032=\320\232\216\274\266\206C=B\350\236\275\2254\236=\252\026\023\275@o\350\272*\004Z=z`4=\326\254r=\256\342\366\274\274\254\245\274f\177x\275\226\373&=x\264\016=\310.\036\275\340\020%=\t\353\204=mG\222\275\014\020\273<Lc\262<*$&=\333Qt\275\314y\370<v\263\035\275\333\003\225\275\306+b=\274g\203<\375\231\230=\235\3059\275\020A\372\274\030\340b\275\246\351\270\274\034\244\205\275@1\264\2720\221\345\274^+2=\262v\204\275\342:^=\332\261w=\336\277t=zZ:=\352t\235\275\220#\245\273\352\304\036=\272\330s= \245\027;8\241\037\274\337\035\216=t\313\'\275\007k\240\275\373\340\232=\254h\301<\266\004q=\0008a\275\347a\234\275\212bJ=#v)\275\254\276\351\274,\241\362<g\226\234=@m\221\272][\224=\213J\210=KY\211=\316\367n=\264)\361<|w\356<\002\rf=0\343\021\275\032\224\203\275\234\266\365<@Y\250<\002\317~\275\351\005\251=8\264Y\274\350\263;\275\325\020\226=e\302\207=\227\333\231=^\303\362\274\252\363\027=\331\367\201=\200H^<\024\372\271<\270\241\r\275\"\367M=@\201\230<x\262y\275\336.&=X\315\213\275Z\321Y=\320,\275<W(\177\275N$\374\274\251\274\214\275\370A^<\026G\'=\224\207\235<\226\231\010=y\017\252=\026\376\205\275Dg\326<\360\331\216<rlO=\360\021\234;\010\300{\274r\0022=\244S7\275\216\273U=b9P=[\334\223\275\330\024\261\274\000\250\335: \322\021\273\217\205\213\275*\347?=\253%\232\275vFR\275H\351\r<\274\205\253\274\345|\245\275\301\377\211=B?\"\275\365`6\275\356\262d=\243w\214=\364\336\005\275\372\304t\275@\272u\275\000\235\365;\240\311y\275\351\325\241=\314\317\244<{#\250\275`n\010<\302|Y=\331H\225=\354)\256\274x\361(\274(\017t\274\240;A<F|\341\274\300\330\375\272\n\243W=PE\010\275\002j6\275\335B\222=X\351\027=\232p\001\275\022\245o=\206\276\031\275s\351\242=\231l\220\275\013\305\237=\200$\017\272)%\226=\226\320-=>\336\245\275\020u\347<%\3446\275\230\262{<(\371b\274\232\256F\275\360\237\251\273\n/@\275 #5\273\260b\314;\251.\203=\022\3143\275\236\362o\275\374W\177\2756\373`=\310&\251\275\364\n6\275!N\210=\350\260\031=\306=\211\275z\357t=u4\245=\027C\225=1\206\235=7G\213=\375.\211\275\007\256>\275\3269\036\275\225i\200=\205)\202\275\311\345f\275\306\360\032=\276j\356\274z\232}=p-\020=\274\323,\275G\035\223=\260\260\030=\224\n\211<\352\0144=\0221Y=5\224r\275P\371\313\273\326\024}=\376\037n=\252\222\\=D\327\246\274\255f\202=\nP\035=}\377\220\275\251p\235=\330\016\001\274@\375\343;\316\017\362\274P\253\304\273(Hb\274h.t<\337\257\251=\320\237\300\273\362ep=X\367\201\275L\017\341\274\000\335\374\2740j\240\275\322r@=\335d\211=\360\235\335\273Qa\250=\274fO\275\200\242\370<\025L\237=\364\350)\275S\331\020\275\312\333\023\275\020l\304\274\000\321\025=p\320\345< \350\016=\037\010\221=\014{q\275\273f\203=H!\031\274\020\207\003\274\351,\205\275\',f\275\256@L=%\224\211=\226\232\222\275\301y\215\275\302\003o=2]\200\275\216\204F\275\017\351\222=*\346U\275p$\364\274\341}\237=\034\2443\275GQ\241=\227\3102\275\033\227\205=\030\004L<\200\336m:\005v\251=\222\2360=\2001\227<\304\305\204\274t\250\315<\034\271\237\274\222\327w=\032x\013=\000\000\2148\234\013\247\275\271\267\212=\010Eg\274\216\221:\275\354\251\210\274\240A\243\274T\001\222\274\360\016\020\274\310\370\270\274`s#\273\000+\222\271Zo>=\tj\212=j\257\007=N3}=\370ID\274 \256\010<oWJ\275Pr\354;\220q\376\273lU\332\274\344]\350\274I(\233=\320\214B\274\214}\236<\252\200\r=hC\212\275c\255O\275\232\361F=Q\252\226\275Q\246\226=j\207l=\376U\260\274\364t/\275)\001\232\275\214\023\360<%\306\221\275\230\217E<\220O\301\2736\331\\=\306\325<\275\027\353\007\275\0334K\275\210_U\274`\201\"\273\034\006k\275@\217H<E\275\213=\224\264\203\2750\340\271\273(\373|\275\\\r\366<\t\364k\275Co\242\275\213\036\245\275\355\004\207\275\257p\215=\316\230F\275\252\210\251\275\214\357\376<D\010\211<\260\331\350<\232\345\016\275Q%\201=\237G\217\275*\200s=<\265\333<ZD)\275\246\201b=\335\252}\275\212\022Q\275\200\201\270\274Vs\236\275\212\372R=H}\302\274\253w\241=\010qY\275\010!\247\274\025\262\226=T\330\260<}\251\217=#\344L\275\\\005\252\275\2244\252<n\305\376\274o\276\251\275$\253\272<\3163\216\275\226V\t=\024\010\262<\'\274\245\275\\1\253<\2405\007\273(\274\021<\334\013\346\274\260\345\021\274\300\220t<\320\331\217\275P\200\227;q~\225=\262\333@\275\352\327[\275\216X\031\275P \201\275\270\246\315\274@\023\026=H\231n<\240\272b<\250\376$\274\240\317D<\005\t\205=\306\226\210\275\022x\020=\262\233e=\n\360\233\275\346\244\300\274\034\277\256<\000]M\274\3416K\275\371/\245=\220\377\316;\373>\200=\000{\2569\010U\"<\ry\233=\000\356\027;3\315~\275rs =\264\340\324\274\260/\337\273v\356\242\275`{\031;*n1\275\340\031}\275\252\333\035\275K\345\007\275\200\373\267\273\370^\324\274\320\306\016\275\326\345\300\274\255\034\220=.\331V=@&{\274R1{=ar\232=\004\034\223\274\200\360\325;\305\007P\275 \322\007;\265_\246\275\200\232\313\274A\377\226==\205\225=\302l\252\275o\222\250\275\234\302~\2756\3328=\002\362Q=\246\360J=6\024@=\030\226!\275X\361\263\274\000\2240\274\2705O<~\303 =\220\003\341<\350G8\274\244\306\243\275\332\023_\275\371\317\241\275\016\030M=\225\215c\275\360G1\275\326\037Y=\300\254e\275l\330\247<\361\300J\275!\244\234=<X\360\274)qZ\275\200Sl:\270\n~\274rRs\275\220r{\275S\014\220=\020\316z\275\260)G\275D\335\302\274=!\223=\014j,\275(Mi<\262\242h=\016:\'=\326\004E=\274\305\232<\000Ux;\260\231\234\273\344\231\257<\232\037q=\020}\201\273\010) <\312\332|=T\273\203\274\350\237\002\274\303\004\032\275_\275\240=&)\206\275|\020\242\274X\377Y\274\000M\377:\261g\246=\010\251X\275\210P\263\274 \3728\273M>Z\275l@\216<\006n[=\300`\327\274\2628D\275(J\205\275\262\2208\275}\210\207=\202cS\275\314U\241\274\000~\221;hx\213\275\300G\324;\000\327\341\271XH\026<<\232T\275\3113\230=&\327@=\251\273\200\275\214*\314\274\324d\240<\245\336\242=I\215\243=\3012\247=4\351\204<\274\273\224\275N\252\031\275x\230T\274\312\313;=V\311\"=\270\275\204\274&9\022=0o\241\275 \241\243\275Gl\252\275P\345\000\274\2713\235=\200:\272\274h\247\324\274Hr\244\275\362v~=f\004U=\317@\204=8\223G<:\202c=z~T=@4\330\272\202\023<=a\337\237\275\235\243E\275\226\033\337\274\340-i<\000R\247\271,F\326\274\003,\222=\0171\250=L;\366<`*F\273\250\022\027=\246\2158=\306\356.=\307\003\243=FK\210\275\230\007c<\010\264\035<m\025L\275\351s\252=%<\247\275\022\317g=\300\362\317\273(\277i\275\014^\300<3\202\217=\257\362\216=b8J=j\340?=@\010\005< f\300<\"\021\213\275\360Z\271\274\3222q=-\312\235={\213\017\275\204M\257<\372\231a=\002\032\023\275i{\206=\014\346\227\274\244\355\300< \367-;-#\237=8w\205\275\301\215\215=\350J<\274\236o\310\274`\205E;\004z\252<\014\303\205<\200\022$\2730.\235\273DP\203\274r\2672=\360I\020=^\355\247\275\200R\361;\242\007\t=cn!\275|y\352<\202K\032=\312\364\005=\356p==\324x\301<\376ih\275\304s\345\274\274\024\215\2754\215a\275\351\217\212=\323>#\275c8\247\275\262\205F=\233\036\230= \\0\273l\367\314<(\n\010\274[:\246\275\240v\034<\t\344\245=\010\307`\275DC\345\274 _\030;\262\2758=@\362\374;\314\243P\275\214\346A\275z\363\204\275\224\271\246\274\215\255\233=\201Q\201=/#\215=z*\244\275>\202Z=\333\273Y\275\342W!\275!\374\201=\200$\272<\354$\250\2758\214\253\274@K\222;xiX<\251\235\203\275\270)\020\274\250n0\275\035\3421\275W\201\200=^\031J\275\275P\224=\335\314o\275D\006\330<\200\333\204\275\300A =\240\207{\273E\0030\275\345\335\233=`_i\274\214W\374\274\252%.=\266\334\026=C\273\237\275\346\"H=b \214\275\000[\207\275`\331\251<\000\274\370\273\374\252\226\275\021\030\250=\022\3165=\r2=\275\014\327\215<\010\266H\274`\237T;\000\354f<\260\267\216\274\032\0303\275\240\352?;\327\322\020\275|\257 \275\002\3043=\372\003a\275\240*P\273j\347\201\2750W\330<\320\333\341;J\2331=s\245\236=\260\205\215\275\350f}\274\232\306`=\036\236H\275\311\253\247\275f\022\222\275\354>\323\274@\216\355;z\243L=\200\302\215;\265\311\236=\030\314H<4]\377\274\272\212\177=2\274\206\275\374\227\366<\000\244\323:\314\333\252<\326\376L=@\234\034=4\024(\275^\254!=R$,=\260\301\211;x\271}<B\375\030=\025v\217=\250\332\024<>\344\205\275LP\357<U\310l\275\200\014\326;\240wu;g\026=\275@\275\326<\020\243\261\273\277IE\275@3A<\262\256%=\362\323 =fNa=P\302\247;b\326\t=\300\375q\275\014\235\200\275\217v\235=\322\016\223\275@\274\223\275\224c\277<\200i\026<%\033\203=J\373D=\311\325\236=\274\335\320<\316\301\017=\034(\262<o+\220=\210L\240\274J*\\=Eu:\275k:\242=Jhb=\303\027\226=>\226[\275,\241\304<\322u\006\275\367\262+\275w\361\204=\2702a\274\330\3301<(\365u\275\270]E<l\006\363<0\306\372<\000\203\3319\350\371(\274\305\254`\275\200\332\246<?hX\275\n\3166=Hz\023<\n\323\006=4W\226\274`\363B\274`\033\234<\224O\030\275\0146`\275!i\213=\014\347\354\274\272N|\275{\244\207\275o;e\275\2621`=\3749\216\274P\t\353<Mi\233\275\274n\305<U\205\225=}i\222\275\221A\200=@\221\026\273I\352\210=\354E\263<z)%\275^\270\307\274@^i\273\234\272\236\274x\263\037\274\364\367\336\274d\266\224<;\030\250\275\322\t3=\202v\234\275p\275\340\274J\265L=\300\013\251:\3772\211=@\232@\273\234\343r\275\354\323\230\275R\202~=R\2113=y\232k\275\220\321\312;\207\356\203=\303t\210\275|\000\r\275\372\0228=r.c=\211\264\247=y\223\226\2758\220\\\274i\231\204=3\360\224\275\236\302\225\275\275\224\213=\316\375\003=\334\242\274\274\226D\325\274J\025M=\330\353\024\274\250\0207<\257V\206=0t\000\274v9\314\274\226UM=x\233\215\274\0107\r=\006\rc\2758W\024\274\230\350\027\274(.\202\275H\315><\230`;\275\366(\343\274\227\n\225=X\002\373\274\374\375\001\275 \233\t\273\344\276@\275\254\201\370<\023\304\244==\031\210\275\271\3631\275\334e&\275*\347_=\014j\243<\273\305\014\275\300\023\233<\310\326\034=l\304\216\274\266..=\334\372\234<\350\275\273\274\330\214|\274\240<\037<X\370N<\005\343I\275\324N\232<\354\371\266\274ot\216\275\344B\336<\230\2503\275\206Z\'=\220j\325\274\332\3042\275\274\315\225<Dm\343<LN\324<,\342\254<\016\330[=\013\345\\\275\010D\345\274\020\265\273;\245$\230=\351\177\251=@)\353<p\206\341<\2245\356<\3510\225=\300\302\243\274\350\242~\275o\265\201=t\324\304<@\032T\274\356\031S\275f;-\275\350F2<\367\357r\275\t\312\240=\370\007\027<\346\270\230\275!\245\242\275\260\355\303\273\374>\210<j%F=\340p\241\273\022\357\013=P\256\003=\024T\221<z\224\016\275 \005O\274\272Ch=\020\177\035=\200qZ;\314\r\261<>\032Y=\273et\275\374\n\344\274\r\377\235=L\374\254\274\240\203\335\273\2405D<tT\203\275\216\371\331\274\241\235\245=J\205_=R\245U=\364.\255<\366:\033=J\357D=\234\271\213<\014Z\201<\340\365J;p\223\302;\010\334\\<\332]\t=\024L\202\275\2479\233=\342/\005\275\347h,\275\312\254*=\217?\'\275\345\276^\275\357\215\235\275\333\001\211=\231\367/\275\266!b=\016P\367\274\245\2179\275`k\003;\224>\244\275\220\t\311<}\265\244\275\033\247\222=}\342\201\275T\241O\275\326\262\021= \377\310\273\344W\366<_W(\275\336\341\276\274b\223_\275(U\315\274\n\327A=\263\213\023\275\236\262\024=\350\005L<\306\217\231\275\241\022\223=\302uC=* ^=\017\226(\275\376\246(=\200\241-\274W\336E\275hK\207\275q\300e\275\340k\022<\030\222\004\274\000\342V;[\226\233=F\246\271\274\360\316\366;;\317\245=\346\345C=9\246\220=\260\243\212\273\t\001\202=\252\027M=\000\3401:\014F\214\274T\\\237\275\343c+\275\025\035\223=`\232\025\2749\252\213\275\231\017\247=\224)\342\274\320\321\010=iT\244\2755\014\246=Z\255\017=\224k\265<PV{\274\233\013\212=\250;7<o\270\221=\203\330\225=\r\263\251=z\"e\275P\210\306;\240\000\302\273\320\355\260<>\305N\275\300G\310\272\206^\233\275\000&E;\314\360\251<\032\300@\275\001a\242\275H2\370\274T@\244\275  \317<\236\225\331\274 \336=<\024\311\367<-\364e\275~\314\014\275\312\331\\=\342<\027=\264\313\365\274:\341\021=\370\237=<~\361f=\231\262|\2756\n;\275\275\347\246=\006\356\237\275\004\010\377<\257\362:\275\217\207\240=\300\367\024=\252\016\010=\022\2048=P\245c\275x-O\274s\346\002\275xk\330\274\2277\215\275\320\311\233;0@\240\273xh1\274\241\"\216\275\247G\232\275\312\323W=<\242\272<\030\354\337\274\036\354\\=B\3067\275\260\321\227\273\360\225Q\274\000|B\274T\242\227<t\310\335<9\310\221=\0343\230\274\035\033\202=bp\010=\376\3023=\022\252o\275\374\201\372<\",^=\000 `\267\030*\016<\24524\275\"\020\213\275\024\031\240<\360\335\376\274\332F\\=\376t\272\274\270\'Z\274X\311k\274\250\000\003\274Nn\013=\326W#\275.Uy=\250\370q\274|\346\237\274\240{.\273\250\013J\274\270\247R<\336^1=\254\036\217\274\300\030\205;\262wu=\364Q\026\275\000\225\247;z++=\200\261\010\274pC\323<\240F\003;\303\021\251=@\302\363<\363d\210\275\272~u=P\262\367\273\177\216\241=\000\222q<\300\311w<\370\034]<\"\007\234\275\216h0=\000\013\3269\357\261\213\275;\316\217=t\302)\275XS\033=\310?[<4s\211<\371\371\232=\260\301\346\274\024r\016\275\214_\337<\343\001\207=\304b\230<R\3279=\3220\231\275\300;\207;\254\356\234\2755\311`\275BaQ=h`U\274:\034u=,\344\242<\240\033+\274\001s\223=\030\224{<\272\346E\275\325\031\252=x\t\035\274PF\200<>\245\205\275\360/\346\273\\Z\204\275N/\242\275\332\032|=e\213\213\275\002gV=H>\005<r%O=\242\325\246\275\302\207-=\252\031n=\352XA=\306\264%=\374\320\025\275\246\177\331\274\000ib;4\304\216\274\254\366\225\275\000\375\271\273\tl\246\275\004_\223<\276\231\177=\351e\226=\370\211\020\274\3004W<\030\266\037\275\334\247\000\275N\303Y=v<?\275\204\365O\275\275-\204=f\321q=\344#H\275\204%\203\274\234\253\260\274t\275\017\275\030\"\003<P\321\271\273\023\2760\275\014\321\372<\020\350\221\274\374A\374<^\220\024=\344<x\275\370\247\327\274\236\304{=\362\264{\275\303\206\220\275\242,]=\364?5\275\250(3\274N\372g=\r\260\207= \333b\274@\222b<\267\031\223\275\310\343W<\242Bx=\210\0006\274\030\013h\274*\014\002\275\320\032\217;\304\241\252\275p\241\314\273DE\345<\324\267\226\274\277q\207\275\360g1\275\234\211\247\275\210\304.\275\220\017\347<>\340h\275\320\260\332\273\250\032\244\275\272\331#\275\356\006\305\274\013v\202=\204\016\273<;\003$\275\321o\251={\004@\275\020\202<\274\362\365l\275\210\3628\274\3007\264:VQ\263\274j\314{=VT6\275\370\352_<\000dJ:\257i\222=\312jb=\264x\214<\214\212\251<\000P\350\271P\021\203\274\266\265>=\320\322\253<x\213\357\274\320i\225\275\270\234\006=\024V\367\274dE\272< \002\022\273\177O\213\275\240\003\207\274\204\266\014\275\274r\350\274l\373\211<\370W\"<\326Tb=\354\004\230<\240\211~\273\237\313\242=\030v\354\274\266\316!=\276\200\025\275\304\241\316<w\336T\275\2426&=\351}\245\275\000r\';\236\343P=\0368s\275\330-\020<\304\305\234\275\031\224\224=\267\352\236\275\254$\037\275\320\2419\274\264\014`\275\270\032/\274\007V\220=\271\372\220=\233\333\204==H\216=\300\311\220\273\273\336\211=z\221P=X\322\337\274\252\020\"=\010\323m<\313\270W\275@\257\243\272 y\331\273\362,\217\275\357|\211=\034\257\314<2\273\215\275\242\2755=\344\013\316\274\004\251\376<l/T\275>TG=\272\0336=\004x\301<\240\265\352\273B<\037\275fJ\005\2756r\213\275\"\323\014=\017L\246=Q~\246=}\001\203=\334\004\237\275B\312$\275\277\010\240\275\275s\240=\032\342c=^\223o\275\004\034\360\274LY(\275:\275N\275\376\253!=.\002\030=\316\177#\275W]\231=1\273\221=\204\014\244<\371\312\212\275\351\347\223=:\221P\275\200v\257\274C\312\251=\332\334\r=\367\262w\275\"qU=C\3700\275P\246\356;\375\340\224=#\211\021\275\2642\355\274N\340O=\247\177\226=\032LR=0\260\013\275t\037\355\274\014=\277\274\220\210\311<\346\246\230\275$\364\250\275qI\217=\200\003\347;\004\013\316<#G\210=2\206W=\020\003\234<~\246U\275l\023\355\274\222\3553=\210a\003=\017\316\203=\203\271\226=\006\263@=p\210\256\273 \312\000<\262\273/\275A\306@\2750o\331\273\242b4=\233\314\223=r\222\242\275\200\2144;\304z!\275ah\236=\346\022\245\275;\317\203\275\340\211B;\000%\330\273\200\214\311\272\210p\007\274\\\177\344\274\020G\234\275\024\312\262<2\223k\275\354`\352\274\002\274W\275\371r\212=Z}1=\324\211\254\274\252\375.=A\364\242=\351,\241\275\204\373\267<&\342\250\2756&\232\275\242^K=\341\037\204=\322Pn= p\200\273^4\016=\255\224\204\275\3347\262\274\0000\2359I\300i\275\225\371\203=T\310\376<8\002J<t\272\211\275\034\307\212<t\277x\275\346jo=\342`\207\275\024p\321<\210W1<\032\265<\275\330!H<\314\001\217\2744$\204<\256\177\212\275|\251\247<\324F\341<\000G^\273R\262#=\240\312h;X{#=\3707\026\275\320\366\301;\237.<\275fVQ=\014\250\217\275SM\252=\3305A\274\300\r\240:\340\233/\275\024\342\330<\210\277_<\272\366@=\254\257\316<\334\343\225<n\373&\2750\027&=\000_\236<\004\363\373<\000A\270\272\212\312v=DQ\200\275XM\030<\020\225\250<\360\\#\274\331\251\213=\264\266\363\274F\t\337\274\200\345:<\274xt\275"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
