ir_version: 6
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "0"
    output: "1"
    name: "IsNaN_0"
    op_type: "IsNaN"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
