ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "input"
    input: "1"
    input: "2"
    input: "3"
    input: "4"
    output: "6"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    data_type: FLOAT
    name: "1"
    raw_data: "\340e\355<\246\305\315>"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "2"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "3"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 2
    data_type: FLOAT
    name: "4"
    raw_data: "\000\000\200?\000\000\200?"
  }
  initializer {
    data_type: INT64
    name: "5"
    raw_data: "\000\000\000\000\000\000\000\000"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: INT64
        shape {
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
