ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::MatMul_1"
    input: "onnx::MatMul_2"
    output: "onnx::Mul_5"
    name: "MatMul_0"
    op_type: "MatMul"
  }
  node {
    input: "onnx::Mul_5"
    input: "onnx::Mul_11"
    output: "onnx::Add_7"
    name: "Mul_1"
    op_type: "Mul"
  }
  node {
    input: "onnx::Mul_0"
    input: "onnx::Mul_12"
    output: "onnx::Add_9"
    name: "Mul_2"
    op_type: "Mul"
  }
  node {
    input: "onnx::Add_7"
    input: "onnx::Add_9"
    output: "10"
    name: "Add_3"
    op_type: "Add"
  }
  name: "torch_jit"
  initializer {
    data_type: 1
    name: "onnx::Mul_11"
    raw_data: "\000\000\200?"
  }
  initializer {
    data_type: 1
    name: "onnx::Mul_12"
    raw_data: "\000\000\200?"
  }
  input {
    name: "onnx::Mul_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "onnx::MatMul_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::MatMul_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
