ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "input"
    input: "weight"
    output: "2"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "main_graph"
  initializer {
    dims: 13
    dims: 16
    dims: 3
    dims: 3
    data_type: 1
    name: "weight"
    raw_data: "l\306\240\275\360\360\205\274F\362#\275;\024\266\274F\304\226\2756\371\010=\213\374\230\275\226\000\256\273\246M\355<P\034\346\274\223\255A=`4,<\233\241;=P\000[=8\256\026\275\240\030\370<\213\255\023\275@\375\325<\273W2\275\346\343\035=\3403\212<\026\224\005\275+l\'\275@\237\260<\\<\237=+\316#=\240\327\003\274\300\212\204\273\220\002B=\260:m\275\246\363\342<K4\342\274+}E=p\205\363\274V\006\207;\033\206\346<\006\223j=k\256H\274\243\262\233=Rd\220\275\266\213s\274G/\252\275V5\342;0\272\301<\216,\n\275\200\303\r=6U]\274\250N\224\275\304\006\203= tR=\256\224,=d\"\210=\273\007\373<\310{5=\370\237\215=\246\213\211\274\230\032\205\275x\335\'\275`B6\274+\010\026\274\253\016\024\272\310\233C=K\376\332<\013a|\275\246\023\315\274\333\230\240\274x\275O=@\250\367\274\000\317\016\275\326\204[\274\220\246\255\274f\025\250\274\277\374\246\275\324\017\230=c\2525=\256\203!\275\023\370T\275V\377=;\230{B=v\364t\2753\352\000\275\200\305\016=>*\\\275\253\007\030\274\013\263\200\275\346K\236=\020\3767=`\300\235\275pt<\275@\376\361<\200\247\225;\273\351\264<l\236\213\275~\3036\2750\340\032=:\"\202\275\2661\217\274[\032\026=c(1=\026\311\251; \346\305<\276\326\027=+\201\037\274\233\206\272\274\262T\202=\223^\246=(\033\036=p5\025\275\020t\224\275cs\250\275V\037\027:\203\366\002\275\366\311\253\274\226\377?\274\320f\241=[\305\241=\200N\377\273\333\375\314\274\230\303%=\026\346\331\273\034d\242\275\366\206\336<tc\243=hH\207\275&p\223\274\366\013\224<\267\371\212\275;\036\222\275\030\321~=\253\272\361\274\356\033G=\200\035\364;\333\217\246<f|c\275\246\314\221\2740)a=\230\216\034=P`\305\2746\366\'<_\252\202=\246\211\225\275>A[=0+\315\274\373\340\212\274Fm\"=f\310\215\275\253BN\274\307\027\243=k\262\365<\320m\374\274\366\262\224\274\214\227\206=X\365\000={ag=N\315[\275\240\320\304<\200\020t<\213\377m<\014y\236=\316\363<=3Hk=F\340\025=\000u\017=+}m\274\262\240\226\275\320*\220\275V\227T\275p\376\\\275@\257 =kT\323<\326\247\302\274\306\001\202\275\354\003\250=v?\200=\373T\"=\214\356\250=\203\2725\275\353aB\275\373\313G\275\0004\204\273r\247\226\275X\033\207=\253}\014;~\373)=Ns;\275\300\250\014\274\026\2243<{\331\272\274\237\027\241=K\362\033\275+\367\323<\376\230g\275\366\232!\274v\034\265\274[E\023=\223on=\233\007\246<V\356\367\273F\317\256\274\303\316\205=kN\241\274\016jv=\310\336\027\275l\250\214=\300\373\251=\300\372i=#\305C=\346\026\376<.\325\'\275\000\\\202:V\020\353<Va\262\274\213\302t<.\351G=\326 \236\275XW\233\275\316=L\275\013\215&<K\023}\274\366\033\223<\320V\242\274#s_\275vF5<>.g=\350\362L\275/\232\225=k\003\250<pH\250=Zn\234\2750]\243\275\260\232\347<\2346\237\275X\334\213\275\370\217-=\203\261%=\330\203\233\275\273\235u=\366\275\204\274\230i}=kOH\275\"H\242\275kFb\275+\252S\274\360r\252\275V\r\272\273\226Z*\275[\344\236\274V\325F\267\026B\231;o\361\246\275\343\222/=\3063Q\275x\004P=\304b\234=\320\251\343\274\240<\031<`4<=kW\330\273\"\315\216\275.T\031=\023c\"=\270\000;\275&\323e\275\213En\274\306\330\205<\373\236,\275\326F\003\273&\200\023\275F\372\004\275V\332:\274\306\030\002\275\302\030\203=\333`\263<?\274\230=\304\030\232= \'_<\340\000\016\275^\220O=V\016>\273\340\256|=\313\304\221\274w\354\226=\313Y4<\333\254\227\274\246\256^\275\026\235|=\013\2301<\206$\354<H\370\t=+\004\215\273\366\231+\275\306\300\313\274\253 s\273\306\363S=\026\225\307\273\373\020\255\274\013\2169\274\340\'`<\2527\210=\326\312\200=\026\266\237\2736\3734<\366\306\232=\326\365\025=\366\020\020\274\233XJ=\373x\033=FW\267\274\230\024\n=\253o\330;\233s\375\274@+\326\273\353\241\240=\306\017\315<J\347\214\275\366\205Y=`\256\222<\210\350\'=\253\226\2679\033\301\007=\320\016\314<\027\331\225=\266\"4=\030`\025\275\010\3402=k\365\241\273\353\260a=\266\211\357\274\013^\310\274\247\322\235=\366\221p<Km?<\200\003\014<k\000\262;\326\315e;\006N\224\275\266\275\244=\013\357\242=X\373j\275\200\316\250<\276\022\215=\2601\204<^\322\022=\2408~=\273\343\020=V\312v\274\312\337\215\275\376\370 \275H7K\275\253\362\334:X\257q\275x\276X=\300w\206<\323\327\023\275\260\312E\275\006\240\337<\246j\243\274`m\202<vG\000<\213\324)< \362<\274\353\306\205\274\366\022\240\274N\236\003=\206\016\\\275\253\371\377:\336\262\n\275l0\242\275\220\031\300<[Y\322<\'\336\227=nE`=\233\n\247=\326\034\206\275@\216\224\275\266S\324<.H\'=S`\026=`\305`\275*\217\205=\257X\224\275\213\351\265<0\260\002\275\033\255\365\274\330\334\206=\234\235\223=\356\210\004=@\372\030=\000DU;\260EQ\275P\377\261<\237\307\222=\343\005\017=7\025\231\275\006\270\217\274\340\303\331<\000\314{\274VZ\324\274c\241\225\275\353\312\013<\006\337\266<\230\035\233\275\333S\202<km\315<\240\273\376<\036Z^=F\261I\275{d\336<\326v\374;\253A\306\274\300\\\246\273\026f\250=\000\373/;+I\270\274\000:\240:\313\304$\275\353\020F\275\233\345\231\274\316\3110=\200j\323\273\026\334\237\2746\310\r=\276[==`\354{\274 a\254\274v\352f<6\2279\275\233\210{=\000x\276\274\313\311\345\274\302\024\234=\024\037\204\275V\252\267\274\226o\232=\200\224\036\275\246\303\216\274\273\247\243=\006\356\341\274\033\225\035=Sw\022=[\266\203<B\255\220\275h\016]\275\346B\210\275\3120\250\275&b\276\27468 <\276s\225\275n\217\232\275\2266\211;\353\330\375\2746\363{<K\226\215<\244\316\251=\326\247E\273\253 \212\275\243xa\275z<\235\275\353Qz\274\353k\034<\340M\341<\226F\202<P\276\234<\313\322<<\0261\362\273\363 \031\275k\375\240<\213\3013< \340\277\274s\276x=&\031\246\275\253\241\310<\363\257@\275\220\2504=Jy\205=F\322q=\376\341\002=\316\375\"\275[\200\226\274\300\203\277\274\2000%<\250\257%\275N\365%=\216\313F=K1\n\275\220\250\304\274\350\316o\275\323\220=\2750\002(\275\223\274m=#\332\221\275\020b\314<o\t\231=\203\313b\275\306x\226\275\366\3678=p\010Q=&\325\016=@|\206=\363\307W=\200\033T\274\360\240|=+\246+\275\260\n\022=\243\337M\275\240+\231<\003W8=\353_\377<f\3409=\2406N\274\273N\352<@g.<\370\016\216=c\224F=F\233w\275\230\352\005=\260\2415= \035\274<\233\210,\275\342\036\246=\273\013o\275\363\317\212\275\320Q\335<\226-\020=\026&\317;VWN;K\007\017=\256\242q=^\014%\275\020\031\326<\213\205\373\274F\2110\275\320?1\275{\013~\275\347\374\217=\2264\347\274v\335\277\274\326\033\004\273xY^\275&3]=\306\251\324\274\316T5=\200O\306<bj\251\275:\353\234\275\330W\246\275\276\'\231=,\253\233=6y\351<\010\334\r\275\020\206\340<\352\362\200\275v\227]<V\223:\274\373\334i=+}\253;\000\250\320\271@\334\361\273\377\322\243=V\265n\275\376\314\032=\347\217\231\2756\300z<~\014\217\275F\324%=j\267\230=\233\276#\275\377\022\231=\007\322\230\275\273\343\"=\226Yh<\226K\234\274K\217<\274\326h\010=\013\307x\274;\024\245\275\313\231\366\274x\305\220=\334\366\222\275\246 \346\274\226\336\014=\373\220y=:T\200\275\3332l\275\356\352M=v,h=\316\006^=x\360C=c\204\221\275\346\016\341<\000\315E\273\353\243Q<\340|\002\275v \245=\326\371\223\273\213\234i\275\223\3310=V2\345\272;\311T\275\303\331\026\275^AW\275{6\206<\353{\222<\233\373\274\274@\001\340;\260K9\275NL\251\275\200\244\003\273H\310\241=8C~\275Pj\207<\330\211+\275\253\275V\274\313j\237<\310<(\275JX\222\275V\212\251\272\226l\313\2730\017w=\0336\010=\0032D=0rV\275\264\352\237\275SGN\275\372#\211\275V]>\273K\275\312\274k\272\372\273\260\266\300\274\253\203a\274\326\255\227<\254@\247=\273\372\214\274\257\027\214=\337K\231=^U#=fH\264\274po\265<[\305_\275\353\257\350\273H\240\037\275H\260\202\275p\207\220\275\213_\366\274\333Q\252<\000W\346\272\326,<;\343E\017=\246\033\303<\253te=\300\217\243\274\006\227\234<\253HY\272;T\352\274\263!e\275\2008\275\274\037\205\241\275`\336!<7\244\207\275\326f\355\274\226^\005\275\242F\222=C\035\213\275\226\005\243\274\026p\364<@\377\300<,\014\214=\306\253\245<\320\246H=\270\345L\275\036\343S=V\t\355:\326\247\027\274\360-\031\275\213\371\374<\226\2630=\343\342y\275L\371\203\275\030-\010=\302\007\227\275;\212\240\275\250\356v=\353E\331<\300\026\322;VY\374\271\276\316\r=\030\316s\275\253\347\215=\0136>\274+\372\005<\327\217\241\275\326I\246;\020\216P\275\203\020@=\262\036\242\275\342\323\231=k\013\240\274p\337\350\274\000j\014\272.\201\213\275\220+\334<\0025\213=\023c\017\275\000\257\335\274\2136\216\275[O\246<\323j{=\004\360\212=\340\025\333<h\033\031=&\207z\275\226A\t\275?\212\246=\253)\241:(\336\n=\370\345|\275\276\327\214\275\346\273\206=\320\206\027\275\316h8\275\000\342l\273\226F\306\273\273\037\025=#\377T=:p\227=\360\033\312\274\306\002\261\274\302\314\205\275\220Y-\275 5\177\274\016\277.\275V*\006;\240t\222\274vCD=\020\021\225\275V\217\334\272S\023\001\275\226\371\267;\023^8\275\242\023\250\275\000\355\376\272\353Q\364;\030,\224=\363wh\275\266yK\274\0224\212=O`\244=@SP<\020y&\275\250SI=s.w\275 \t\217\275\026S\352;\326OG\275k\362\331<\326\323\023\275\276\262v\275\233n\371\274\376n^\275\003Sp\275\326\2343=\000\372\010\274\266Y\022\275\030S\247\275H\255\202=\336\361I\275\006\375\212=\222\351\220\275\313O\035\275\244\370\243=(\035\017=f\355Z\2758\330_\275\376\021,\275\353a\002=\220\0002=\006k\375\274v4\217\275\230\016d\275\203\345T=\240Xn<8\221\013=s\264/=3\336[\275o\233\200\275CRs\275\242\315\247=+\002\";\026\240\233;\354\214\246\275\326\311`<\272\274\236\275\360\233_\275@\312\256;\2174\230\275\203\246\030=f?r=V&\017\275C\rx=\230\346\204=0\214\235\275\200\375\212;k\004\265\274K\273S\274\266\361?=\023\033/\2750\212b\275\013u\034<v\256\216<\306\3277\275\373>\025\275&\220\231\275\330UA=\333!.\275c\266$=pI\215\275s#d\275+\1773\273G\245\251=\000]1\274\026\010\003\2746\034\226\274K\306D<\366\260\322\274S\371\203=\353G\013<^\250/=+\2144;S\032\200=n\255W\275\320T.\275~\364\006\275\323\254\r\275\026\322\302;\346\370\035=Hh{\275\216.p\275s\277N=\230\260\034=`\251\217<\003{\020=\313\244\037<f\253\351\274v\361Z\274\260\023\263\274@\030\020\275\270\271O\2756{M\274\226\"\\\275\303YE\275#\253U\275\013i\236=\177j\250=\200N;=\313\355\212\274p^\263<\2000\r=\340-U<\030\2100=\303\256\000=\320\214\334<\244M\242=\263\260\215\275k\324\002<F\240\210=g\235\213=\220\n\301\274\220\253c=3[K\275\200\311\253\273\232\177\232=\253=h\274\036\2161=\254T\252=C\216\021\275`\207\021=~(\006\275\273\360\273\274&\020}=@:\330<4_\224\275\230\366\237=\250[q=\213{==\313\342\032<\336\023\035=&i\325\274\013A\356\274\266\2713=vDU<\217\210\243=V\t\304:\300\271\233\273\206>F=\003\032&\275c\235\227\275+\0257;\026\352\247=\017g\202\275vXV<\313__\2758\245\222\275V\021!\272\340\346\362\274F\321\242\274\326\376\340<v\021\240\274v\002\031<\000L\002\273\373\013\202=+\244\353<\273O\367\274\317_\200\275\023\204b=\366D\021\274nG\t=\000\252\023\275h\342q=kYg=\000\003\202;\240\025\261<v*\211<KZ\001= \235*\274\014\014\223\275s\007o\275\013\205S<>\374\251\275\003\311\242\275\263\023<\275\020\2260=k:\314\273\253\200r\275k\334c\275(\251\004\275\033\207{\275#@\237=[\276Z\275\326\3544\275#\361o\275\206\002\367\274N\261\207=\340\360\371<@f\313;sd\250\275\216\367\t=\316\263\237=\253\246\256\272V\026h=+A\334\274\034\010\240\275\000n\010\273\230\021\010=\026\363\025\275\300=\236;vNd<O\316\243=\216\0202\275\302F\224\275(\366\036\275\363\373u=fp\036\275\300*\263\273>pu\2756\272/\275\020w\222\275\3468\314<\220^f=k\3135\274\326\357\305\273\313\005\257<6\377H\274\326`\345;39\014=tZ\203=\336=.=;\030\247<\3777\222=\223\"\230\275\353\275`\275\307\275\212=\256\253\236= \035\037\275\016\000\206=\313\242\034\274\326\277\276\274\000\330R\273\346x\261\274\013\374\273<\3536\317;\000l\332\271\210\202\017\275\276TO=\246\204S\275\253\370\225\272\366\314`=\323\3655\275P\345c\275k|\265<3\"\215\2753V\016\275\322\360\224=h\317D=\356V\232=Z+\243\275\\\201\240\275\020\362\251<p\327\361<c\323E\275\340\302\365<V\346k<K$\021\275\357V\237=\007\023\203=\313`\215=V\240\336\274\000\256\001:\370\210\"\275\334\254\213=\222\t\233=\370E)\275\033h\306<\236\371\220=\266\256-<\373\305\345\274@\310P\274[\351_\275/\"\247=\020\031+\275\260I\225<\342f\225\275@\213\003<\336\361p=\220O\214\275\373D\362<\000[\341:\323\3108=\356\214 \275\326HL\275\350\245\030\275\013\202F\274\323\303\217=\000\276\247\273\363yz\275\220\376A\275{Y\241\274\360\021\310\274\000>\355\273&k\t\275\216\303\"\275\020\240\276<\360F\314<\200U\017\275n\344\000=V%\007\275\253P\177;F\275\214\274\000>\n;\034>\213=\000\020\n\275\203\"\232=+cy\273C\376g\275`Q\357<\353\247\031<`o\247=\234\265\202=\274\216\236\275\262\267\222=\224v\234=\323\3451=VQ\213\273\372m\245=k$\260;k\232\237;+\241\177\273V\3307=k\264\354\273+5\005<\260,\005\275\226\213-<h=/=\236\2605=\356\013\240=+k\365;\270.\236\275\273\004P\275\220\017$\275\200\332\325\273(B\216\275\353\227\210=\254\365\216=~\263v\275\260d\261\274#dP\275\343\200:\275\347\225\234=k\312\"\275\210\003\032=\263\2026=\300\0246<\363&V\275\226\240\303\273\220^\206\274\206\010\252=(\243k=\353T\033<\320\0056=\337\251\205\275s-D=8F =\342\226\250=K\321\301\274\333\212b\275\007\370\215=G\201\246=\326\251\326;\033\326\225<\273\352\245=\257\241\220\275\206\007\321\274\243k{\275\370\364\"=\200\361c=/\377\222\275\300\032\\\274\223\276\232\275S\341{=\277.\210=;\225\336<\000\226\'\272\253 i\272\010Ld=\233\n\353<^T\202\275[%\210<\252/\210=\356\001^=\273;q\275\304]\205\275\030\006V=`$\212=\353\246+\275\200\177U\275+A\236<6\242,\275~K0=;F\000=s\314\206=\246B\211\274\353\362\310\274\274\177\205\275\262\342\227=\366\274.=\3408\030<\313#P\275\374\207\216=\267\210\234=\013\006\251\274c\210E\275\2206\024\275\263\240_=.a\223\275\353\177\032\275\200\300\020\273[\272]=6\3737\274\200W{\275F\001g\275\013\251\335<V\005C\272\3130\251\274\210\220V=(\337\001=@4\271;+\253\310\274\246a`\275\216Y\250\275[O$=V\276\230:\017\373\214=\000\225\364\274\007\256\244\275#$;\275.\010i\275\033\367\207\274ky\226\275\336\211\t= \336u=\200\001\034;\253\343\251\275\026c\355<\020\231\220\274\266x\262<\313\\\314\274X/\202\275\242\t\212\275[\326\311<\013\236\327\274\330C\231=\200\2210\274\213\3102<\313\314`=nh\237=\013\031\370<\217\275\217=\327\355\210=\\\032\251=,<\216\275\243\263\n=\210N\034\275\276Lv\2756D\035<(\356y=\222\305\223=\253i\247\272(|\r=\300T\305\273\266\020G<V\374\253\274\336\245\035\275S\327V\275\324\343\233\275\000\357\037\274\323\200\240=fx\367<\300\201\215;\320\351\220\2756\024\036\274f\232\237\275\366KZ<\026\037\371\274\256\346\207=6.X=s\300\221\275\216\211@=\260\225\257\274#\346\246\275@3\353\274\300$\'<\346\236;=\300\252\234;\264~\201=\343\251\230\275\020\222\024\275\376l\251\275\340O\031\274c\022t\275C<E=\340gN=(8\016\275FK\236=(\235l\275\304,\201\275\313j\205\274\253\310\225<\237_\231=\316\025h\275\217\236\205=\340G\t=\206\301&\275s|_\275@S\343<\253\036\331\273\266\243\210=\026\270#<\023m\235\275\013>\326\274H2\004\275v\343C\275\226\t6\274\030\274\020=\006\301T\275+\202}\274\363\343\023\2753\323U=\357\216\203=x\257\214=\333&\247=F\241\"\275\300\325n\275\266\337t=\246\321\023=\026~`<\320\032?\275\306\'\210\275V\244\342\274x\355\214=FE,\275P\213Y\275\346\330\373<v\002\221=+\255\301;\333\222\264<\206F]=@\327\307\274\347\222\231\275\000+\345;v\335?\275\326\252\007=\300\2003\275\332\260\237=\326\333\004\274\272y\207={4r\275J\363\221\275\336A\"\275\366\000\251\274x\307\201=2\237\204\275\216\322\003\275\366\237\313<\026\035\326;@\211\025\275`ta=VPA\275\253\032\"=\340\261\243<\033\362?\275K\211H<v\361\324<\2005\010\2740\020\323\274;\306%=\230\257\022\275\320\325\231\274\340b;\274@\274\304;\013gN<&\311\212<\032\330\220\275\226\341V\275\226\203\260<\330-\215=>\361^\275P1\302\274\013xY\275\033\004\205\275\353\374\226\275\313\254\311<k\356\311\273\226\211/\275\017\244\246=\326]#\274`2?<\267\224\252=p9s\275\006\266\343\274\"\025\210\275\240E\333<&A\235\274\323\267\247\275\253#\322:\253H\202:\032\022\234=\360b\213<F\257y\275\306\250C=\266\241C=F\377\t=\363\177\013\275\243HJ=\200\023\341\274\026\r\201;\360\323\351<s\001\017\275w\310\226=\223\355\230=\026\356\311;\266\325O\274S,5\275~\002i=\330\027\004\275\343\334\223=\253\336_<\246<\206=\273T/=\336\333w=\360\201\266\274\226a>\274&\330\227\275\203DF=V\006U\274\263,b\275\273\253\311\274\323\352\225\275\240\025\212=v\033,\274[\330\226\274\366\325\024<\000\374\276;\336\217S=\023\234G\275\026\242\210=\360\242-\275\240\352\016<6?\204\274\366\312\025<\326Jw\273\350\370\n=\023bK\275&\266Q\275\206\266[=?\203\213\275\017\030\200=V\032\246\2756$Y\274\303\312\n=N\300\030=\340\310V<+\253\t\273\272I\244=\336\243\205\275`&\215\274+\364V=73\236=f\251\227\274\312\227\231=\216G\007=f\273\200<\272\207\200=\233\216;=\002m\230\275\000\034\"\273\223R\236\275\010\306]\275\226AO<\346\034\224<\360\306\246=\220k\272\274\317\325\210=\210\225\240=`{.\274\'\203\236=\300z\204;0\265\370< \013\206<\263\000K=\320~\374<V\235\206\274\313\227v\275n!R=\000N|;[B\244=\333Ye\275\236\037k\275\373\250\361\274V\322r=&\030\371\274\366B@<V\365K:[Y\333\274\340\n\035<N\202m\275k]*\275\230\006 =\376\001i\275\237\341\202=\300\260\243=0\025\332<\343\034\232\275\246%\330<\253\367S<X\323x\275\266\202\013\275\2701\245=\006\211-=\243\366\203= \253\267\274`\023b<\356C/\275\200T[<\316/\232=\207\371\247=\213dd=\200L^\275kp;<K\251X<[\357\206<\013A\251\274\373C\304\274n\262z\275V\247\351\273H\335\201\275K\025\217\274\314N\232\275\222\235\203=\270\002\204\275\366:\360<\267?\251=n\030i=\023A\252=\320\333\006\275\224\305\210\275\256\310\221\275\240\340t\274\330\307o\275\353\003\002\275\2231#\275\346\243\246=\000W\336<\240\335k<\010\236#\275\366\246\266\274$^\231=s-\017=\033\364\031=vQ\006\274;z\242\275;\343\211<\256\236\203=\030]s=F\264\317<\3134\203\275\330#$=\000\032`\275\302)\204=\013\001L=\320\206|=\020\221\202\2750\225\211<h\017/\275\'\365\204=v\227O=@\177\247=\326\353\210;\246\367\350\2748x\212=\356il=\326F\014;\210\222\021=f\322\024\275N\303C=\330\330\\=\236,^=`\2273\275\320\010\373<\366\337\204\274NP\246=\200\372\266\274v\351Q\275\362c\221\275\370\024\230=b\215\234\275\226:\227\274\316\341\t\275\020\334B\275\2665\230\274[\270\246\274\250\211\223\275\353[\025\275#t\027=\213\000\005=4\222\230=\333\307\216\274\232\243\220\275VG7=\020\226\351\274v\237\305\274.=!=\260$\252=\010\370\221=\033\223\207<\013\261\203\274p\233\222<f6\276\274x\'s=@g\240<(eY=V\3557\2736D+<\006\315c=\000#\032\275\177(\226=\260\020G\275\313P~=\346\357c\275\002\305\212\2756\215\215\275+\320\200\273NT\004=\226\222v<\316yy\275\220g\361\274\3030g\275\233\273\344<+\344\237<\310\025\r=\333l\214=\303E\r\275p\226\\\275.\023_\275\230\337.\275\316\nv=\n\250\202=\240X\354\274\3000\375\273\30685\275v\242\237\274V\374\230\275\243#\036=\260\021!=\213\301v\275\200\203\215\273\346\337\266\274\023\2556=&Dq=\026q9<V_\214\275~\314\206\275Z\207\232=\266\002\224\274\253G\343\273\353c\031\275\006\006?\275\036\357)=VW\017\273v\357i<\224\230\213\275\266\344\212=\356\017^=W\233\251=\344T\204=\316\354\022=\3403 <\014\374\217\275\013\303w\275V\213\206:@\332H=\200\267\001;\343\004)=\300@\250;\340\377j\274\000\203\201<VU\000\271\320\2354\275\313\004\365\274\332\370\205=.\020n=\326*J\274\360\274y\275\372\242\210=k2G\275+\242o;\320\215\332<\000\200\314\272\373\304\303\274#\334\213=\303aE=\242\215\244\275\206_:\275\000\177\027;\253\245\013= 8\013=kH\260\274\250\034w\275\306\214\240=\353>|\275Sd~\275\247b\247=\206h\377<+\203\027=&\304J\275\033\354S\275\013&\307< wf\274\010E\206=\360c\345\274\034\354\245=\033\026\001=V.\026\275G\353\207\275\310!N=\000?\"\275~\256\210\275\013\326?<\203\t.=P\263\227\274v\310\014<#\002\026\275\2403\203=.,\234=[\317^=\244\003\245\275\220\346\233\275\030\206==&\352\223=pD6=+\"\010<\313\t\210\274*\033\200\2756\215>\274\270!\241=\253\303\r\274f\313\243\275 \241E<f\020\233\275\200Nr=V\212\236\273\340\025&<\340\013x<\313\t:\274;>\216<\033\004z\2756\367U<\320\335\002=\023\204r\275\320\017\243\275V\014\304:v\177\270<\340-\300\274p\036W\275+/\257\273>\202&=\376\346F\275\2620\237\275\346\334\244=\307\375\240\275\240tR\274~A =X\003T\275\000<\363\273+\377W\273`\214=<\013\022\240<\016\204#\275\256\274h=\313\370+<\302\223\250=\300=\272;\020&(\275\000\2006;<B\241=\316\344`\275+(\355\273{\336C\275\000\344,\275\247\300\200=?4\226=8\321B=Kde\275\353\0101\275g\223\217\275\300,\345\274\346\024\314<\250mo=\200\247\026\275[\rB\275\240\263\343<J\332\212=kG\345;\306Sv=\246\014\221=kem\274\210\201\236=^\ny=\340\016\267<\304\360\223\275\353\275\322\274k-\222\274Ve\2278\3626\225\275~\242\201=&\247i=\240-J<\026V\212\275\223g_\275bg\251\275\233\306\360\274plP=B\371\201\275>&e=\300%p\274\353\372\003\274\253\215\350\274ke\224<\226\344\361\274\016\000*\275\300\305V<\003\254\212\275\340\360\362<\266\371z\275\032\201\202=\260\373m=k\267\276\273V\245\207;V\241\354;V\003\351<\326\033S\274k}X<\300J\371\273\206\r^\275\210z\003=\"\352\211\275K\242k\274\336\320\240=\2537\231\272\226\325\260\273\323\222\034=ly\235=#J\007=F6\321\274\306gf=\253y\260\273v\326)<\206\200J=\326\330C\274f\365\003=\253}\242\2730l/=.\352t= \374\221<\300\274\311\273\253\344\207\275\260\3479\275\273\257\222\274{\307\227=+\363];\020\027\360<\360\201?\275\200\032\234<f\375k\275V9*\275\034?\234\275\226\221f=\336\001a\275\023\007F\275\036\353Z=\206\001\177=\230\3025=\337W\222=\010\225^\275\313\326\255<\330b)\275\317\220\231\275\353\311=\275\373>\000\275\026\205<\274\253\021\212\274\326:t\273\016\300\233\275\244C\202=\267w\241=\370\201;=\\k\247=\033\212\272\274\253W\374\273\353[\221\275\266\006\030<\226/y\275\207\'\236\275V\016C\273k\001\035\275\316%\207\275\200\252c;\200w,\274bE\233=\326\275\227\273\306\347\233<\234\250\212=\020b\251\274.\375p=\266\343\237=.\256\017\275\317c\212\275\303\250<=\313\001\'\275\254\217\217\275vJ\233\275\006\275\240=$\225\242=\3547\202\275"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 13
          }
          dim {
            dim_value: 48
          }
          dim {
            dim_value: 38
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
