ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::PRelu_0"
    input: "onnx::PRelu_4"
    output: "3"
    name: "PRelu_0"
    op_type: "PRelu"
  }
  name: "torch-jit-export"
  initializer {
    dims: 2
    dims: 1
    dims: 1
    data_type: 1
    name: "onnx::PRelu_4"
    raw_data: "\000\000\200>\000\000\200>"
  }
  input {
    name: "onnx::PRelu_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::PRelu_4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
