ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::GreaterOrEqual_0"
    input: "onnx::GreaterOrEqual_1"
    output: "2"
    name: "GreaterOrEqual_0"
    op_type: "GreaterOrEqual"
  }
  name: "torch_jit"
  input {
    name: "onnx::GreaterOrEqual_0"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "onnx::GreaterOrEqual_1"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
