ir_version: 8
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::ReduceMean_0"
    output: "onnx::Sub_1"
    name: "ReduceMean_2"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "onnx::ReduceMean_0"
    output: "onnx::Gather_2"
    name: "Shape_3"
    op_type: "Shape"
  }
  node {
    output: "onnx::Gather_3"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Gather_2"
    input: "onnx::Gather_3"
    output: "onnx::ReduceProd_4"
    name: "Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::ReduceProd_4"
    output: "onnx::Cast_5"
    name: "ReduceProd_6"
    op_type: "ReduceProd"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::ReduceMean_0"
    input: "onnx::Sub_1"
    output: "onnx::Mul_6"
    name: "Sub_7"
    op_type: "Sub"
  }
  node {
    input: "onnx::Mul_6"
    input: "onnx::Mul_6"
    output: "onnx::ReduceMean_7"
    name: "Mul_8"
    op_type: "Mul"
  }
  node {
    input: "onnx::ReduceMean_7"
    output: "onnx::Mul_8"
    name: "ReduceMean_9"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    input: "onnx::Cast_5"
    output: "onnx::Mul_9"
    name: "Cast_10"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "onnx::Mul_8"
    input: "onnx::Mul_9"
    output: "onnx::Div_10"
    name: "Mul_11"
    op_type: "Mul"
  }
  node {
    output: "onnx::Sub_11"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Mul_9"
    input: "onnx::Sub_11"
    output: "onnx::Div_12"
    name: "Sub_13"
    op_type: "Sub"
  }
  node {
    input: "onnx::Div_10"
    input: "onnx::Div_12"
    output: "onnx::Sqrt_13"
    name: "Div_14"
    op_type: "Div"
  }
  node {
    input: "onnx::Sqrt_13"
    output: "14"
    name: "Sqrt_15"
    op_type: "Sqrt"
  }
  name: "main_graph"
  input {
    name: "onnx::ReduceMean_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "14"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 17
}
