ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "onnx::MaxPool_0"
    output: "1"
    output: "onnx::Sub_2"
    name: "MaxPool_0"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      type: INTS
    }
  }
  node {
    input: "onnx::MaxPool_0"
    output: "3"
    output: "onnx::Slice_4"
    name: "MaxPool_1"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "onnx::Slice_4"
    output: "onnx::Sub_5"
    name: "Slice_2"
    op_type: "Slice"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
    attribute {
      name: "ends"
      ints: 1
      type: INTS
    }
    attribute {
      name: "starts"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "onnx::Sub_2"
    input: "onnx::Sub_5"
    output: "6"
    name: "Sub_3"
    op_type: "Sub"
  }
  name: "torch-jit-export"
  input {
    name: "onnx::MaxPool_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 50
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  output {
    name: "6"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
