ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Loop_33"
    name: "Constant_0"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 9
        raw_data: "\001"
      }
      type: TENSOR
    }
  }
  node {
    output: "5"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    output: "onnx::Gather_6"
    name: "Shape_2"
    op_type: "Shape"
  }
  node {
    output: "onnx::Gather_7"
    name: "Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Gather_6"
    input: "onnx::Gather_7"
    output: "onnx::Unsqueeze_8"
    name: "Gather_4"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Unsqueeze_9"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Unsqueeze_8"
    input: "onnx::Unsqueeze_9"
    output: "onnx::Concat_10"
    name: "Unsqueeze_6"
    op_type: "Unsqueeze"
  }
  node {
    input: "offsets"
    input: "onnx::Concat_10"
    output: "onnx::Slice_11"
    name: "Concat_7"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Slice_12"
    name: "Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_13"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_14"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "onnx::Slice_15"
    name: "Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Slice_11"
    input: "onnx::Slice_13"
    input: "onnx::Slice_14"
    input: "onnx::Slice_12"
    input: "onnx::Slice_15"
    output: "onnx::Shape_16"
    name: "Slice_12"
    op_type: "Slice"
  }
  node {
    input: "onnx::Shape_16"
    output: "onnx::Gather_17"
    name: "Shape_13"
    op_type: "Shape"
  }
  node {
    output: "onnx::Gather_18"
    name: "Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "onnx::Gather_17"
    input: "onnx::Gather_18"
    output: "onnx::Loop_19"
    name: "Gather_15"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "onnx::Loop_19"
    input: "onnx::Loop_33"
    output: "20"
    name: "Loop_16"
    op_type: "Loop"
    attribute {
      name: "body"
      g {
        node {
          input: "onnx::Slice_11"
          input: "21"
          output: "23"
          name: "Gather_17"
          op_type: "Gather"
          attribute {
            name: "axis"
            i: 0
            type: INT
          }
        }
        node {
          input: "onnx::Shape_16"
          input: "21"
          output: "24"
          name: "Gather_18"
          op_type: "Gather"
          attribute {
            name: "axis"
            i: 0
            type: INT
          }
        }
        node {
          output: "25"
          name: "Constant_19"
          op_type: "Constant"
          attribute {
            name: "value"
            t {
              dims: 1
              data_type: 7
              raw_data: "\000\000\000\000\000\000\000\000"
            }
            type: TENSOR
          }
        }
        node {
          input: "23"
          input: "25"
          output: "26"
          name: "Unsqueeze_20"
          op_type: "Unsqueeze"
        }
        node {
          output: "27"
          name: "Constant_21"
          op_type: "Constant"
          attribute {
            name: "value"
            t {
              dims: 1
              data_type: 7
              raw_data: "\000\000\000\000\000\000\000\000"
            }
            type: TENSOR
          }
        }
        node {
          input: "24"
          input: "27"
          output: "28"
          name: "Unsqueeze_22"
          op_type: "Unsqueeze"
        }
        node {
          input: "input"
          input: "26"
          input: "28"
          input: "5"
          output: "29"
          name: "Slice_23"
          op_type: "Slice"
        }
        node {
          input: "weight"
          input: "29"
          output: "30"
          name: "Gather_24"
          op_type: "Gather"
          attribute {
            name: "axis"
            i: 0
            type: INT
          }
        }
        node {
          input: "30"
          output: "31"
          name: "ReduceMean_25"
          op_type: "ReduceMean"
          attribute {
            name: "axes"
            ints: 0
            type: INTS
          }
          attribute {
            name: "keepdims"
            i: 0
            type: INT
          }
        }
        node {
          input: "onnx::Loop_33"
          output: "32"
          name: "Cast_26"
          op_type: "Cast"
          attribute {
            name: "to"
            i: 9
            type: INT
          }
        }
        name: "sub_graph"
        input {
          name: "21"
          type {
            tensor_type {
              elem_type: 7
              shape {
              }
            }
          }
        }
        input {
          name: "22"
          type {
            tensor_type {
              elem_type: 9
              shape {
              }
            }
          }
        }
        output {
          name: "32"
          type {
            tensor_type {
              elem_type: 9
              shape {
              }
            }
          }
        }
        output {
          name: "31"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_param: "Loop20_dim_1"
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
  }
  name: "main_graph"
  initializer {
    dims: 10
    dims: 8
    data_type: 1
    name: "weight"
    raw_data: "\264\314\344\275\017A\376\276\313\374&>J\266a\277s\306\\=\212\032+?\211[t\275\344[\357\276Dk\\\276OKb?\234\'B\277A\334\274\2767N\257\276\320s\263\277\371+\244>:\314\202\277K\200L??\001\275\275\236u4\2774\032\315\277\214\004\224>Z\320\372>\267B\305\276\346G6\277N\265.\276\343\316\272\277t\364a>\201)|>p\223\251\277Qm2?\346\275)\277\354\235\233?\027X\277\277\253\206a?\354\335\226\277L\032o\277\251J\021\277\311\360\215\276\312\274\013\300\252\320\273>\220\"p?\267\020\000<R\262\240\276\343\016\224\2779\241\353?8;\202\277\023\020\234?E\370#>\222\233\314?\334\360?\275|t\303\277\214\351\000\300\3065\302\2775\206\306>X\251\227\277x\2160?U^\251?d\221\350?\237F.?\rp9?9X\004=/c\324\277SL\360\277\'\274<?t\375l?\342\270l?\240\352:>\332\356\226\275\211\035\241>*\271\204\277>\025W>\036K\035?\036\233\200=\035\313\250\276\017\003\346\277\374p_?\313WD?!\006\351\275\232\\q\277\230\007A?"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "offsets"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  output {
    name: "20"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "Loop20_dim_0"
          }
          dim {
            dim_param: "Loop20_dim_1"
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
