ir_version: 4
producer_name: "pytorch"
producer_version: "1.3"
graph {
  node {
    output: "3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000\014\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "3"
    output: "4"
    op_type: "Reshape"
  }
  node {
    output: "5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 12
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 12
        data_type: 1
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "4"
    input: "5"
    input: "6"
    output: "7"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 0.002
      type: FLOAT
    }
  }
  node {
    output: "8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 5
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000\n\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "7"
    input: "8"
    output: "9"
    op_type: "Reshape"
  }
  node {
    input: "weight"
    output: "10"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "9"
    input: "10"
    output: "11"
    op_type: "Mul"
  }
  node {
    input: "bias"
    output: "12"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 1
      ints: 2
      ints: 3
      type: INTS
    }
  }
  node {
    input: "11"
    input: "12"
    output: "13"
    op_type: "Add"
  }
  name: "torch-jit-export"
  initializer {
    dims: 6
    data_type: 1
    name: "bias"
    raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 6
    data_type: 1
    name: "weight"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "13"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
