ir_version: 4
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    input: "x"
    output: "1"
    name: "Shape_0"
    op_type: "Shape"
  }
  node {
    output: "2"
    name: "Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    input: "2"
    output: "3"
    name: "Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "3"
    output: "7"
    name: "Unsqueeze_3"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "7"
    input: "21"
    input: "22"
    input: "23"
    output: "11"
    name: "Concat_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "x"
    input: "11"
    output: "12"
    name: "Reshape_5"
    op_type: "Reshape"
  }
  node {
    input: "12"
    output: "13"
    name: "Transpose_6"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 1
      ints: 2
      type: INTS
    }
  }
  node {
    input: "13"
    output: "14"
    name: "Softmax_7"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: 3
      type: INT
    }
  }
  node {
    input: "14"
    output: "15"
    name: "Transpose_8"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 3
      ints: 2
      ints: 1
      type: INTS
    }
  }
  node {
    input: "3"
    output: "17"
    name: "Unsqueeze_9"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "17"
    input: "24"
    output: "19"
    name: "Concat_10"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "15"
    input: "19"
    output: "20"
    name: "Reshape_11"
    op_type: "Reshape"
  }
  name: "torch-jit-export"
  initializer {
    dims: 1
    data_type: 7
    name: "21"
    raw_data: "\001\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "22"
    raw_data: "\002\000\000\000\000\000\000\000"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "23"
    raw_data: "\377\377\377\377\377\377\377\377"
  }
  initializer {
    dims: 1
    data_type: 7
    name: "24"
    raw_data: "\377\377\377\377\377\377\377\377"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "x_dim_0"
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "20"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "x_dim_0"
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
