ir_version: 7
producer_name: "pytorch"
producer_version: "CURRENT_VERSION"
graph {
  node {
    output: "onnx::Add_1"
    name: "RandomUniform_0"
    op_type: "RandomUniform"
    attribute {
      name: "dtype"
      i: 1
      type: INT
    }
    attribute {
      name: "shape"
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      type: INTS
    }
  }
  node {
    input: "onnx::Add_1"
    input: "onnx::Add_0"
    output: "2"
    name: "Add_1"
    op_type: "Add"
  }
  name: "torch_jit"
  input {
    name: "onnx::Add_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
