ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    output: "1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: FLOAT
        raw_data: "\000\000\200?\000\000\200?\000\000\000@\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "1"
    output: "2"
    op_type: "Upsample"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  name: "torch-jit-export"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
